import React from "react";
import * as Yup from "yup";
import swal from "sweetalert";
import DynamicForm from "../../DynamicForm/DynamicForm";
import { useEffect } from "react";
const questions = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد بیمار :",
    label: "کد بیمار",
    type: "text",
    validation: Yup.string("لطفا کد را به درستی وارد کنید").required(
      "وارد کردن کد بیمار الزامی است"
    ),
    placeholder: "کد بیمار اینجا را وارد نمایید",
  },
  {
    subLabel: "",
    id: "شماره تلفن :",
    label: "شماره تلفن",
    type: "text",
    validation: Yup.string("لطفا شماره تلفن را به درستی وارد کنید").required(
      "وارد کردن شماره تلفن الزامی است"
    ),
    placeholder: "شماره تلفن خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: "",
    id: "سن",
    label: "سن",
    type: "number",
    validation: Yup.number(
      "لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(150, "لطفا سن خود را به درستی وارد نمایید")
      .min(20, "لطفا سن خود را به درستی وارد نمایید")
      .positive("لطفا سن خود را به درستی وارد نمایید")
      .integer(
        "لطفا زمان وارد شده را بدون اعشار و به صورت عدد صحیح وارد نمایید"
      ),
    placeholder: "مثلا : 32",
  },
  {
    subLabel: "",
    id: "قومیت پدری خود را مشخص نمایید :",
    label: "قومیت پدری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت پدری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت مادری خود را مشخص نمایید :",
    label: "قومیت مادری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت مادری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت تاهل را مشخص نمایید :",
    label: "وضعیت تاهل را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "متاهل" },
      { id: "2", label: "مجرد" },
      { id: "3", label: "همسر فوت شده/ بیوه" },
      { id: "4", label: "همسر جدا شده/مطلقه" },
    ],
    validation: Yup.string().required("لطفا وضعیت تاهل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت خود را در خانواده مشخص نمایید :",
    label: "وضعیت خود را در خانواده مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "سرپرست خانواده" },
      { id: "2", label: "همسر سرپرست خانواده" },
      { id: "3", label: "فرزند" },
      { id: "4", label: "پدر و مادر سرپرست خانواده" },
      {
        id: "5",
        label: "پدر و مادر همسر سرپرست خانواده",
      },
      { id: "6", label: "سایر" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خود را در خانواده مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تحصیلات خود را مشخص نمایید :",
    label: "تحصیلات خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "بی سواد" },
      { id: "2", label: "سیکل" },
      { id: "3", label: "دیپلم" },
      { id: "4", label: "فوق دیپلم یا لیسانس" },
      { id: "5", label: "فوق لیسانس یا دکتری" },
    ],
    validation: Yup.string().required("لطفا تحصیلات خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "شغل خود را مشخص نمایید :",
    label: "شغل خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "کارمند" },
      { id: "2", label: "شغل آزاد" },
      { id: "3", label: "کارگر" },
      { id: "4", label: "بازنشسته" },
      { id: "5", label: "بازنشسته شاغل" },
      { id: "6", label: "خانه دار" },
      { id: "7", label: "بیکار" },
      { id: "8", label: "کشاورز" },
      { id: "9", label: "سایر شغل ها" },
    ],
    validation: Yup.string().required("لطفا شغل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در صورتی که در سوال قبل سایر شغل ها انتخاب شده است در این قسمت عنوان شغلی خود را ذکر کنید",
    label:
      "در صورتی که در سوال قبل سایر شغل ها انتخاب شده است، در این قسمت عنوان شغلی خود را ذکر کنید:",
    type: "text",
    validation: Yup.string("لطفا عنوان شغلی را به درستی وارد کنید"),
    placeholder: "عنوان شغلی خود را اینجا وارد نمایید",
  },
  {
    subLabel: "",
    id: "سایر شغل ها",
    label:
      "شغل سرپرست خانواده (تنها در صورتی که فرد تحت سرپرستی شخص دیگری می باشد این قسمت تکمیل گردد): ",
    type: "radio",
    options: [
      { id: "1", label: "کارمند" },
      { id: "2", label: "شغل آزاد" },
      { id: "3", label: "کارگر" },
      { id: "4", label: "بازنشسته" },
      { id: "5", label: "بازنشسته شاغل" },
      { id: "6", label: "خانه دار" },
      { id: "7", label: "بیکار" },
      { id: "8", label: "کشاورز" },
      { id: "9", label: "سایر شغل ها" },
    ],
    validation: Yup.string().required("لطفا شغل سرپرست خانواده را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "سایر شغل های سرپرست خانواده",
    label:
      "در صورتی که در سوال قبل سایر شغل ها انتخاب شده است، در این قسمت عنوان شغلی خود را ذکر کنید:",
    type: "text",
    validation: Yup.string("لطفا عنوان شغلی را به درستی وارد کنید"),
    placeholder: "عنوان شغلی خود را اینجا وارد نمایید",
  },
  {
    subLabel: "",
    id: "تعداد اعضای خانواده:",
    label: "تعداد اعضای خانواده:",
    type: "radio",
    options: [
      { id: "1", label: "1 نفر" },
      { id: "2", label: "2 نفر" },
      { id: "3", label: "3 نفر" },
      { id: "4", label: "4 نفر" },
      { id: "5", label: "بیش از 4 نفر" },
    ],
    validation: Yup.string().required("لطفا تعداد اعضای خانواده را وارد کنید"),
  },
  {
    subLabel: "",
    id: "تعداد اعضای شاغل خانواده:",
    label: "تعداد اعضای شاغل خانواده:",
    type: "radio",
    options: [
      { id: "1", label: "1 نفر" },
      { id: "2", label: "2 نفر" },
      { id: "3", label: "3 نفر" },
      { id: "4", label: "4 نفر" },
      { id: "5", label: "بیش از 4 نفر" },
    ],
    validation: Yup.string().required(
      "لطفا تعداد اعضای شاغل خانواده را وارد کنید"
    ),
  },
  {
    subLabel: "",
    id: "وضعیت محل سکونت خود را مشخص نمایید :",
    label: "وضعیت محل سکونت خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "مسکن شخصی" },
      { id: "2", label: "مسکن اجاره ای یا رهنی" },
      { id: "3", label: "مسکن سازمانی" },
      {
        id: "4",
        label: "در منزل خویشاوندان سکونت دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت محل سکونت خود را مشخص نمایید"
    ),
  },
  {
    subLabel: " (حداقل 1 و حداکثر 3 گزینه میتوانید انتخاب کنید)",
    id: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    label: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "اصفهان" },
      { id: "2", label: "کاشان" },
      { id: "3", label: "خمینی شهر" },
      { id: "4", label: "نجف آباد" },
      { id: "5", label: "لنجان" },
      { id: "6", label: "فلاورجان" },
      { id: "7", label: "شاهین شهر و میمه" },
      { id: "8", label: "شهرضا" },
      { id: "9", label: "مبارکه" },
      { id: "10", label: "برخوار" },
      { id: "11", label: "آران و بیدگل" },
      { id: "12", label: "گلپایگان" },
      { id: "13", label: "سمیرم" },
      { id: "14", label: "تیران" },
      { id: "15", label: "فریدن" },
      { id: "16", label: "نطنز" },
      { id: "17", label: "اردستان" },
      { id: "18", label: "نائین" },
      { id: "19", label: "جرقویه" },
      { id: "20", label: "فریدون شهر" },
      { id: "21", label: "دهاقان" },
      { id: "22", label: "خوانسار" },
      { id: "23", label: "چادگان" },
      { id: "24", label: "ورزنه" },
      { id: "25", label: "بوئین و میان دشت" },
      { id: "26", label: "کوهپایه" },
      { id: "27", label: "هرند" },
      { id: "28", label: "خور و بیابانک" },
      { id: "29", label: "سایر" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("لطفا سابقه سکونت خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "آیا خودرو شخصی دارید؟",
    label: "آیا خودرو شخصی دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله خودرو خارجی دارم" },
      { id: "3", label: "بله خودرو داخلی دارم" },
      {
        id: "4",
        label: "هر دو نوع خودرو داخلی و خارجی را دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خودرو شخصی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    label: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله (مسافرت زیارتی)" },
      { id: "3", label: "بله (مسافرت غیر زیارتی)" },
      {
        id: "4",
        label: "بله (مسافرت زیارتی و غیر زیارتی)",
      },
    ],
    validation: Yup.string().required("لطفا سابقه مسافرت را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "در طول سال گذشته به طور معمول قرص ویتامین دی مصرف کرده اید؟",
    label: "در طول سال گذشته به طور معمول قرص ویتامین دی مصرف کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا سابقه مصرف ویتامین دی را مشخص نمایید "
    ),
  },
  {
    subLabel: "حداقل 1 گزینه و حداکثر 6 گزینه را میتوانید انتخاب کنید",
    id: "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    label:
      "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "مولتی ویتامین" },
      { id: "2", label: "مولتی ویتامین مینرال" },
      { id: "3", label: "کلسیم ویتامین دی" },
      { id: "4", label: "کلسیم" },
      {
        id: "5",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "6", label: "فولیک اسید" },
      { id: "7", label: "امگا 3" },
      { id: "8", label: "روی یا زینک" },
      { id: "9", label: "سایر ویتامین ها" },
      {
        id: "10",
        label: "پروبیوتیک",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
    ],
    validation: Yup.array()
      .required(
        "لطفا سابقه مصرف مکمل ویتامین و یا مواد معدنی خود را مشخص نمایید "
      )
      .max(6, "حداکثر مجاز به انتخاب 6 گزینه می باشید"),
  },
  {
    subLabel: "",
    id: "وضعیت سیگار کشیدن",
    label: "وضعیت سیگار کشیدن",
    type: "radio",
    options: [
      { id: "1", label: "هر روز" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "در گذشته",
      },
      {
        id: "4",
        label: "هرگز",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت سیگار کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا از قلیان استفاده می کنید؟",
    label: "آیا از قلیان استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "در حال حاضر استفاده می کنم" },
      {
        id: "2",
        label: "قبلا استفاده می کردم و ترک کردم",
      },
      {
        id: "3",
        label: "تاکنون قلیان نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت قلیان کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    label:
      "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، خیلی کم",
      },
      {
        id: "3",
        label: "بله، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله، خیلی زیاد",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض دود سیگار یا قلیان بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    label: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به صورت تزریقی",
      },
      {
        id: "3",
        label: "بله، به صورت خوراکی",
      },
      {
        id: "4",
        label: "بله، به صورت استنشاقی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    label: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "3",
        label: "بله ، به صورت هفتگی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "روزانه چند ساعت می خوابید؟",
    label: "روزانه چند ساعت می خوابید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از 6 ساعت" },
      {
        id: "2",
        label: "6 تا 8 ساعت",
      },
      {
        id: "3",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت خواب خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 10" },
      {
        id: "2",
        label: "بین 10 تا 12",
      },
      {
        id: "3",
        label: "بعد از ساعت 12",
      },
      {
        id: "4",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را مشخص نمایید"
    ),
  },

  {
    subLabel: "",
    id: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    label: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 6" },
      {
        id: "2",
        label: "بین 6 تا 8",
      },
      {
        id: "3",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا از رژیم غذایی خاصی پیروی میکند؟",
    label: "آیا از رژیم غذایی خاصی پیروی میکند؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا سابقه تبعیت از رژیم غذایی را مشخص نمایید "
    ),
  },
  {
    subLabel: "",
    id: "آیا عمل جراحی لیزر چشم انجام داده اید؟",
    label: "آیا عمل جراحی لیزر چشم انجام داده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
      { id: "3", label: "مطمئن نیستم" },
    ],
    validation: Yup.string().required(
      "لطفا سابقه عمل جراحی لیزر چشم را مشخص نمایید "
    ),
  },
  {
    subLabel: "",
    id: "آیا در اقوام خود سابقه ابتلا به دیابت داشته اید؟",
    label: "آیا در اقوام خود سابقه ابتلا به دیابت داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
      },
      {
        id: "3",
        label: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
      },
      {
        id: "4",
        label: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  سابقه ابتلا به دیابت را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "DDS1",
    label:
      "احساس میکنم که دیابت روزانه مقدار بسیار زیادی از انرژی فیزیکی و ذهنی من را میگیرد.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS2",
    label:
      "احساس میکنم که پزشک من به قدر کافی درمورد دیابت و مراقبت های آن اطلاعات ندارد.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS3",
    label:
      "هنگامی که فکر میکنم تا آخر عمر باید به عنوان یک فرد دیابتی زندگی کنم ،احساس عصبانیت، ترس و/یا افسردگی دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS4",
    label:
      "احساس میکنم که پزشک من به قدر کافی من را کنترل دیابت راهنمایی نمیکند یا آموزش نمیدهد.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS5",
    label: "احساس میکنم که به دفعات کافی قند خون خود را چک نمیکنم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS6",
    label: "احساس میکنم که اغلب نمیتوانم رژیم/روتین دیابت خود را رعایت کنم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS7",
    label:
      "احساس میکنم که دوستان یا خانواده به اندازه کافی از چالش های من برای مراقبت از خودم بعنوان یک فرد دیابتی حمایت نمی کنند ( برای مثال من را تشویق به خوردن غذاهای نامناسب میکنند).",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS8",
    label: "احساس میکنم که دیابت زندگی من را تحت تاثیر قرار داده است.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS9",
    label:
      "احساس میکنم که دیگران به اندازه کافی نگرانی های من را جدی نمیگیرند.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS10",
    label: "اعتماد به نفس کافی در توانایی کنترل روزانه دیابت خودم ندارم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS11",
    label:
      "احساس میکنم که هر قدر هم در راستای کنترل دیابت خود تلاش کنم، در نهایت دچار مشکلات دراز مدت جدی این بیماری خواهم شد.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS12",
    label:
      "احساس میکنم که رژیم غذایی که رعایت میکنم به اندازه کافی مناسب وضعیت من نیست.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS13",
    label:
      "احساس میکنم که دوستان و خانواده به اندازه کافی به این که زندگی با دیابت چقدر سخت است، توجه ندارند.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS14",
    label: "احساس میکنم از نیاز های مختلف زندگی با دیابت خسته شده ام.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS15",
    label:
      "احساس میکنم که پزشکی که بتوانم در مورد دیابت به طور مرتب به او مراجعه کنم، ندارم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS16",
    label: "به قدر کافی انگیزه برای مدیریت دیابت خودم ندارم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "DDS17",
    label:
      "احساس میکنم که از سمت دوستان و خانواده، حمایت عاطفی که نیاز دارم را دریافت نمی کنم.",
    type: "radio",
    options: [
      { id: "1", label: "مشکل خاصی نیست" },
      {
        id: "2",
        label: "مشکل خفیفی است",
      },
      {
        id: "3",
        label: "مشکل متوسطی است",
      },
      {
        id: "4",
        label: "مشکل نسبتا جدی است",
      },
      {
        id: "5",
        label: "مشکل جدی است",
      },
      {
        id: "6",
        label: "مشکل بسیار جدی است",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ1",
    label: "در طی 2 هفته اخیر، تمایل یا علاقه کمی به انجام کارهایم دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ2",
    label: "در طی 2 هفته اخیر، احساس ناراحتی، افسردگی یا نامیدی دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ3",
    label:
      "در طی 2 هفته اخیر، مشکل در به خواب رفتن یا ادامه خواب یا خوابیدن بیش از حد دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ4",
    label: "در طی 2 هفته اخیر، احساس میکنم انرژی کمی دارم یا خسته هستم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ5",
    label: "در طی 2 هفته اخیر، اشتها کم یا پرخوری دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ6",
    label:
      "در طی 2 هفته اخیر، نسبت به خودم إحساس بدی دارم یا درمورد خودم یا خانواده احساس شکست میکنم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ7",
    label:
      "در طی 2 هفته اخیر، مشکل در تمرکز کردن روی مسائلی مانند خواندن روزنامه یا تماشای تلویزیون دارم.",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ8",
    label:
      "در طی 2 هفته اخیر، حرکت یا صحبت کردن خیلی آهسته که بقیه هم متوجه  شده باشند؟ یا برعکس بسیار بی قراری یا ناآرامی ",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "9-PHQ9",
    label:
      "در طی 2 هفته اخیر، فکر کردن به اینکه شما بهتر بود اکنون زنده نباشید یا به نحوی به خودتان آسیب بزنید",
    type: "radio",
    options: [
      { id: "1", label: "مواجه نشدم" },
      {
        id: "2",
        label: "چند روز",
      },
      {
        id: "3",
        label: "بیشتر از نصف روز",
      },
      {
        id: "4",
        label: "تقریبا هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM1",
    label: "حالت تهوع",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM2",
    label:
      "حس بازگشت و بالا آمدن در حالی که حس کنید میخواهید استفراغ کنید اما نتوانید.",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM3",
    label: "استفراغ کردن",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM4",
    label: "احساس پر بودن شکم",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM5",
    label: "نتوانید یک وعده غذایی خود را کامل بخورید.",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM6",
    label: "إحساس پری بیش از حد بعد از مصرف وعده های غذایی تان",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM7",
    label: "بی اشتهایی",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM8",
    label: "نفخ",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM9",
    label: "ورم معده یا شکم به صورتی که قابل مشاهده باشد.",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM10",
    label: "درد بالای شکم (إحساس درد در بالای ناف)",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM11",
    label: "احساس ناراحتی در بالای شکم (در بالای ناف)",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM12",
    label:
      "إحساس درد در زیر شکم (إحساس درد در بالای ناف) طعم تلخ، اسیدی یا ترش در دهان",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM13",
    label: "إحساس ناراحتی در زیر شکم (زیر ناف)",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM14",
    label: "سوزش قلب )درد ناشی از سوزش در قفسه سینه یا گلو) در طول روز",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM15",
    label: "سوزش قلب )درد ناشی از سوزش در قفسه سینه یا گلو) هنگام دراز کشیدن",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM16",
    label: "احساس ناراحتی در داخل قفسه سینه در شب در طول روز",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM17",
    label: "احساس ناراحتی در داخل قفسه سینه در شب (در زمان خواب)",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM18",
    label:
      "بازگشت غذا به دهان یا رفلاکس (مایع محتویات معده که به گلو برمیگردد) در طول روز",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM19",
    label:
      "بازگشت غذا به دهان یا رفلاکس (مایع محتویات معده که به گلو برمیگردد.) هنگام ",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "(در 2 هفته گذشته)",
    id: "PAGI-SYM20",
    label: "احساس مزه تلخی یا اسیدی یا ترشی در دهان ",
    type: "radio",
    options: [
      { id: "1", label: "أصلا" },
      {
        id: "2",
        label: "خیلی کم",
      },
      {
        id: "3",
        label: "کم",
      },
      {
        id: "4",
        label: "متوسط",
      },
      {
        id: "5",
        label: "شدید",
      },
      {
        id: "6",
        label: "خیلی شدید",
      },
    ],
    validation: Yup.string().required("لطفا به این پاسخ دهید."),
  },
  {
    subLabel: "",
    id: "تعداد روز ورزش شدید در هفته",
    label:
      "در طول 7 روز اخير چند روز آن فعاليت فيزيكي شديد مانند بلند كردن اجسام سنگين، حفاري (مثل كندن باغچه) ، ايروبيك (ورزش هوازي) ، دوچرخه‌‌سواري سريع، فوتبال و دويدن داشته‌ايد؟ (در صورتی که فعالیتی نداشتید عدد صفر را وارد نمایید)",
    type: "number",
    placeholder: "روز در هفته ذکر شود مثلا : 3",
    validation: Yup.string(),
  },
  {
    subLabel: "",
    id: "میزان ساعت ورزش شدید در هفته",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "تعداد روز ورزش متوسط در هفته",
    label:
      "	در طول 7 روز اخير چند روز آن فعاليت فيزيكي متوسط مانند حمل بارهاي سبك، دوچرخه‌‌سواري با سرعت متوسط يا واليبال انجام داده‌ايد؟ لطفاً پياده‌روي را به حساب نياوريد. (در صورتی که فعالیتی نداشتید عدد صفر را وارد نمایید)",
    type: "number",
    placeholder: "روز در هفته ذکر شود مثلا : 3",
    validation: Yup.string(),
  },
  {
    subLabel: "",
    id: "میزان ساعت ورزش متوسط",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "تعداد روز پیاده روی در هفته",
    label:
      "	در طول 7 روز اخير، چند روز آن به مدت حداقل 10 دقيقه و به صورت پيوسته پياده‌روي داشته‌ايد؟ (در صورتی که فعالیتی نداشتید عدد صفر را وارد نمایید)",
    type: "number",
    placeholder: "روز در هفته ذکر شود مثلا : 3",
    validation: Yup.string(),
  },
  {
    subLabel: "",
    id: "میزان ساعت پیاده روی",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "میزان ساعت نشستن",
    label:
      "در طول 7 روز اخير، چه مدت زماني را در هر روز به نشستن اختصاص داده‌ايد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
];
const questionType = "diabeticfootulcerdemographic";
export default function DiabeticFootUlcerDemographic() {
  let isCompletedBefore = localStorage.getItem(questionType);

  useEffect(() => {
    if (isCompletedBefore && !localStorage.getItem(`${questionType}admin`)) {
      swal({
        title: "شما قبلا این پرسشنامه را پر کرده اید",
        icon: "error",
        buttons: "متوجه شدم",
      });
    }
  }, [isCompletedBefore]);

  if (isCompletedBefore && !localStorage.getItem(`${questionType}admin`)) {
    return null; // Return null if the form has been completed before
  }

  return (
    <div className="border-2 my-1 border-blue-500 rounded-lg w-[95%] m-auto">
      <div className="bg-blue-500 rounded-t-lg p-2 text-white font-bold text-xl">
        پرسشنامه (برای بزرگنمایی تصاویر بر روی خود تصویر کلیک کنید)
      </div>
      <DynamicForm questionType={questionType} questions={questions} />
    </div>
  );
}
