import * as Yup from "yup";

const submitSchema = Yup.object().shape({
  name: Yup.string("لطفا نام خود را به درستی وارد کنید")
    .required("وارد کردن نام الزامی است")
    .min(3, "لطفا نام خود را به درستی وارد کنید")
    .matches(
      /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
      "لطفا نام خود را به درستی وارد نمایید"
    ),
  lastName: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
    .required("وارد کردن نام خانوادگی الزامی است")
    .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
    .matches(
      /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
      "لطفا نام خود را به درستی وارد نمایید"
    ),
  IdNum: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
    .required("وارد کردن کد ملی الزامی است")
    .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
    .matches(/^([0-9]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
  mobile: Yup.string()
    .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
    .matches(
      /^((?!(0))9[0-9]{9})$/g,
      "نکته: شماره 10 رقمی موبایل خود را بدون صفر ابتدایی وارد نمایید"
    ),
  homeNum: Yup.string()
    .required("وارد کردن شماره تماس (منزل) الزامی است")
    .min(11, "تعداد ارقام شماره تماس (منزل) حداقل باید 11 عدد باشد")
    .matches(
      /^([0-9]{11})$/g,
      "نکته: شماره تماس (منزل) خود را به درستی وارد نمایید"
    ),
  necessaryNum: Yup.string()
    .required("وارد کردن تلفن همراه جایگزین الزامی است")
    .matches(
      /^((?!(0))[0-9]{10})$/g,
      "نکته: شماره 10 رقمی موبایل خود را بدون صفر ابتدایی وارد نمایید"
    ),
  age: Yup.number("لطفا سن خود را به درستی وارد کنید")
    .required("وارد کردن سن الزامی است")
    .positive("لطفا سن خود را به درستی وارد کنید")
    .integer("لطفا سن خود را به درستی وارد کنید"),
  familyCount: Yup.number("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
    .required("وارد کردن تعداد افراد خانواده الزامی است")
    .positive("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
    .integer("لطفا تعداد افراد خانواده خود را به درستی وارد کنید"),
  height: Yup.number("لطفا قد خود را به درستی وارد کنید")
    .required("وارد کردن قد الزامی است")
    .positive("لطفا قد خود را به درستی وارد کنید")
    .integer("لطفا قد خود را به درستی وارد کنید"),
});

export default submitSchema;
