import React from "react";
import DynamicForm from "../DynamicForm/DynamicForm";
import * as Yup from "yup";
import swal from "sweetalert";

const questions = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "کد ملی",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(
        /^([0-9۰۱۲۳۴۵۶۷۸۹]{10})$/g,
        "نکته: کد ملی خود را به درستی وارد نمایید"
      ),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل)",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .matches(
        /^(09[0-9۰۱۲۳۴۵۶۷۸۹]{9})$/g,
        "نکته: شماره 11 رقمی موبایل خود را به درستی وارد نمایید"
      ),
    placeholder: "مثلا : 09121234567",
  },
  {
    subLabel: "",
    id: "شماره تماس (منزل)",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام شماره تماس (منزل) حداقل باید 11 عدد باشد")
      .matches(
        /^[0-9۰۱۲۳۴۵۶۷۸۹]+$/g,
        "نکته: شماره تماس (منزل) خود را به درستی وارد نمایید"
      ),
    placeholder: "شماره تماس (منزل) خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن تلفن همراه جایگزین الزامی است")
      .matches(
        /^(09[0-9۰۱۲۳۴۵۶۷۸۹]{9})$/g,
        "نکته: شماره 11 رقمی موبایل خود را به درستی وارد نمایید"
      ),
    placeholder: "مثلا : 09121234567",
  },
  {
    subLabel: "عدد باید با کیبورد انگلیسی وارد گردد",
    id: "سن",
    label: "سن",
    type: "text",
    validation: Yup.number(
      "لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن سن الزامی است")
      .positive("لطفا سن خود را به درستی وارد کنید")
      .integer("لطفا سن خود را به درستی وارد کنید")
      .max(150, "لطفا سن خود را به درستی وارد نمایید"),
    placeholder: "مثلا : 32",
  },
  {
    subLabel: "عدد باید با کیبورد انگلیسی وارد گردد",
    id: "وزن (کیلوگرم)",
    label: "وزن (کیلوگرم)",
    type: "text",
    validation: Yup.number("وزن خود را با کیبورد انگلیسی و وارد نمایید")
      .required("وارد کردن وزن الزامی است")
      .positive("لطفا وزن خود را به درستی وارد کنید")
      .integer("لطفا وزن خود را به درستی وارد کنید")
      .max(300, "لطفا وزن خود را به درستی وارد نمایید")
      .min(30, "لطفا وزن خود را به درستی وارد نمایید"),
    placeholder: "منظور وزن با حداقل لباس و بدون کفش می باشد",
  },
  {
    subLabel: "عدد باید با کیبورد انگلیسی وارد گردد",
    id: "قد (برحسب سانتی متر) :",
    label: "قد (برحسب سانتی متر) :",
    type: "text",
    validation: Yup.number(
      "لطفا قد خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن قد الزامی است")
      .positive("لطفا قد خود را به درستی وارد کنید")
      .integer("لطفا قد خود را به درستی وارد کنید")
      .max(300, "لطفا قد خود را به درستی وارد نمایید")
      .min(30, "لطفا قد خود را به درستی وارد نمایید"),
    placeholder: "قد بدون کفش وارد شود",
  },
  {
    subLabel: "",
    id: "جنسیت خود را مشخص نمایید",
    label: "جنسیت خود را مشخص نمایید",
    type: "radio",
    options: [
      {
        id: "زن",
        label: "زن",
      },
      {
        id: "مرد",
        label: "مرد",
      },
    ],
    validation: Yup.string().required("لطفا جنسیت را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت پدری خود را مشخص نمایید :",
    label: "قومیت پدری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "فارس", label: "فارس" },
      { id: "ترک", label: "ترک" },
      { id: "عرب", label: "عرب" },
      { id: "لر", label: "لر" },
      { id: "کرد", label: "کرد" },
      { id: "بلوچ", label: "بلوچ" },
      { id: "سایر قومیت ها", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت پدری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت مادری خود را مشخص نمایید :",
    label: "قومیت مادری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "فارس", label: "فارس" },
      { id: "ترک", label: "ترک" },
      { id: "عرب", label: "عرب" },
      { id: "لر", label: "لر" },
      { id: "کرد", label: "کرد" },
      { id: "بلوچ", label: "بلوچ" },
      { id: "سایر قومیت ها", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت مادری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "شغل خود را مشخص نمایید :",
    label: "شغل خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "کارمند", label: "کارمند" },
      { id: "شغل آزاد", label: "شغل آزاد" },
      { id: "کارگر", label: "کارگر" },
      { id: "بازنشسته", label: "بازنشسته" },
      { id: "بازنشسته شاغل", label: "بازنشسته شاغل" },
      { id: "خانه دار", label: "خانه دار" },
      { id: "بیکار", label: "بیکار" },
      { id: "کشاورز", label: "کشاورز" },
      { id: "سایرشغل ها", label: "سایر شغل ها" },
    ],
    validation: Yup.string().required("لطفا شغل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت تاهل را مشخص نمایید :",
    label: "وضعیت تاهل را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "متاهل", label: "متاهل" },
      { id: "مجرد", label: "مجرد" },
      { id: "همسر فوت شده/ بیوه", label: "همسر فوت شده/ بیوه" },
      { id: "همسر جدا شده/مطلقه", label: "همسر جدا شده/مطلقه" },
    ],
    validation: Yup.string().required("لطفا وضعیت تاهل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت خود را در خانواده مشخص نمایید :",
    label: "وضعیت خود را در خانواده مشخص نمایید :",
    type: "radio",
    options: [
      { id: "سرپرست خانواده", label: "سرپرست خانواده" },
      { id: "همسر سرپرست خانواده", label: "همسر سرپرست خانواده" },
      { id: "فرزند", label: "فرزند" },
      { id: "پدر و مادر سرپرست خانواده", label: "پدر و مادر سرپرست خانواده" },
      {
        id: "پدر و مادر همسر سرپرست خانواده",
        label: "پدر و مادر همسر سرپرست خانواده",
      },
      { id: "سایر", label: "سایر" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خود را در خانواده مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تعداد افراد خانواده شما (مثلا 4):",
    label: "تعداد افراد خانواده شما (مثلا 4):",
    type: "text",
    validation: Yup.number(
      "لطفا تعداد افراد خانواده خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن تعداد افراد خانواده الزامی است")
      .positive("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .integer("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .max(100, "لطفا تعداد افراد خانواده خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر (مثلا 4) را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تحصیلات خود را مشخص نمایید :",
    label: "تحصیلات خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "بی سواد", label: "بی سواد" },
      { id: "ابتدایی", label: "ابتدایی" },
      { id: "راهنمایی", label: "راهنمایی" },
      { id: "دبیرستان", label: "دبیرستان" },
      { id: "دیپلم", label: "دیپلم" },
      { id: "فوق دیپلم", label: "فوق دیپلم" },
      { id: "لیسانس", label: "لیسانس" },
      { id: "فوق لیسانس", label: "فوق لیسانس" },
      { id: "دکتری", label: "دکتری" },
    ],
    validation: Yup.string().required("لطفا تحصیلات خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت محل سکونت خود را مشخص نمایید :",
    label: "وضعیت محل سکونت خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "مسکن شخصی", label: "مسکن شخصی" },
      { id: "مسکن اجاره ای یا رهنی", label: "مسکن اجاره ای یا رهنی" },
      { id: "مسکن سازمانی", label: "مسکن سازمانی" },
      {
        id: "در منزل خویشاوندان سکونت دارم",
        label: "در منزل خویشاوندان سکونت دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت محل سکونت خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    label: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    type: "checkbox",
    options: [
      { id: "اصفهان", label: "اصفهان" },
      { id: "کاشان", label: "کاشان" },
      { id: "خمینی شهر", label: "خمینی شهر" },
      { id: "نجف آباد", label: "نجف آباد" },
      { id: "لنجان", label: "لنجان" },
      { id: "فلاورجان", label: "فلاورجان" },
      { id: "شاهین شهر و میمه", label: "شاهین شهر و میمه" },
      { id: "شهرضا", label: "شهرضا" },
      { id: "مبارکه", label: "مبارکه" },
      { id: "برخوار", label: "برخوار" },
      { id: "آران و بیدگل", label: "آران و بیدگل" },
      { id: "گلپایگان", label: "گلپایگان" },
      { id: "سمیرم", label: "سمیرم" },
      { id: "تیران", label: "تیران" },
      { id: "فریدن", label: "فریدن" },
      { id: "نطنز", label: "نطنز" },
      { id: "اردستان", label: "اردستان" },
      { id: "نائین", label: "نائین" },
      { id: "جرقویه", label: "جرقویه" },
      { id: "فریدون شهر", label: "فریدون شهر" },
      { id: "دهاقان", label: "دهاقان" },
      { id: "خوانسار", label: "خوانسار" },
      { id: "چادگان", label: "چادگان" },
      { id: "ورزنه", label: "ورزنه" },
      { id: "بوئین و میان دشت", label: "بوئین و میان دشت" },
      { id: "کوهپایه", label: "کوهپایه" },
      { id: "هرند", label: "هرند" },
      { id: "خور و بیابانک", label: "خور و بیابانک" },
      { id: "سایر", label: "سایر" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("لطفا سابقه سکونت خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "در صورتی که در شهر اصفهان زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    label:
      "در صورتی که در شهر اصفهان زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    type: "text",
    validation: Yup.string("محل سکونت خود را به درستی وارد نمایید"),
    placeholder:
      "می توانید یک یا بیش از یک منطقه را بنویسید مثلا سپاهان شهر، لاهور، بهارستان و ...",
  },
  {
    subLabel: "",
    id: "آیا خودرو شخصی دارید؟",
    label: "آیا خودرو شخصی دارید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله خودرو خارجی دارم", label: "بله خودرو خارجی دارم" },
      { id: "بله خودرو داخلی دارم", label: "بله خودرو داخلی دارم" },
      {
        id: "هر دو نوع خودرو داخلی و خارجی را دارم",
        label: "هر دو نوع خودرو داخلی و خارجی را دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خودرو شخصی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    label: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله (مسافرت زیارتی)", label: "بله (مسافرت زیارتی)" },
      { id: "بله (مسافرت غیر زیارتی)", label: "بله (مسافرت غیر زیارتی)" },
      {
        id: "بله (مسافرت زیارتی و غیر زیارتی)",
        label: "بله (مسافرت زیارتی و غیر زیارتی)",
      },
    ],
    validation: Yup.string().required("لطفا سابقه مسافرت را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "چند سال از تلفن همراه استفاده می کنید؟",
    label: "چند سال از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "تلفن همراه ندارم", label: "تلفن همراه ندارم" },
      { id: "کمتر از 5 سال", label: "کمتر از 5 سال" },
      { id: "بین 5 تا 10 سال", label: "بین 5 تا 10 سال" },
      { id: "بین 10 تا 20 سال", label: "بین 10 تا 20 سال" },
      { id: "بیشتر از 20 سال", label: "بیشتر از 20 سال" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن را مشخص نمایید"
    ),
  },
  {
    subLabel: "(صحبت کردن، بازی کردن، چت کردن، استفاده از اینترنت و ...)",
    id: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    label: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "تلفن همراه ندارم", label: "تلفن همراه ندارم" },
      { id: "کمتر از 1 ساعت", label: "کمتر از 1 ساعت" },
      { id: "1 تا 2 ساعت", label: "1 تا 2 ساعت" },
      { id: "2 تا 3 ساعت", label: "2 تا 3 ساعت" },
      { id: "3 تا 4 ساعت", label: "3 تا 4 ساعت" },
      { id: "بیش از 4 ساعت", label: "بیش از 4 ساعت" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن همراه را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    label: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و کودهای شیمیایی بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    label:
      "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کشت و کار در منطقه مسکونی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    label: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله، به صورت هفتگی", label: "بله، به صورت هفتگی" },
      { id: "بله، به صورت ماهانه", label: "بله، به صورت ماهانه" },
      { id: "بله، به صورت سالانه", label: "بله، به صورت سالانه" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از  حشره کش ها و آفت کش ها را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    label: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و مواد شیمیایی قرار گرفتن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    label:
      "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    type: "text",
    validation: Yup.number(
      "لطفا فاصله منزلتان تا کارخانه صعنعتی خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .positive(
        "لطفا فاصله منزلتان تا کارخانه صعنعتی خود را به درستی وارد کنید"
      )
      .integer(
        "لطفا فاصله منزلتان تا کارخانه صعنعتی خود را به درستی وارد کنید"
      ),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر (مثلا 20) را وارد نمایید",
  },
  {
    subLabel: "حداقل 1 و حداکثر ۸ گزینه را می‌توانید انتخاب کنید.",
    id: "در طول زندگی خود، به کدامیک از بیماری های زیر مبتلا شده اید؟",
    label: "در طول زندگی خود، به کدامیک از بیماری های زیر مبتلا شده اید؟",
    type: "checkbox",
    options: [
      { id: "دیابت", label: "دیابت" },
      { id: "فشار خون بالا", label: "فشار خون بالا" },
      { id: "سکته قلبی یا مغزی", label: "سکته قلبی یا مغزی" },
      { id: "سرطان", label: "سرطان" },
      { id: "بیماری قلبی", label: "بیماری قلبی" },
      { id: "مشکلات تیروئیدی", label: "مشکلات تیروئیدی" },
      { id: "بیماری کلیوی", label: "بیماری کلیوی" },
      { id: "هپاتیت", label: "هپاتیت" },
      { id: "سرطان کولون (روده)", label: "سرطان کولون (روده)" },
      { id: "سایر سرطان های گوارشی", label: "سایر سرطان های گوارشی" },
      {
        id: "سندورم روده تحریک پذیر(IBS)",
        label: "سندورم روده تحریک پذیر(IBS)",
      },
      { id: "ورم معده", label: "ورم معده" },
      { id: "پولیپ روده", label: "پولیپ روده" },
      { id: "بیماری التهابی روده(IBD)", label: "بیماری التهابی روده(IBD)" },
      { id: "سوزش سر دل یا رفلاکس", label: "سوزش سر دل یا رفلاکس" },
      { id: "کبد چرب", label: "کبد چرب" },
      { id: "هیچکدام", label: "هیچکدام" },
    ],
    validation: Yup.array()
      .max(8, "حداکثر مجاز به انتخاب 8 بیماری هستید")
      .required("لطفا سابقه بیماری خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "آیا تاکنون مبتلا به سرطان روده یا کولون شده اید؟",
    label: "آیا تاکنون مبتلا به سرطان روده یا کولون شده اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      { id: "بله", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ابتلا به بیماری کولون را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در اقوام خود، سابقه ابتلا به سرطان داشته اید؟",
    label: "آیا در اقوام خود، سابقه ابتلا به سرطان داشته اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
        label: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
      },
      {
        id: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
        label: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
      },
      {
        id: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
        label: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  سابقه ابتلا به سرطان را مشخص نمایید"
    ),
  },

  {
    subLabel: "",
    id: "آیا در اقوام خود سابقه ابتلا به سرطان روده یا کولون داشته اید؟",
    label: "آیا در اقوام خود سابقه ابتلا به سرطان روده یا کولون داشته اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
        label: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
      },
      {
        id: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
        label: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
      },
      {
        id: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
        label: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  سابقه ابتلا به سرطان را مشخص نمایید"
    ),
  },
  {
    subLabel: "حداقل 1 گزینه و حداکثر 6 گزینه را میتوانید انتخاب کنید",
    id: "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    label:
      "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    type: "checkbox",
    options: [
      { id: "مولتی ویتامین", label: "مولتی ویتامین" },
      { id: "مولتی ویتامین مینرال", label: "مولتی ویتامین مینرال" },
      { id: "کلسیم ویتامین دی", label: "کلسیم ویتامین دی" },
      { id: "کلسیم", label: "کلسیم" },
      {
        id: "آهن(فروسولفات، فیفول و ...)",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "فولیک اسید", label: "فولیک اسید" },
      { id: "امگا 3", label: "امگا 3" },
      { id: "روی یا زینک", label: "روی یا زینک" },
      { id: "سایر ویتامین ها", label: "سایر ویتامین ها" },
      {
        id: "پروبیوتیک",
        label: "پروبیوتیک",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
    ],
    validation: Yup.array()
      .required(
        "لطفا سابقه مصرف مکمل ویتامین و یا مواد معدنی خود را مشخص نمایید "
      )
      .max(6, "حداکثر مجاز به انتخاب 6 گزینه می باشید"),
  },
  {
    subLabel: "",
    id: "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    label:
      "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله، به صورت مرتب ",
        label: "بله، به صورت مرتب ",
      },
      {
        id: "بله ، گاهی اوقات ",
        label: "بله ، گاهی اوقات ",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف قرص ویتامین دی را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    label: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    type: "radio",
    options: [
      {
        id: "از دست دادن پدر، مادر یا فرزندان",
        label: "از دست دادن پدر، مادر یا فرزندان",
      },
      {
        id: "ابتلا نزدیکان به بیماری های لاعلاج",
        label: "ابتلا نزدیکان به بیماری های لاعلاج",
      },
      {
        id: "طلاق",
        label: "طلاق",
      },
      {
        id: "ترس یا غم های بزرگ دیگری داشتم",
        label: "ترس یا غم های بزرگ دیگری داشتم",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
    ],
    validation: Yup.string().required("لطفا به سوال پاسخ دهید"),
  },
  {
    subLabel: "عدد باید با کیبورد انگلیسی وارد گردد",
    id: "وزن معمول شما قبل از ابتلا به بیماری چقدر بوده است؟ (به کیلوگرم)",
    label: "وزن معمول شما قبل از ابتلا به بیماری چقدر بوده است؟ (به کیلوگرم)",
    type: "text",
    validation: Yup.number(
      "لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن وزن الزامی است")
      .positive("لطفا وزن خود را به درستی وارد کنید")
      .integer("لطفا وزن خود را به درستی وارد کنید")
      .max(300, "لطفا وزن خود را به درستی وارد نمایید")
      .min(30, "لطفا وزن خود را به درستی وارد نمایید"),
    placeholder: "وزن بدون کفش با حداقل لباس منظور می باشد",
  },
  {
    subLabel: "",
    id: "وضعیت سیگار کشیدن",
    label: "وضعیت سیگار کشیدن",
    type: "radio",
    options: [
      { id: "در حال حاضر سیگاری هستم", label: "در حال حاضر سیگاری هستم" },
      {
        id: "قبلا سیگاری بودم و ترک کردم",
        label: "قبلا سیگاری بودم و ترک کردم",
      },
      {
        id: "تاکنون سیگار نکشیده ام",
        label: "تاکنون سیگار نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت سیگار کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، سیگار کشیدن را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، سیگار کشیدن را ترک کردید؟",
    type: "radio",
    options: [
      { id: "اصلا سیگاری نبودم", label: "اصلا سیگاری نبودم" },
      {
        id: "بلی",
        label: "بلی",
      },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت سیگار کشیدن را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا از قلیان استفاده می کنید؟",
    label: "آیا از قلیان استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "در حال حاضر استفاده می کنم", label: "در حال حاضر استفاده می کنم" },
      {
        id: "قبلا استفاده می کردم و ترک کردم",
        label: "قبلا استفاده می کردم و ترک کردم",
      },
      {
        id: "تاکنون قلیان نکشیده ام",
        label: "تاکنون قلیان نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت قلیان کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، قلیان کشیدن را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، قلیان کشیدن را ترک کردید؟",
    type: "radio",
    options: [
      { id: "اصلا قلیان استفاده نمیکردم", label: "اصلا قلیان استفاده نمیکردم" },
      {
        id: "بلی",
        label: "بلی",
      },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت قلیان کشیدن را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    label:
      "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله، خیلی کم",
        label: "بله، خیلی کم",
      },
      {
        id: "بله، گاهی اوقات",
        label: "بله، گاهی اوقات",
      },
      {
        id: "بله، خیلی زیاد",
        label: "بله، خیلی زیاد",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض دود سیگار یا قلیان بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    label: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، به صورت هفتگی",
        label: "بله ، به صورت هفتگی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، مشروبات الکلی را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، مشروبات الکلی را ترک کردید؟",
    type: "radio",
    options: [
      { id: "اصلا مصرف نمی کردم", label: "اصلا مصرف نمی کردم" },
      {
        id: "بله",
        label: "بله",
      },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    label: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله، به صورت تزریقی",
        label: "بله، به صورت تزریقی",
      },
      {
        id: "بله، به صورت خوراکی",
        label: "بله، به صورت خوراکی",
      },
      {
        id: "بله، به صورت استنشاقی",
        label: "بله، به صورت استنشاقی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، مواد مخدر را ترک کرده اید؟",
    label: "آیا بعد از ابتلا به بیماری، مواد مخدر را ترک کرده اید؟",
    type: "radio",
    options: [
      { id: "اصلا مصرف نمی کردم", label: "اصلا مصرف نمی کردم" },
      {
        id: "بله",
        label: "بله",
      },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "روزانه چند ساعت می خوابید؟",
    label: "روزانه چند ساعت می خوابید؟",
    type: "radio",
    options: [
      { id: "کمتر از 6 ساعت", label: "کمتر از 6 ساعت" },
      {
        id: "6 تا 8 ساعت",
        label: "6 تا 8 ساعت",
      },
      {
        id: "بیش از 8 ساعت",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت خواب خود را مشخص نمایید"),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "قبل از ابتلا به بیماری، روزانه چند ساعت می خوابیدید؟",
    label: "قبل از ابتلا به بیماری، روزانه چند ساعت می خوابیدید؟",
    type: "radio",
    options: [
      { id: "کمتر از 6 ساعت", label: "کمتر از 6 ساعت" },
      {
        id: "6 تا 8 ساعت",
        label: "6 تا 8 ساعت",
      },
      {
        id: "بیش از 8 ساعت",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب خود را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "قبل از ساعت 10", label: "قبل از ساعت 10" },
      {
        id: "بین 10 تا 12",
        label: "بین 10 تا 12",
      },
      {
        id: "بعد از ساعت 12",
        label: "بعد از ساعت 12",
      },
      {
        id: "به دلیل شیفت شب، نمی خوابم",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "قبل از ابتلا به بیماری، معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "قبل از ساعت 10", label: "قبل از ساعت 10" },
      {
        id: "بین 10 تا 12",
        label: "بین 10 تا 12",
      },
      {
        id: "بعد از ساعت 12",
        label: "بعد از ساعت 12",
      },
      {
        id: "به دلیل شیفت شب، نمی خوابم",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    label: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    type: "radio",
    options: [
      { id: "قبل از ساعت 6", label: "قبل از ساعت 6" },
      {
        id: "بین 6 تا 8",
        label: "بین 6 تا 8",
      },
      {
        id: "بعد از ساعت 8",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، معمولا صبح ها چه ساعتی از خواب بیدار می شدید؟",
    label:
      "قبل از ابتلا به بیماری، معمولا صبح ها چه ساعتی از خواب بیدار می شدید؟",
    type: "radio",
    options: [
      { id: "قبل از ساعت 6", label: "قبل از ساعت 6" },
      {
        id: "بین 6 تا 8",
        label: "بین 6 تا 8",
      },
      {
        id: "بعد از ساعت 8",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور فاصله بین ناهار تا شام است)",
    id: "آیا در طول روز نیز می خوابید؟",
    label: "آیا در طول روز نیز می خوابید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بلی، کمتر از یک ساعت",
        label: "بلی، کمتر از یک ساعت",
      },
      {
        id: "بلی، بیشتر از یک ساعت",
        label: "بلی، بیشتر از یک ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب در طول روز را مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور فاصله بین ناهار تا شام است)",
    id: "قبل از ابتلا به بیماری، آیا در طول روز نیز می خوابیدید؟",
    label: "قبل از ابتلا به بیماری، آیا در طول روز نیز می خوابیدید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بلی، کمتر از یک ساعت",
        label: "بلی، کمتر از یک ساعت",
      },
      {
        id: "بلی، بیشتر از یک ساعت",
        label: "بلی، بیشتر از یک ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب در طول روز را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، کدام یک از مکمل های غذایی زیر را به صورت معمول و منظم (مصرف بیشتر از یک ماه) استفاده می کردید؟",
    label:
      "قبل از ابتلا به بیماری، کدام یک از مکمل های غذایی زیر را به صورت معمول و منظم (مصرف بیشتر از یک ماه) استفاده می کردید؟",
    type: "checkbox",
    options: [
      { id: "مولتی ویتامین مینرال", label: "مولتی ویتامین مینرال" },
      { id: "مولتی ویتامین", label: "مولتی ویتامین" },
      { id: "کلسیم ویتامین دی", label: "کلسیم ویتامین دی" },
      { id: "کلسیم", label: "کلسیم" },
      {
        id: "آهن(فروسولفات، فیفول و ...)",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "فولیک اسید", label: "فولیک اسید" },
      { id: "امگا 3", label: "امگا 3" },
      { id: "روی یا زینک", label: "روی یا زینک" },
      {
        id: "پروبیوتیک",
        label: "پروبیوتیک",
      },
      {
        id: "ویتامین دی",
        label: "ویتامین دی",
      },
      { id: "سایر ویتامین ها", label: "سایر ویتامین ها" },
    ],
    validation: Yup.array().required(
      "لطفا مکمل های غذایی را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده بودید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله ، خیلی کم",
        label: "بله ، خیلی کم",
      },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، همیشه",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت یبوست طولانی مدت را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده بودید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله، به ندرت",
        label: "بله، به ندرت",
      },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، همیشه",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت اسهال طولانی مدت را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا در مدفوع خود خون مشاهده کرده بودید؟",
    label: "قبل از ابتلا به بیماری، آیا در مدفوع خود خون مشاهده کرده بودید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله ، خیلی کم",
        label: "بله ، خیلی کم",
      },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، همیشه",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مشاهده خون در مدفوع را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن را مشاهده کرده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن را مشاهده کرده بودید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله ، خیلی کم",
        label: "بله ، خیلی کم",
      },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، همیشه",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت قطر مدفوع یا عدم دفع کامل را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به کم خونی بودید؟",
    label: "قبل از ابتلا به بیماری، آیا مبتلا به کم خونی بودید؟",
    type: "radio",
    options: [
      { id: "خیر", label: "خیر" },
      {
        id: "بله ، گاهی اوقات",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "بله ، همیشه",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کم خونی را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، چند بار ام آر آی یا سی تی اسکن داده بودید؟",
    label: "قبل از ابتلا به بیماری، چند بار ام آر آی یا سی تی اسکن داده بودید؟",
    type: "radio",
    options: [
      { id: "اصلا انجام نداده بودم", label: "اصلا انجام نداده بودم" },
      {
        id: "1-3 بار",
        label: "1-3 بار",
      },
      {
        id: "4-6 بار",
        label: "4-6 بار",
      },
      {
        id: "7-10 بار",
        label: "7-10 بار",
      },
      {
        id: "بیش از 10 بار",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  ام آر آی یا سی تی اسکن  را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "(مثل او پی جی و ...)",
    id: "تاکنون چندین مرتبه از دندان های شما عکس برداری شده است؟ ",
    label: "تاکنون چندین مرتبه از دندان های شما عکس برداری شده است؟ ",
    type: "radio",
    options: [
      { id: "اصلا انجام نداده بودم", label: "اصلا انجام نداده بودم" },
      {
        id: "1-3 بار",
        label: "1-3 بار",
      },
      {
        id: "4-6 بار",
        label: "4-6 بار",
      },
      {
        id: "7-10 بار",
        label: "7-10 بار",
      },
      {
        id: "بیش از 10 بار",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت عکس برداری از دندان هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    label: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    type: "radio",
    options: [
      { id: "هیچ مرتبه", label: "هیچ مرتبه" },
      {
        id: "1-3 بار",
        label: "1-3 بار",
      },
      {
        id: "4-6 بار",
        label: "4-6 بار",
      },
      {
        id: "7-10 بار",
        label: "7-10 بار",
      },
      {
        id: "بیش از 10 بار",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت سونوگرافی از اندام هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel:
      "(یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    id: "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    label:
      "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "1-3 بار درماه",
        label: "1-3 بار درماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2-4 بار در هفته",
        label: "2-4 بار در هفته",
      },
      {
        id: "بیش از 4 بار در هفته",
        label: "بیش از 4 بار در هفته",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت انجام ورزش شدید را مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش شدید انجام نمی دهید عدد صفر را وارد کنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟ (به ساعت)",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟ (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا ساعت ورزش خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن ساعت ورزش الزامی است")
      .positive("لطفا ساعت ورزش خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel:
      "(یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    id: "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟",
    label:
      "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "1-3 بار درماه",
        label: "1-3 بار درماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2-4 بار در هفته",
        label: "2-4 بار در هفته",
      },
      {
        id: "4-6 بار در هفته",
        label: "4-6 بار در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ورزش با شدت متوسط را مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش متوسط انجام نمی دهید عدد صفر را وارد کنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد؟ (به ساعت)",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد؟ (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا ساعت ورزش خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن ساعت ورزش الزامی است")
      .positive("لطفا ساعت ورزش خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel: "",
    id: "به طور روزانه، چند ساعت از زمان شما صرف نشستن می شود؟ (به ساعت)",
    label: "به طور روزانه، چند ساعت از زمان شما صرف نشستن می شود؟ (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا زمان نشستن روزانه خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن زمان نشستن روزانه الزامی است")
      .positive("لطفا زمان نشستن روزانه خود را به درستی وارد کنید")
      .max(24, "لطفا زمان را به درستی وارد نمایید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel: "",
    id: "69",
    label:
      "به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شود؟",
    type: "text",
    validation: Yup.number(
      "لطفا ساعت ورزش خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن ساعت ورزش الزامی است")
      .positive("لطفا ساعت ورزش خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    label:
      "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "1-3 بار درماه",
        label: "1-3 بار درماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2-4 بار در هفته",
        label: "2-4 بار در هفته",
      },
      {
        id: "بیش از 4 بار در هفته",
        label: "بیش از 4 بار در هفته",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت انجام ورزش شدید را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش شدید انجام نمی دهید عدد صفر را وارد کنید)",
    id: "با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامید؟ (به ساعت)",
    label:
      "با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامید؟ (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا ساعت ورزش خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن ساعت ورزش الزامی است")
      .positive("لطفا ساعت ورزش خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    label:
      "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "1-3 بار درماه",
        label: "1-3 بار درماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2-4 بار در هفته",
        label: "2-4 بار در هفته",
      },
      {
        id: "4-6 بار در هفته",
        label: "4-6 بار در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ورزش با شدت متوسط را مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش متوسط انجام نمی دهید عدد صفر را وارد کنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد (به ساعت)",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا ساعت ورزش خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن ساعت ورزش الزامی است")
      .positive("لطفا ساعت ورزش خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1) وارد نمایید",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف نشستن می شد؟ (به ساعت)",
    label:
      "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف نشستن می شد؟ (به ساعت)",
    type: "text",
    validation: Yup.number(
      "لطفا زمان نشستن روزانه خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن زمان نشستن روزانه الزامی است")
      .positive("لطفا زمان نشستن روزانه خود را به درستی وارد کنید")

      .max(24, "لطفا زمان را به درستی وارد نمایید"),
    placeholder: "مثلا: 2",
  },
  {
    //قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شد؟
    subLabel: "",
    id: "75",
    label:
      "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شد؟",
    type: "text",
    validation: Yup.number(
      "لطفا زمان فعالیت بدنی خفیف خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("وارد کردن زمان فعالیت بدنی خفیف الزامی است")
      .positive("لطفا زمان فعالیت بدنی خفیف خود را به درستی وارد کنید"),
    placeholder:
      "کیبورد خود را به زبان انگلیسی برگردانید و عدد مورد نظر را (مثلا 1.30) وارد نمایید",
  },
];
const questionType = "casedemographic";
export default function CaseDemographic() {
  let isCompletedBefore = localStorage.getItem(questionType);
  return (
    <>
      {isCompletedBefore ? (
        swal({
          title: "شما قبلا این پرسشنامه را پر کرده اید",
          icon: "error",
          buttons: "متوجه شدم",
        })
      ) : (
        <div className="border-2 my-1 border-blue-500 rounded-lg w-[95%] m-auto">
          <div className="bg-blue-500 rounded-t-lg p-2 text-white font-bold text-xl">
            پرسشنامه
          </div>
          <DynamicForm questionType={questionType} questions={questions} />
        </div>
      )}
    </>
  );
}
