import React from "react";
import DynamicForm from "../DynamicForm/DynamicForm";
import * as Yup from "yup";
import swal from "sweetalert";

const questions = [
  {
    subLabel: "",
    id: "نام :",
    label: "نام :",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی :",
    label: "نام خانوادگی :",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .matches(
        /^(09[0-9]{9})$/g,
        "نکته: شماره 11 رقمی موبایل خود را به درستی وارد نمایید"
      ),
    placeholder: "تلفن همراه (موبایل) خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام شماره تماس (منزل) حداقل باید 11 عدد باشد")
      .matches(
        /^([0-9]{11})$/g,
        "نکته: شماره تماس (منزل) خود را به درستی وارد نمایید"
      ),
    placeholder: "شماره تماس (منزل) خود را وارد نمایید",
  },
  {
    subLabel: "میان وعده ها را درنظر نگیرید",
    id: "روزانه چند وعده غذایی اصلی می خورید؟",
    label: "روزانه چند وعده غذایی اصلی می خورید؟",
    type: "radio",
    options: [
      { id: "1 وعده", label: "1 وعده" },
      {
        id: "2 وعده",
        label: "2 وعده",
      },
      {
        id: "3 وعده",
        label: "3 وعده",
      },
      {
        id: "4 وعده",
        label: "4 وعده",
      },
      {
        id: "5 وعده یا بیشتر",
        label: "5 وعده یا بیشتر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف وعده غذایی را مشخص نمایید"
    ),
  },
  {
    subLabel:
      " (منظور خوردن هر چیزی خارج از وعده های غذایی است، مثلا خوردن یک سیب یا یک تکه کیک، یا یک لیوان شیر یا یک شکلات یا …)",
    id: "روزانه چند میان وعده دارید؟ ",
    label: "روزانه چند میان وعده دارید؟ ",
    type: "radio",
    options: [
      { id: "میان وعده نمی خورم", label: "میان وعده نمی خورم" },
      {
        id: "1 تا 2 میان وعده",
        label: "1 تا 2 میان وعده",
      },
      {
        id: "3 تا 5 میان وعده",
        label: "3 تا 5 میان وعده",
      },
      {
        id: "بیشتر از 5 میان وعده",
        label: "بیشتر از 5 میان وعده",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف میان وعده را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    label: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    type: "radio",
    options: [
      { id: "صبحانه", label: "صبحانه" },
      {
        id: "ناهار",
        label: "ناهار",
      },
      {
        id: "عصرانه",
        label: "عصرانه",
      },
      {
        id: "شام",
        label: "شام",
      },
    ],
    validation: Yup.string().required("لطفا حجیم ترین وعده را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در هنگام غذاخوردن چقدر غذای خود را می جوید؟",
    label: "در هنگام غذاخوردن چقدر غذای خود را می جوید؟",
    type: "radio",
    options: [
      { id: "کم (کمتر از 20 ثانیه)", label: "کم (کمتر از 20 ثانیه)" },
      {
        id: "متوسط (بین 20 تا 40 ثانیه)",
        label: "متوسط (بین 20 تا 40 ثانیه)",
      },
      {
        id: "زیاد (بیش از 40 ثانیه)",
        label: "زیاد (بیش از 40 ثانیه)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    label: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "ناهار نمی خورم", label: "ناهار نمی خورم" },
      {
        id: "کمتر از 10 دقیقه",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "20-10 دقیقه",
        label: "20-10 دقیقه",
      },
      {
        id: "بیشتر از 20 دقیقه",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شام خوردن شما چقدر طول می کشد؟",
    label: "معمولا شام خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "ناهار نمی خورم", label: "ناهار نمی خورم" },
      {
        id: "کمتر از 10 دقیقه",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "20-10 دقیقه",
        label: "20-10 دقیقه",
      },
      {
        id: "بیشتر از 20 دقیقه",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    label: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    type: "radio",
    options: [
      { id: "کمتر از نیم ساعت", label: "کمتر از نیم ساعت" },
      {
        id: "دراز نمی کشم",
        label: "دراز نمی کشم",
      },
      {
        id: "نیم تا 2 ساعت",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4-2 ساعت",
        label: "4-2 ساعت",
      },
      {
        id: "بیشتر از 4 ساعت",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    label: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "کمتر از نیم ساعت", label: "کمتر از نیم ساعت" },
      {
        id: "نیم تا 2 ساعت",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4-2 ساعت",
        label: "4-2 ساعت",
      },
      {
        id: "بیشتر از 4 ساعت",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثلا خوردن یک میوه یا یک لیوان چای) ",
    id: "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    label:
      "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "میان وعده نمی خورم", label: "میان وعده نمی خورم" },
      {
        id: "کمتر از نیم ساعت",
        label: "کمتر از نیم ساعت",
      },
      {
        id: "نیم تا 2 ساعت",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "بیشتر از 2 ساعت",
        label: "بیشتر از 2 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چند روز در هفته صبحانه می خورید؟",
    label: "چند روز در هفته صبحانه می خورید؟",
    type: "radio",
    options: [
      { id: "هرگز یا 1 روز در هفته", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2 تا 4 روز در هفته",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "5 تا 6 روز در هفته",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    label:
      "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    type: "radio",
    options: [
      { id: "هرگز یا 1 روز در هفته", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2 تا 4 روز در هفته",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "5 تا 6 روز در هفته",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته ناهار می خورید؟",
    label: "معمولا چند روز در هفته ناهار می خورید؟",
    type: "radio",
    options: [
      { id: "هرگز یا 1 روز در هفته", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2 تا 4 روز در هفته",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "5 تا 6 روز در هفته",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (شام های سبک را نیز درنظر بگیرید)",
    id: "معمولا چند روز در هفته شام می خورید؟",
    label: "معمولا چند روز در هفته شام می خورید؟",
    type: "radio",
    options: [
      { id: "هرگز یا 1 روز در هفته", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2 تا 4 روز در هفته",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "5 تا 6 روز در هفته",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته عصرانه می خورید؟",
    label: "معمولا چند روز در هفته عصرانه می خورید؟",
    type: "radio",
    options: [
      { id: "هرگز یا 1 روز در هفته", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2 تا 4 روز در هفته",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "5 تا 6 روز در هفته",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    label:
      "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "هیچ وقت", label: "هیچ وقت" },
      {
        id: "گاهی",
        label: "گاهی",
      },
      {
        id: "اغلب",
        label: "اغلب",
      },
      {
        id: "همیشه",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    label:
      "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "مصرف نمی کنم", label: "مصرف نمی کنم" },
      {
        id: "1 لیوان یا کمتر",
        label: "1 لیوان یا کمتر",
      },
      {
        id: "3-2 لیوان",
        label: "3-2 لیوان",
      },
      {
        id: "بیش از 3 لیوان",
        label: "بیش از 3 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    label:
      "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    type: "radio",
    options: [
      { id: "معمولی", label: "معمولی" },
      {
        id: "سرد",
        label: "سرد",
      },
      {
        id: "خیلی سرد",
        label: "خیلی سرد",
      },
      {
        id: "در این زمان ها مایعات مصرف نمی کنم",
        label: "در این زمان ها مایعات مصرف نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    label: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    type: "radio",
    options: [
      { id: "هیچ وقت", label: "هیچ وقت" },
      {
        id: "گاهی",
        label: "گاهی",
      },
      {
        id: "اغلب",
        label: "اغلب",
      },
      {
        id: "همیشه",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    label: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "تقریبا هرگز", label: "تقریبا هرگز" },
      {
        id: "1 تا 3 بار در هفته",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "4 تا 6 بار در هفته",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    label: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "روغن مخصوص سرخ کردن", label: "روغن مخصوص سرخ کردن" },
      {
        id: "روغن مایع معمولی",
        label: "روغن مایع معمولی",
      },
      {
        id: "روغن نباتی جامد",
        label: "روغن نباتی جامد",
      },
      {
        id: "کره یا مارگارین",
        label: "کره یا مارگارین",
      },
      {
        id: "روغن زیتون",
        label: "روغن زیتون",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    label: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "بلی", label: "بلی" },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    label:
      "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    type: "radio",
    options: [
      { id: "بلی", label: "بلی" },
      {
        id: "همه را دور می ریزم",
        label: "همه را دور می ریزم",
      },
      {
        id: "تاکنون با چنین موردی مواجه نشدم",
        label: "تاکنون با چنین موردی مواجه نشدم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    label: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "کمتر از یک بار در ماه",
        label: "کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 3 بار در هفته",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "4 تا 6 بار در هفته",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "روزانه",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },

  {
    subLabel: " (مثل برنج دودی، ماهی دودی، بادمجان دودی و …)",
    id: "آیا شما از غذای دودی استفاده می کنید؟",
    label: "آیا شما از غذای دودی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "هرگز", label: "هرگز" },
      {
        id: "کمتر از یک بار در ماه",
        label: "کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 3 بار در هفته",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "روزانه",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "روزانه چند لیوان آب می نوشید؟",
    label: "روزانه چند لیوان آب می نوشید؟",
    type: "radio",
    options: [
      { id: "صفر", label: "صفر" },
      {
        id: "1 تا 2 لیوان",
        label: "1 تا 2 لیوان",
      },
      {
        id: "2 تا 5 لیوان",
        label: "2 تا 5 لیوان",
      },
      {
        id: "5 تا 8 لیوان",
        label: "5 تا 8 لیوان",
      },
      {
        id: "بیشتر از 8 لیوان",
        label: "بیشتر از 8 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    label: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "مصرف نمی کنم", label: "مصرف نمی کنم" },
      {
        id: "آب معدنی",
        label: "آب معدنی",
      },
      {
        id: "اب لوله کشی",
        label: "اب لوله کشی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    label: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "مصرف نمی کنم", label: "مصرف نمی کنم" },
      {
        id: "آبمیوه صنعتی",
        label: "آبمیوه صنعتی",
      },
      {
        id: "آبمیوه طبیعی",
        label: "آبمیوه طبیعی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    label: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    type: "radio",
    options: [
      { id: "چای مصرف نمی کنم", label: "چای مصرف نمی کنم" },
      {
        id: "1 تا 2 عدد",
        label: "1 تا 2 عدد",
      },
      {
        id: "3 تا 4 عدد",
        label: "3 تا 4 عدد",
      },
      {
        id: "5 عدد یا بیشتر",
        label: "5 عدد یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    label: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    type: "radio",
    options: [
      {
        id: "کم چرب ( کمتر از 2 درصد چربی)",
        label: "کم چرب ( کمتر از 2 درصد چربی)",
      },
      {
        id: "بین 2 تا 2.5 درصد چربی",
        label: "بین 2 تا 2.5 درصد چربی",
      },
      {
        id: "محلی یا پرچرب (بیشتر از 2.5 درصد چربی)",
        label: "محلی یا پرچرب (بیشتر از 2.5 درصد چربی)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (منظور سویا اضافه شده به غذا، آجیل سویا و شیرسویا می باشد)",
    id: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "هرگز",
        label: "هرگز",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "هرگز",
        label: "هرگز",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "هر روز",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    label: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    type: "radio",
    options: [
      {
        id: "هرگز",
        label: "هرگز",
      },
      {
        id: "گاهی",
        label: "گاهی",
      },
      {
        id: "اغلب",
        label: "اغلب",
      },
      {
        id: "همیشه",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    label: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "کم نمک",
        label: "کم نمک",
      },
      {
        id: "با نمک متوسط",
        label: "با نمک متوسط",
      },
      {
        id: "پرنمک",
        label: "پرنمک",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    label: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "نمک ید دار",
        label: "نمک ید دار",
      },
      {
        id: "نمک دریا",
        label: "نمک دریا",
      },
      {
        id: "نمک سنتی",
        label: "نمک سنتی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    label: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    type: "radio",
    options: [
      {
        id: "هیچ یک",
        label: "هیچ یک",
      },
      {
        id: "شام",
        label: "شام",
      },
      {
        id: "ناهار",
        label: "ناهار",
      },
      {
        id: "صبحانه",
        label: "صبحانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا می توانید هر غذایی را بجوید؟",
    label: "آیا می توانید هر غذایی را بجوید؟",
    type: "radio",
    options: [
      {
        id: "بله مشکلی ندارم",
        label: "بله مشکلی ندارم",
      },
      {
        id: "فقط می توانم غذاهای خیلی نرم یا خمیری را بجوم",
        label: "فقط می توانم غذاهای خیلی نرم یا خمیری را بجوم",
      },
      {
        id: "میتوانم غذاهای نسبتا سفت را نیز بجوم",
        label: "میتوانم غذاهای نسبتا سفت را نیز بجوم",
      },
      {
        id: "هیچ غذایی را نمی توانم به خوبی بجوم",
        label: "هیچ غذایی را نمی توانم به خوبی بجوم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    label: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "مصرف نمی کنم",
        label: "مصرف نمی کنم",
      },
      {
        id: "داغ",
        label: "داغ",
      },
      {
        id: "ولرم",
        label: "ولرم",
      },
      {
        id: "سرد",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    label: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "مصرف نمی کنم",
        label: "مصرف نمی کنم",
      },
      {
        id: "داغ",
        label: "داغ",
      },
      {
        id: "ولرم",
        label: "ولرم",
      },
      {
        id: "سرد",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (حداکثر ۳ گزینه را می‌توانید انتخاب کنید)",
    id: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    label: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    type: "checkbox",
    options: [
      { id: "تفلون", label: "تفلون" },
      { id: "استیل", label: "استیل" },
      { id: "روی", label: "روی" },
      { id: "چدنی", label: "چدنی" },
      { id: "مسی", label: "مسی" },
      { id: "سرامیکی یا گرانیتی", label: "سرامیکی یا گرانیتی" },
      { id: "سنگی", label: "سنگی" },
      { id: "آلومینیومی", label: "آلومینیومی" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    label: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "بلی",
        label: "بلی",
      },
      {
        id: "خیر",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    label: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    type: "checkbox",
    options: [
      { id: "ملامینی", label: "ملامینی" },
      { id: "فلزی", label: "فلزی" },
      { id: "چینی", label: "چینی" },
      { id: "گلی یا سفالی", label: "گلی یا سفالی" },
      { id: "پلاستیکی", label: "پلاستیکی" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
];
const questionType = "casehabit";

export default function CaseHabit() {
  let isCompletedBefore = localStorage.getItem(questionType);
  return (
    <>
      {isCompletedBefore ? (
        swal({
          title: "شما قبلا این پرسشنامه را پر کرده اید",
          icon: "error",
          buttons: "متوجه شدم",
        })
      ) : (
        <div className="border-2 my-1 border-blue-500 rounded-lg w-[95%] m-auto">
          <div className="bg-blue-500 rounded-t-lg p-2 text-white font-bold text-xl">
            پرسشنامه
          </div>
          <DynamicForm questionType={questionType} questions={questions} />
        </div>
      )}
    </>
  );
}
