import React from "react";
import DynamicFormFFQ from "../DynamicForm/DynamicFormFFQ";
import * as Yup from "yup";
import swal from "sweetalert";

const questions = [
  {
    img: "",
    subLabel: "",
    id: "نام :",
    label: "نام :",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "نام خانوادگی :",
    label: "نام خانوادگی :",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .matches(
        /^(09[0-9]{9})$/g,
        "نکته: شماره 11 رقمی موبایل خود را به درستی وارد نمایید"
      ),
    placeholder: "تلفن همراه (موبایل) خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام شماره تماس (منزل) حداقل باید 11 عدد باشد")
      .matches(
        /^([0-9]{11})$/g,
        "نکته: شماره تماس (منزل) خود را به درستی وارد نمایید"
      ),
    placeholder: "شماره تماس (منزل) خود را وارد نمایید",
  },
  {
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک پیش دستی در یک ماه",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در یک ماه",
      },
      {
        id: "1 تا 3 پیش دستی در ماه",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "یک پیش دستی درهفته",
        label: "یک پیش دستی درهفته",
      },
      {
        id: "2 تا 4 پیش دستی درهفته",
        label: "2 تا 4 پیش دستی درهفته",
      },
      {
        id: "5 تا 6 پیش دستی در هفته",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "یک پیش دستی در روز",
        label: "یک پیش دستی در روز",
      },
      {
        id: "2 تا 3 پیش دستی در روز",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "آب گوشت و گوشت کوبیده آن را درنظر بگیرید",
    id: "ابگوشت",
    label: "ابگوشت",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بار در ماه",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2 تا 4 بار در هفته",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "1 تا 2 بار در روز",
        label: "1 تا 2 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بار در ماه",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2 تا 4 بار در هفته",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "1 تا 2 بار در روز",
        label: "1 تا 2 بار در روز",
      },
      {
        id: "2 تا 3 بار در روز",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوپ.jpg",
    subLabel: "انواع سوپ ها را درنظر بگیرید",
    id: "سوپ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "1 تا 3 بشقاب در ماه",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "یک بشقاب در هفته",
        label: "یک بشقاب در هفته",
      },
      {
        id: "2 تا 4 بشقاب در هفته",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5 تا 6 بشقاب در هفته",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "یک بشقاب در روز",
        label: "یک بشقاب در روز",
      },
      {
        id: "2 تا 3 بشقاب در روز",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "4 تا 5 بشقاب در روز",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "1 تا 2 کاسه در روز",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 کاسه یا بیشتر در روز",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم بادمجون.gif",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 کاسه یا بیشتر در روز",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "کاسه ماست خوری",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "1 تا 3 پیش دستی در ماه",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "یک پیش دستی در هفته",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "2 تا 4 پیش دستی در هفته",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5 تا 6 پیش دستی در هفته",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "یک پیش دستی در روز",
        label: "یک پیش دستی در روز",
      },
      {
        id: "2 تا 3 پیش دستی در روز",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج استامبلی.jpg",
    subLabel: "در کل قاطی پلوها",
    id: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    label: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "1 تا 3 بشقاب در ماه",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "یک بشقاب در هفته",
        label: "یک بشقاب در هفته",
      },
      {
        id: "2 تا 4 بشقاب در هفته",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5 تا 6 بشقاب در هفته",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "یک بشقاب در روز",
        label: "یک بشقاب در روز",
      },
      {
        id: "2 تا 3 بشقاب در روز",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابیجات و … استفاده می شود. ",
    id: "پلو سفید",
    label: "پلو سفید",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "1 تا 3 بشقاب در ماه",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "یک بشقاب در هفته",
        label: "یک بشقاب در هفته",
      },
      {
        id: "2 تا 4 بشقاب در هفته",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5 تا 6 بشقاب در هفته",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "یک بشقاب در روز",
        label: "یک بشقاب در روز",
      },
      {
        id: "2 تا 3 بشقاب در روز",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "4 تا 5 بشقاب در روز",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی",
    label: "خورشت قورمه سبزی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "قیمه بادمجان (قیمه بدون بادمجان را درنظر نگیرید)",
    id: "خورشت قیمه بادمجان",
    label: "خورشت قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قیمه.jpg",
    subLabel: "",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت لوبیا سبز.jpg",
    subLabel: "",
    id: "خورشت لوبیا سبز",
    label: "خورشت لوبیا سبز",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت گوشت چرخ کرده.jpg",
    subLabel: "",
    id: "خورشت گوشت چرخ کرده",
    label: "خورشت گوشت چرخ کرده",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "1 تا 3 کاسه خورشتی در ماه",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "یک کاسه خورشتی در هفته",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "2 تا 4 کاسه خورشتی در هفته",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5 تا 6 کاسه خورشتی در هفته",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "یک کاسه خورشتی در روز",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "2 تا 3 کاسه خورشتی در روز",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "کباب کوبیده را درنظر نگیرید",
    id: "کباب تابه ای",
    label: "کباب تابه ای",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب کوبیده.jpg",
    subLabel: "",
    id: "کباب کوبیده",
    label: "کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "1 تا 3 سیخ در ماه",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "یک سیخ در هفته",
        label: "یک سیخ در هفته",
      },
      {
        id: "2 تا 4 سیخ در هفته",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5 تا 6 سیخ در هفته",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "یک سیخ در روز",
        label: "یک سیخ در روز",
      },
      {
        id: "2 تا 4 سیخ در روز",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب برگ.jpg",
    subLabel: "",
    id: "کباب برگ",
    label: "کباب برگ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "1 تا 3 سیخ در ماه",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "یک سیخ در هفته",
        label: "یک سیخ در هفته",
      },
      {
        id: "2 تا 4 سیخ در هفته",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5 تا 6 سیخ در هفته",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "یک سیخ در روز",
        label: "یک سیخ در روز",
      },
      {
        id: "2 تا 4 سیخ در روز",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب",
    label: "جوجه کباب",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "1 تا 3 سیخ در ماه",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "یک سیخ در هفته",
        label: "یک سیخ در هفته",
      },
      {
        id: "2 تا 4 سیخ در هفته",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5 تا 6 سیخ در هفته",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "یک سیخ در روز",
        label: "یک سیخ در روز",
      },
      {
        id: "2 تا 4 سیخ در روز",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "یک واحد=یک ران یا نصف سینه مرغ",
    id: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    label: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک واحد در ماه",
        label: "تقریبا هرگز یا کمتر از یک واحد در ماه",
      },
      {
        id: "1 تا 3 واحد در ماه",
        label: "1 تا 3 واحد در ماه",
      },
      {
        id: "یک واحد در هفته",
        label: "یک واحد در هفته",
      },
      {
        id: "2 تا 4 واحد در هفته",
        label: "2 تا 4 واحد در هفته",
      },
      {
        id: "5 تا 6 واحد در هفته",
        label: "5 تا 6 واحد در هفته",
      },
      {
        id: "یک واحد در روز",
        label: "یک واحد در روز",
      },
      {
        id: "2 تا 3 واحد در روز",
        label: "2 تا 3 واحد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "1 تا 3 قوطی در ماه",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "یک قوطی در هفته",
        label: "یک قوطی در هفته",
      },
      {
        id: "2 تا 4 قوطی در هفته",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5 تا 6 قوطی در هفته",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "1 تا 2 قوطی در روز",
        label: "1 تا 2 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را شامل نمی شود",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "یک کف دست در هفته",
        label: "یک کف دست در هفته",
      },
      {
        id: "2 تا 4 کف دست در هفته",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5 تا 6 کف دست در هفته",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "یک کف دست در روز",
        label: "یک کف دست در روز",
      },
      {
        id: "2 تا 3 کف دست در روز",
        label: "2 تا 3 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیتزا.jpg",
    subLabel: "یک عدد=یک مینی پیتزا کامل",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماکارونی.jpg",
    subLabel: "شامل ماکارونی ساده و شکل دار",
    id: "ماکارونی",
    label: "ماکارونی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "1 تا 3 بشقاب در ماه",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "یک بشقاب در هفته",
        label: "یک بشقاب در هفته",
      },
      {
        id: "2 تا 4 بشقاب در هفته",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5 تا 6 بشقاب در هفته",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "یک بشقاب در روز",
        label: "یک بشقاب در روز",
      },
      {
        id: "2 تا 3 بشقاب در روز",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "یک کف دست در هفته",
        label: "یک کف دست در هفته",
      },
      {
        id: "2 تا 4 کف دست در هفته",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5 تا 6 کف دست در هفته",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "یک کف دست در روز",
        label: "یک کف دست در روز",
      },
      {
        id: "2 تا 3 کف دست در روز",
        label: "2 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 5 کف دست در روز",
        label: "4 تا 5 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "4 تا 5 کاسه در روز",
        label: "4 تا 5 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع کنسور.jpg",
    subLabel: "به غیر از تن ماهی و کنسرو لوبیا",
    id: "انواع کنسرو",
    label: "انواع کنسرو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "1 تا 3 قوطی در ماه",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "یک قوطی در هفته",
        label: "یک قوطی در هفته",
      },
      {
        id: "2 تا 4 قوطی در هفته",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5 تا 6 قوطی در هفته",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "یک قوطی در روز",
        label: "یک قوطی در روز",
      },
      {
        id: "2 تا 3 قوطی در روز",
        label: "2 تا 3 قوطی در روز",
      },
      {
        id: "4 تا 5 قوطی در روز",
        label: "4 تا 5 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "1 تا 2 کاسه در روز",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته تبریزی.jpg",
    subLabel: "",
    id: "کوفته برنجی/تبریزی",
    label: "کوفته برنجی/تبریزی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته قلقلی..jpg",
    subLabel: "",
    id: "کوفته قلقلی (سرگنجشکی)",
    label: "کوفته قلقلی (سرگنجشکی)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بار در ماه",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2 تا 4 بار در هفته",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 تا 3  بار در روز",
        label: "2 تا 3  بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مراب.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای، قهوه یا شربت)",
    label: "شکر (در چای، قهوه یا شربت)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا شکری.jpg",
    subLabel: "یک قوطی کبریت=یک قاشق غذاخوری",
    id: "حلوا شکری",
    label: "حلوا شکری",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "1 تا 3 قوطی کبریت در ماه",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "یک قوطی کبریت در هفته",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "2 تا 3 قوطی کبریت در هفته",
        label: "2 تا 3 قوطی کبریت در هفته",
      },
      {
        id: "5 تا 6 قوطی کبریت در هفته",
        label: "5 تا 6 قوطی کبریت در هفته",
      },
      {
        id: "یک قوطی کبریت در روز",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "2 تا 3  قوطی کبریت در روز",
        label: "2 تا 3  قوطی کبریت در روز",
      },
      {
        id: "4 تا 5 قوطی کبریت در روز",
        label: "4 تا 5 قوطی کبریت در روز",
      },
      {
        id: "6 قوطی کبریت در روز یا بیشتر",
        label: "6 قوطی کبریت در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا خانگی.jpg",
    subLabel: "",
    id: "حلوای خانگی",
    label: "حلوای خانگی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گز.jpg",
    subLabel: "",
    id: "گز",
    label: "گز",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 4 عدد در روز",
        label: "2 تا 4 عدد در روز",
      },
      {
        id: "5 تا 7 عدد در روز",
        label: "5 تا 7 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شله زرد.jpg",
    subLabel: "کاسه کوچک (ماست خوری) را درنظر بگیرید",
    id: "شله زرد",
    label: "شله زرد",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه  در روز",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فرنی.jpg",
    subLabel: "کاسه ماست خوری",
    id: "فرنی",
    label: "فرنی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه  در روز",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قطعه مثلثی در ماه",
        label: "تقریبا هرگز یا کمتر از یک قطعه مثلثی در ماه",
      },
      {
        id: "1 تا 3 قطعه مثلثی در ماه",
        label: "1 تا 3 قطعه مثلثی در ماه",
      },
      {
        id: "یک قطعه مثلثی در هفته",
        label: "یک قطعه مثلثی در هفته",
      },
      {
        id: "2 تا 4 قطعه مثلثی در هفته",
        label: "2 تا 4 قطعه مثلثی در هفته",
      },
      {
        id: "5 تا 6 قطعه مثلثی در هفته",
        label: "5 تا 6 قطعه مثلثی در هفته",
      },
      {
        id: "یک قطعه مثلثی در روز",
        label: "یک قطعه مثلثی در روز",
      },
      {
        id: "2 تا 3 قطعه مثلثی  در روز",
        label: "2 تا 3 قطعه مثلثی  در روز",
      },
      {
        id: "4 تا 5 قطعه مثلثی در روز",
        label: "4 تا 5 قطعه مثلثی در روز",
      },
      {
        id: "6 قطعه مثلثی یا بیشتر در روز",
        label: "6 قطعه مثلثی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 2 عدد در روز",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "3 تا 5 عدد در روز",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "6 تا 9 عدد در روز",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "10 عدد یا بیشتر در روز",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوشفیل.jpg",
    subLabel: "",
    id: "گوشفیل",
    label: "گوشفیل",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
      {
        id: "فقط در ماه رمضان (تقریبا هر روز)",
        label: "فقط در ماه رمضان (تقریبا هر روز)",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت ماست.jpg",
    subLabel: "کاسه ماست خوری",
    id: "خورشت ماست",
    label: "خورشت ماست",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بریونی.jpg",
    subLabel: "",
    id: "بریانی",
    label: "بریانی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بار در ماه",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2 تا 4 بار در هفته",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 تا 3 بار در روز",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جگر و دل.jpg",
    subLabel: "یک سیخ=4 تکه جگر",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "1 تا 3 سیخ در ماه",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "یک سیخ در هفته",
        label: "یک سیخ در هفته",
      },
      {
        id: "2 تا 4 سیخ در هفته",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5 تا 6 سیخ در هفته",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "یک سیخ در روز",
        label: "یک سیخ در روز",
      },
      {
        id: "2 تا 3 سیخ در روز",
        label: "2 تا 3 سیخ در روز",
      },
      {
        id: "4 تا 5 سیخ در روز",
        label: "4 تا 5 سیخ در روز",
      },
      {
        id: "6 سیخ یا بیشتر در روز",
        label: "6 سیخ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ساندویچ..jpg",
    subLabel: "منظور ساندویچ با نان باگت می باشد",
    id: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 عدد در روز",
        label: "2 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوسیس.jpg",
    subLabel: "",
    id: "سوسیس (به غیر از ساندویچ)",
    label: "سوسیس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کالباس.jpg",
    subLabel: "",
    id: "کالباس (به غیر از ساندویچ)",
    label: "کالباس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک برش در ماه",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "1 تا 3 برش در ماه",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "یک برش در هفته",
        label: "یک برش در هفته",
      },
      {
        id: "2 تا 4 برش در هفته",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5 تا 6 برش در هفته",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "یک برش در روز",
        label: "یک برش در روز",
      },
      {
        id: "2 تا 3  برش در روز",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "4 تا 5 برش در روز",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/همبرگر.jpg",
    subLabel: "",
    id: "همبرگر (به غیر از ساندویچ)",
    label: "همبرگر (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس قرمز",
    label: "سس قرمز",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3  قاشق غذاخوری در روز",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذاخوری در روز",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور",
    label: "خیارشور",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 2 عدد در روز",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "3 تا 5 عدد در روز",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "6 تا 9 عدد در روز",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "10 عدد یا بیشتر در روز",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "آب لیمو",
    label: "آب لیمو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "1 تا 2 قاشق غذاخوری در روز",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "3 تا 5 قاشق غذاخوری در روز",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 تا 9 قاشق غذاخوری در روز",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "10 قاشق غذاخوری یا بیشتر در روز",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع ترشی.webp",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "1 تا 2 قاشق غذاخوری در روز",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "3 تا 5 قاشق غذاخوری در روز",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "6 تا 9 قاشق غذاخوری در روز",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "10 قاشق غذاخوری یا بیشتر در روز",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تخمه آفتابگردان.webp",
    subLabel: "یک مشت=دو قاشق غذاخوری",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5 تا 6 مشت در هفته",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3  مشت در روز",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "4 تا 5 مشت در روز",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "یک مشت=10 عدد بادام، پسته یا فندق",
    id: "بادام، پسته، فندق، بادام زمینی",
    label: "بادام، پسته، فندق، بادام زمینی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5 تا 6 مشت در هفته",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3  مشت در روز",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "4 تا 5 مشت در روز",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قطعه متوسط در ماه",
        label: "تقریبا هرگز یا کمتر از یک قطعه متوسط در ماه",
      },
      {
        id: "1 تا 3 قطعه متوسط در ماه",
        label: "1 تا 3 قطعه متوسط در ماه",
      },
      {
        id: "یک قطعه متوسط در هفته",
        label: "یک قطعه متوسط در هفته",
      },
      {
        id: "2 تا 4 قطعه متوسط در هفته",
        label: "2 تا 4 قطعه متوسط در هفته",
      },
      {
        id: "5 تا 6 قطعه متوسط در هفته",
        label: "5 تا 6 قطعه متوسط در هفته",
      },
      {
        id: "یک قطعه متوسط در روز",
        label: "یک قطعه متوسط در روز",
      },
      {
        id: "2 تا 3  قطعه متوسط در روز",
        label: "2 تا 3  قطعه متوسط در روز",
      },
      {
        id: "4 تا 5 قطعه متوسط در روز",
        label: "4 تا 5 قطعه متوسط در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "قهوه و نسکافه",
    label: "قهوه و نسکافه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3  لیوان در روز",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "6 لیوان یا بیشتر در روز",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3  لیوان در روز",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "6 لیوان یا بیشتر در روز",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک استکان در ماه",
        label: "تقریبا هرگز یا کمتر از یک استکان در ماه",
      },
      {
        id: "1 تا 3 استکان در ماه",
        label: "1 تا 3 استکان در ماه",
      },
      {
        id: "یک استکان در هفته",
        label: "یک استکان در هفته",
      },
      {
        id: "4 تا 6  استکان در هفته",
        label: "4 تا 6  استکان در هفته",
      },
      {
        id: "یک استکان در روز",
        label: "یک استکان در روز",
      },
      {
        id: "2 تا 4 استکان در روز",
        label: "2 تا 4 استکان در روز",
      },
      {
        id: "5 تا 6 استکان در روز",
        label: "5 تا 6 استکان در روز",
      },
      {
        id: "8 تا 11 استکان در روز",
        label: "8 تا 11 استکان در روز",
      },
      {
        id: "12 استکان در روز یا بیشتر",
        label: "12 استکان در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "طبیعی و صنعتی",
    id: "انواع آبمیوه",
    label: "انواع آبمیوه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3 لیوان در روز",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نوشابه.webp",
    subLabel: "",
    id: "نوشابه یا دلستر",
    label: "نوشابه یا دلستر",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3 لیوان در روز",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "یک عدد معادل یک بیسکوییت ساقه طلایی می باشد",
    id: "بیسکوییت",
    label: "بیسکوییت",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "1 تا 6 عدد در هفته",
        label: "1 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 5 عدد در روز",
        label: "1 تا 5 عدد در روز",
      },
      {
        id: "6 تا 10 عدد در روز",
        label: "6 تا 10 عدد در روز",
      },
      {
        id: "11 تا 15 عدد در روز",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "بیشتر از 15 عدد در روز",
        label: "بیشتر از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در هفته",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4 تا 6 کف دست در هفته",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "1 تا 3 کف دست در روز",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 6 کف دست در روز",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7 تا 10 کف دست در روز",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "11 تا 15 کف دست در روز",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "16 کف دست یا بیشتر در روز",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون",
    label: "نان تافتون",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در هفته",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4 تا 6 کف دست در هفته",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "1 تا 3 کف دست در روز",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 6 کف دست در روز",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7 تا 10 کف دست در روز",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "11 تا 15 کف دست در روز",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "16 کف دست یا بیشتر در روز",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "1 تا 4 کف دست در هفته",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "2 تا 6 کف دست در هفته",
        label: "2 تا 6 کف دست در هفته",
      },
      {
        id: "1 تا 3 کف دست در روز",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 6 کف دست در روز",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7 تا 10 کف دست در روز",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "11 تا 15 کف دست در روز",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "16 کف دست یا بیشتر در روز",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، نان جو و ..)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "1 تا 4 کف دست در هفته",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4 تا 6 کف دست در هفته",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "1 تا 3 کف دست در روز",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 6 کف دست در روز",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7 تا 10 کف دست در روز",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "11 تا 15 کف دست در روز",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "16 کف دست یا بیشتر در روز",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "1 تا 3 کف دست در ماه",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "1 تا 4 کف دست در هفته",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4 تا 6 کف دست در هفته",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "1 تا 3 کف دست در روز",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "4 تا 6 کف دست در روز",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7 تا 10 کف دست در روز",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "11 تا 15 کف دست در روز",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "16 کف دست یا بیشتر در روز",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک خانگی.jpg",
    subLabel: "یک برش=یک بسته کیک",
    id: "کیک (خانگی یا بسته بندی)",
    label: "کیک (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک برش در ماه",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "1 تا 3 برش در ماه",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "یک برش در هفته",
        label: "یک برش در هفته",
      },
      {
        id: "2 تا 4 برش در هفته",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5 تا 6 برش در هفته",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "یک برش در روز",
        label: "یک برش در روز",
      },
      {
        id: "2 تا 3  برش در روز",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "4 تا 5 برش در روز",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی (خشک یا تر)",
    label: "شیرینی (خشک یا تر)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 2 عدد در روز",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "3 تا 5 عدد در روز",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چیپس یا پفک.webp",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بسته در ماه",
        label: "تقریبا هرگز یا کمتر از یک بسته در ماه",
      },
      {
        id: "1 تا 3 بسته در ماه",
        label: "1 تا 3 بسته در ماه",
      },
      {
        id: "یک بسته در هفته",
        label: "یک بسته در هفته",
      },
      {
        id: "2 تا 4 بسته در هفته",
        label: "2 تا 4 بسته در هفته",
      },
      {
        id: "5 تا 6 بسته در هفته",
        label: "5 تا 6 بسته در هفته",
      },
      {
        id: "یک بسته در روز",
        label: "یک بسته در روز",
      },
      {
        id: "2 تا 3 بسته در روز",
        label: "2 تا 3 بسته در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "1 تا 3 پیش دستی در ماه",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "یک پیش دستی در هفته",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "2 تا 4 پیش دستی در هفته",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5 تا 6 پیش دستی در هفته",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "یک پیش دستی در روز",
        label: "یک پیش دستی در روز",
      },
      {
        id: "2 تا 3 پیش دستی در روز",
        label: "2 تا 3 پیش دستی در روز",
      },
      {
        id: "4 پیش دستی در روز یا بیشتر",
        label: "4 پیش دستی در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید",
    id: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    label: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره",
    label: "کره",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک  قالب ده گرمی در ماه",
        label: "تقریبا هرگز یا کمتر از یک  قالب ده گرمی در ماه",
      },
      {
        id: "1 تا 3  قالب ده گرمی در ماه",
        label: "1 تا 3  قالب ده گرمی در ماه",
      },
      {
        id: "یک  قالب ده گرمی در هفته",
        label: "یک  قالب ده گرمی در هفته",
      },
      {
        id: "2 تا 4  قالب ده گرمی در هفته",
        label: "2 تا 4  قالب ده گرمی در هفته",
      },
      {
        id: "5 تا 6  قالب ده گرمی در هفته",
        label: "5 تا 6  قالب ده گرمی در هفته",
      },
      {
        id: "یک  قالب ده گرمی در روز",
        label: "یک  قالب ده گرمی در روز",
      },
      {
        id: "2 تا 3 قالب ده گرمی  در روز",
        label: "2 تا 3 قالب ده گرمی  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه",
    label: "خامه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3 قاشق غذاخوری در روز",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
      {
        id: "4 تا 5 قاشق غذا خوری در روز",
        label: "4 تا 5 قاشق غذا خوری در روز",
      },
      {
        id: "6 قاشق غذاخوری در روز یا بیشتر",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پنیر.webp",
    subLabel: "معمولی یا خامه ای",
    id: "پنیر",
    label: "پنیر",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "1 تا 3 قوطی کبریت در ماه",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "یک قوطی کبریت در هفته",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "2 تا 4 قوطی کبریت در هفته",
        label: "2 تا 4 قوطی کبریت در هفته",
      },
      {
        id: "یک قوطی کبریت در روز",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "2 تا 3 قوطی کبریت در روز",
        label: "2 تا 3 قوطی کبریت در روز",
      },
      {
        id: "4 تا 5 قوطی کبریت در روز",
        label: "4 تا 5 قوطی کبریت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیرکاکائو.jpg",
    subLabel: "",
    id: "شیر کاکائو",
    label: "شیر کاکائو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3 لیوان در روز",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر",
    label: "شیر",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3 لیوان در روز",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید",
    id: "کشک",
    label: "کشک",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماست.webp",
    subLabel: "",
    id: "ماست",
    label: "ماست",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه ماست خوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه ماست خوری در ماه",
      },
      {
        id: "1 تا 3 کاسه ماست خوری در ماه",
        label: "1 تا 3 کاسه ماست خوری در ماه",
      },
      {
        id: "یک کاسه ماست خوری در هفته",
        label: "یک کاسه ماست خوری در هفته",
      },
      {
        id: "2 تا 4 کاسه ماست خوری در هفته",
        label: "2 تا 4 کاسه ماست خوری در هفته",
      },
      {
        id: "5 تا 6 کاسه ماست خوری در هفته",
        label: "5 تا 6 کاسه ماست خوری در هفته",
      },
      {
        id: "یک کاسه ماست خوری در روز",
        label: "یک کاسه ماست خوری در روز",
      },
      {
        id: "2 تا 3 کاسه ماست خوری در روز",
        label: "2 تا 3 کاسه ماست خوری در روز",
      },
      {
        id: "4 تا 5 کاسه ماست خوری در روز",
        label: "4 تا 5 کاسه ماست خوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی",
    label: "بستنی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک بار در ماه",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "یک بار در هفته",
        label: "یک بار در هفته",
      },
      {
        id: "2 تا 4 بار در هفته",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5 تا 6 بار در هفته",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 تا 3 بار در روز",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "1 تا 3 لیوان در ماه",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "یک لیوان در هفته",
        label: "یک لیوان در هفته",
      },
      {
        id: "2 تا 4 لیوان در هفته",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5 تا 6 لیوان در هفته",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "یک لیوان در روز",
        label: "یک لیوان در روز",
      },
      {
        id: "2 تا 3 لیوان در روز",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "4 تا 5 لیوان در روز",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد را درنظر نگیرید",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد یا بیشتر در روز",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "1 تا 4 عدد در هفته",
        label: "1 تا 4 عدد در هفته",
      },
      {
        id: "4 تا 6 عدد در هفته",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 3 عدد در روز",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "4 تا 6 عدد در روز",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7 تا 10 عدد در روز",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "11 تا 15 عدد در روز",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "بیش از 15 عدد در روز",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما",
    label: "خرما",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در هفته",
        label: "1 تا 3 عدد در هفته",
      },
      {
        id: "4 تا 6 عدد در هفته",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 3 عدد در روز",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "4 تا 6 عدد در روز",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7 تا 10 عدد در روز",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "11 تا 15 عدد در روز",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "بیش از 15 عدد در روز",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش",
    label: "کشمش",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3 قاشق غذاخوری در روز",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "1 تا 3 پیش دستی در ماه",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "یک پیش دستی در هفته",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "2 تا 4 پیش دستی در هفته",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5 تا 6 پیش دستی در هفته",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "یک پیش دستی در روز",
        label: "یک پیش دستی در روز",
      },
      {
        id: "2 تا 3 پیش دستی در روز",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "1 تا 3 کاسه در ماه",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "یک کاسه در هفته",
        label: "یک کاسه در هفته",
      },
      {
        id: "2 تا 4 کاسه در هفته",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5 تا 6 کاسه در هفته",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "یک کاسه در روز",
        label: "یک کاسه در روز",
      },
      {
        id: "2 تا 3 کاسه در روز",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "4 کاسه یا بیشتر در روز",
        label: "4 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد (حاوی کاهو، کلم و …)",
    label: "سالاد (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "1 تا 3 پیش دستی در ماه",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "یک پیش دستی در هفته",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "2 تا 4 پیش دستی در هفته",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5 تا 6 پیش دستی در هفته",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "یک پیش دستی در روز",
        label: "یک پیش دستی در روز",
      },
      {
        id: "2 تا 3 پیش دستی در روز",
        label: "2 تا 3 پیش دستی در روز",
      },
      {
        id: "4 تا 5 پیش دستی در روز",
        label: "4 تا 5 پیش دستی در روز",
      },
      {
        id: "6 پیش دستی یا بیشتر در روز",
        label: "6 پیش دستی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت خشک.jpg",
    subLabel: "",
    id: "توت خشک",
    label: "توت خشک",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "1 تا 3 قاشق غذاخوری در ماه",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "یک قاشق غذاخوری در هفته",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "2 تا 4 قاشق غذاخوری در هفته",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5 تا 6 قاشق غذاخوری در هفته",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "یک قاشق غذاخوری در روز",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "2 تا 3 قاشق غذاخوری در روز",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "طالبی، خربزه، هندوانه و گرمک",
    label: "طالبی، خربزه، هندوانه و گرمک",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک قاچ در ماه",
        label: "تقریبا هرگز یا کمتر از یک قاچ در ماه",
      },
      {
        id: "1 تا 3 قاچ در ماه",
        label: "1 تا 3 قاچ در ماه",
      },
      {
        id: "یک قاچ در هفته",
        label: "یک قاچ در هفته",
      },
      {
        id: "2 تا 4 قاچ در هفته",
        label: "2 تا 4 قاچ در هفته",
      },
      {
        id: "5 تا 6 قاچ در هفته",
        label: "5 تا 6 قاچ در هفته",
      },
      {
        id: "1 تا 2 قاچ در روز",
        label: "1 تا 2 قاچ در روز",
      },
      {
        id: "3 تا 5 قاچ در روز",
        label: "3 تا 5 قاچ در روز",
      },
      {
        id: "6 تا 9 قاچ در روز",
        label: "6 تا 9 قاچ در روز",
      },
      {
        id: "10 قاچ یا بیشتر در روز",
        label: "10 قاچ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    label: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 2 عدد در روز",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "3 تا 5 عدد در روز",
        label: "3 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیوی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "کیوی",
    label: "کیوی",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3  عدد در روز",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (1 مشت = 10 عدد)",
    id: "گیلاس یا البالو",
    label: "گیلاس یا البالو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5 تا 6 مشت در هفته",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3  مشت در روز",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "4 تا 5 مشت در روز",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "زردآلو",
    label: "زردآلو",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 3 عدد در روز",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "4 تا 7 عدد در روز",
        label: "4 تا 7 عدد در روز",
      },
      {
        id: "8 تا 10 عدد در روز",
        label: "8 تا 10 عدد در روز",
      },
      {
        id: "11 عدد در روز یا بیشتر",
        label: "11 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلو (زرد و قرمز).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "آلو (زرد و قرمز)",
    label: "آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "1 تا 2 عدد در روز",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "3 تا 5 عدد در روز",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "6 عدد در روز یا بیشتر",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلوچه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت = 5 عدد)",
    id: "آلوچه (گوجه سبز)",
    label: "آلوچه (گوجه سبز)",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5 تا 6 مشت در هفته",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3 مشت در روز",
        label: "2 تا 3 مشت در روز",
      },
      {
        id: "4 تا 5 مشت در روز",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انجیر تازه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انجیر تازه",
    label: "انجیر تازه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "4 تا 5 عدد در روز",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "6 عدد در روز یا بیشتر",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت فرنگی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=5 عدد)",
    id: "توت فرنگی ",
    label: "توت فرنگی ",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3 مشت در روز",
        label: "2 تا 3 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک خوشه در ماه",
        label: "تقریبا هرگز یا کمتر از یک خوشه در ماه",
      },
      {
        id: "1 تا 3 خوشه در ماه",
        label: "1 تا 3 خوشه در ماه",
      },
      {
        id: "یک خوشه در هفته",
        label: "یک خوشه در هفته",
      },
      {
        id: "2 تا 4 خوشه در هفته",
        label: "2 تا 4 خوشه در هفته",
      },
      {
        id: "5 تا 6 خوشه در هفته",
        label: "5 تا 6 خوشه در هفته",
      },
      {
        id: "یک خوشه در روز",
        label: "یک خوشه در روز",
      },
      {
        id: "2 تا 3 خوشه در روز",
        label: "2 تا 3 خوشه در روز",
      },
      {
        id: "4 تا 5 خوشه در روز",
        label: "4 تا 5 خوشه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت تازه.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=10 عدد توت)",
    id: "توت تازه",
    label: "توت تازه",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک مشت در ماه",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "1 تا 3 مشت در ماه",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "یک مشت در هفته",
        label: "یک مشت در هفته",
      },
      {
        id: "2 تا 4 مشت در هفته",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5 تا 6 مشت در هفته",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "یک مشت در روز",
        label: "یک مشت در روز",
      },
      {
        id: "2 تا 3 مشت در روز",
        label: "2 تا 3 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "تقریبا هرگز یا کمتر از یک عدد در ماه",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "1 تا 3 عدد در ماه",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "یک عدد در هفته",
        label: "یک عدد در هفته",
      },
      {
        id: "2 تا 4 عدد در هفته",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5 تا 6 عدد در هفته",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "یک عدد در روز",
        label: "یک عدد در روز",
      },
      {
        id: "2 تا 3 عدد در روز",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "هرگز یا کمتر از یک بار در ماه",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "1 تا 3 بار در ماه",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "1 تا 2 بار در هفته",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "3 تا 6 بار در هفته",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "یک بار در روز",
        label: "یک بار در روز",
      },
      {
        id: "2 بار یا بیشتر در روز",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
];
const questionType = "controlffq";
export default function ControlFFQ() {
  let isCompletedBefore = localStorage.getItem(questionType);
  return (
    <>
      {isCompletedBefore ? (
        swal({
          title: "شما قبلا این پرسشنامه را پر کرده اید",
          icon: "error",
          buttons: "متوجه شدم",
        })
      ) : (
        <div className="border-2 my-1 border-blue-500 rounded-lg w-[95%] m-auto">
          <div className="bg-blue-500 rounded-t-lg p-2 text-white font-bold text-xl">
            پرسشنامه
          </div>
          <DynamicFormFFQ questionType={questionType} questions={questions} />
        </div>
      )}
    </>
  );
}
