import * as Yup from "yup";

export const NEWFFQ = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    serving: "",
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    serving: "",
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن تلفن همراه جایگزین الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    serving: "یک بشقاب غذاخوری",
    img: "./Image/برنج استامبلی.jpg",
    subLabel:
      "(شوید پلو، عدس پلو، لوبیا پلو، دمپختک، باقالی پلو، استانبولی و...)",
    id: "قاطی پلو",
    label: "قاطی پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب غذا خوری",
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابی جات و … استفاده می شود. ",
    id: "برنج یا زرشک پلو",
    label: "برنج یا زرشک پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب",
    img: "./Image/ماکارونی.jpg",
    subLabel: "",
    id: "ماکارونی، لازانیا، نودل و پاستا",
    label: "ماکارونی، لازانیا، نودل و پاستا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی یا خورشت کرفس",
    label: "خورشت قورمه سبزی یا خورشت کرفس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "",
    id: "خورشت بادمجان یا قیمه بادمجان",
    label: "خورشت بادمجان یا قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قیمه.jpg",
    subLabel: "",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت لوبیا سبز.jpg",
    subLabel: "",
    id: "خورشت لوبیا سبز",
    label: "خورشت لوبیا سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/حلیم بادمجون.webp",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "",
    id: "آبگوشت و تاس کباب",
    label: "آبگوشت و تاس کباب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود .",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ کباب کوبیده یا دو تکه کباب تابه ای",
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "",
    id: "کباب تابه ای یا کباب کوبیده",
    label: "کباب تابه ای یا کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ",
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب و کتف و بال مرغ",
    label: "جوجه کباب و کتف و بال مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد ران مرغ یا نصف سینه مرغ",
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "",
    id: "خوراک مرغ، تاس کباب مرغ و زرشک پلو با مرغ",
    label: "خوراک مرغ، تاس کباب مرغ و زرشک پلو با مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "2 عدد ناگت یا 1 عدد فیله یا تکه مرغ سوخاری",
    img: "./Image/فیله مرغ سوخاری (ناگت، مرغ سوخاری و فیله مرغ و...).jpg",
    subLabel: " (ناگت، مرغ سوخاری و فیله مرغ و...)",
    id: "فیله مرغ سوخاری",
    label: "فیله مرغ سوخاری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/خورشت گوشت چرخ کرده.jpg",
    subLabel: "",
    id: "خوارک یا خورشت گوشت چرخ کرده",
    label: "خوارک یا خورشت گوشت چرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی معادل 5 عدد",
    img: "./Image/کوفته قلقلی..jpg",
    subLabel: "",
    id: "کوفته قلقلی (سرگنجشکی) یا قیمه ریزه",
    label: "کوفته قلقلی (سرگنجشکی) یا قیمه ریزه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "عدد",
    img: "./Image/بریونی.jpg",
    subLabel: "",
    id: "بریانی",
    label: "بریانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه (زبان، کله، پاچه و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ معادل 4 تکه جگر",
    img: "./Image/جگر و دل.jpg",
    subLabel: "",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی ",
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه یا بشقاب",
    img: "./Image/سوپ.jpg",
    subLabel: "سوپ مرغ، جو، سبزیجات و ... را درنظر بگیرید .",
    id: "سوپ ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/خورشت ماست.jpg",
    subLabel: "",
    id: "خورشت ماست",
    label: "خورشت ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "دو تکه مثلثی",
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "عدد",
    img: "./Image/ساندویچ فلافل.jpg",
    subLabel: "",
    id: "ساندویچ فلافل",
    label: "ساندویچ فلافل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/ساندویچ..jpg",
    subLabel: "منظور ساندویچ با نان باگت می باشد",
    id: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیتزای کوچک معادل 6 اسلایس",
    img: "./Image/پیتزا.jpg",
    subLabel: "",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد کوچک یا 2 برش",
    img: "./Image/سوسیس.jpg",
    subLabel: "غیر از موارد استفاده شده در فست فود منظور می باشد .",
    id: "انواع سوسیس و کالباس",
    label: "انواع سوسیس و کالباس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی",
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را در نظر نگیرید .",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد فصل (حاوی کاهو، کلم و …)",
    label: "سالاد فصل (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه",
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، هفت غله، تست سبوس دار و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه",
    img: "./Image/نان تست.jpg",
    subLabel: "",
    id: "نان تست سفید",
    label: "نان تست سفید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون و خانگی",
    label: "نان تافتون و خانگی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان خشک.jpg",
    subLabel: "",
    id: "نان خشک",
    label: "نان خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 10 عدد",
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید .",
    id: "سیب زمینی",
    label: "سیب زمینی (تنوری، آبپز، پوره یا خوارک سیب زمینی و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان ذرت یا یک عدد بلال",
    img: "./Image/بلال یا ذرت.jpg",
    subLabel: "",
    id: "ذرت یا بلال",
    label: "ذرت یا بلال",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر پرچرب.jpg",
    subLabel: "",
    id: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    label: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر کم چرب.jpg",
    subLabel: "",
    id: "پنیر کم چرب",
    label: "پنیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر شکلاتی، شیر کاکائو  و شیر قهوه.jpg",
    subLabel: "",
    id: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    label: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرموز.jpg",
    subLabel: "",
    id: "شیرموز",
    label: "شیرموز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرپرچرب.jpg",
    subLabel: "",
    id: "شیر پرچرب",
    label: "شیر پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر کم چرب",
    label: "شیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست.jpg",
    subLabel: " (سنتی، چکیده و خامه ای)",
    id: "ماست پرچرب",
    label: "ماست پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست کم چرب.jpg",
    subLabel: "",
    id: "ماست کم چرب",
    label: "ماست کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک  عدد",
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید.",
    id: "کشک (مایع و خشک)",
    label: "کشک (مایع و خشک)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه / سرشیر",
    label: "خامه / سرشیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد یا نصف لیوان",
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی (سنتی و غیر سنتی)",
    label: "بستنی (سنتی و غیر سنتی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید.",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "عدد",
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "زردآلو یا آلو (زرد و قرمز)",
    label: "زردآلو یا آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "عدد",
    img: "./Image/هلو یا شلیل.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هلو یا شلیل",
    label: "هلو یا شلیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "عدد",
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "گیلاس یا آلبالو",
    label: "گیلاس یا آلبالو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل 1 لیوان",
    img: "./Image/هندوانه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هندوانه",
    label: "هندوانه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل یک لیوان",
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "خربزه، طالبی و ملون وگرمک",
    label: "خربزه، طالبی و ملون وگرمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری آبلیمو= نصف لیمو ترش",
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "آب لیمو",
    label: "آب لیمو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "",
    id: "آبمیوه طبیعی",
    label: "آبمیوه طبیعی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/آبمیوه صنعتی.jpg",
    subLabel: "",
    id: "آبمیوه صنعتی",
    label: "آبمیوه صنعتی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/انواع شربت.jpg",
    subLabel: "",
    id: "انواع شربت",
    label: "انواع شربت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات",
    label: "مرکبات (پرتقال، نارنگی، کیوی، لیموشیرین و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل5 عدد یا یک قاشق غذاخوری",
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش و مویز",
    label: "کشمش و مویز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک خوشه متوسط",
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل  3عدد",
    img: "./Image/انجیر تازه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انجیر خشک",
    label: "انجیر خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 5عدد",
    img: "./Image/توت خشک.jpg",
    subLabel: "",
    id: "میوه های خشک (توت خشک، برگ هلو و برگ زردآلو و آلبالو خشک)",
    label: "میوه های خشک (توت خشک، برگ هلو و برگ زردآلو و آلبالو خشک)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما و رطب",
    label: "خرما و رطب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک مشت معادل 5 عدد",
    img: "./Image/زیتون.jpg",
    subLabel: "",
    id: "زیتون",
    label: "زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید .",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد را درنظر نگیرید .",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/فلفل دلمه ای.jpg",
    subLabel: "",
    id: "فلفل دلمه ای",
    label: "فلفل دلمه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 5 عدد",
    img: "./Image/قارچ.jpg",
    subLabel: "",
    id: "قارچ",
    label: "قارچ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/هویج خام.jpg",
    subLabel: "",
    id: "هویج خام",
    label: "هویج خام",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل 5 حبه سیر",
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/کدو (خورشت کدو، پخارپز و...).jpg",
    subLabel: "",
    id: "کدو",
    label: "کدو (خورشت کدو، پخارپز و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 10 عدد بادام، پسته یا فندق",
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "",
    id: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    label: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل دو قاشق غذاخوری",
    img: "./Image/انواع تخمه.jpg",
    subLabel: "",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 2 قاشق غذاخوری",
    img: "./Image/آجیل سویا و یا شیر سویا.jpg",
    subLabel: "",
    id: "آجیل سویا",
    label: "آجیل سویا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "دو عددپولکی  معادل دوحبه قند",
    img: "./Image/قند یا پولکی.jpg",
    subLabel: "تعدد",
    id: "قند یا پولکی",
    label: "قند یا پولکی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قطعه متوسط",
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گز.jpg",
    subLabel: "",
    id: "گز",
    label: "گز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گوشفیل.jpg",
    subLabel: "",
    id: "گوشفیل",
    label: "گوشفیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک عدد",
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی تر",
    label: "شیرینی تر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شیرینی خشک.jpg",
    subLabel: "",
    id: "شیرینی خشک",
    label: "شیرینی خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد معادل یک بیسکوییت ساقه طلایی",
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "",
    id: "بیسکوئیت",
    label: "بیسکوئیت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک بسته",
    img: "./Image/کیک خانگی.jpg",
    subLabel: "",
    id: " کیک و کلوچه (خانگی یا بسته بندی)",
    label: " کیک و کلوچه (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "نسکافه",
    label: "کافی میکس، نسکافه، کاپوچینو و ...",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/قهوه اسپرسو.jpg",
    subLabel: "",
    id: "قهوه دمی یا اسپرسو",
    label: "قهوه دمی یا اسپرسو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای، قهوه یا شربت)",
    label: "شکر (در چای، قهوه یا شربت)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک قوطی کبریت",
    img: "./Image/حلوا شکری.jpg",
    subLabel: "",
    id: "حلوا ارده یا حلوا شکری",
    label: "حلوا ارده یا حلوا شکری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل 3 قاشق غذاخوری",
    img: "./Image/ارده شیره.jpg",
    subLabel: "",
    id: "ارده شیره",
    label: "ارده شیره",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/کره بادام زمینی.jpg",
    subLabel: "",
    id: "کره بادام زمینی",
    label: "کره بادام زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "قالب 10 گرمی",
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره یا مارگارین",
    label: "کره یا مارگارین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/مربا.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/روغن زیتون.jpg",
    subLabel: "",
    id: "روغن زیتون",
    label: "روغن زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/نوشابه.jpg",
    subLabel: "",
    id: "نوشابه، دلستر یا لیموناد",
    label: "نوشابه، دلستر یا لیموناد",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس کچاپ (قرمز)",
    label: "سس کچاپ (قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل دو قاشق غذاخوری",
    img: "./Image/انواع ترشی.jpg",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد خیارشور یا 1 قاشق غذاخوری شور",
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور و شور",
    label: "خیارشور و شور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بسته",
    img: "./Image/چیپس یا پفک.jpg",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/نمک.jpg",
    subLabel: "نمک اضافه شده در زمان صرف غذا را در نظر بگیرید",
    id: "نمک",
    label: "نمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
];
