import * as Yup from "yup";

export const ISFAHANFFQ = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن تلفن همراه جایگزین الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در یک ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی درهفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی درهفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "آب گوشت و گوشت کوبیده آن را درنظر بگیرید",
    id: "ابگوشت",
    label: "ابگوشت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوپ.jpg",
    subLabel: "انواع سوپ ها را درنظر بگیرید",
    id: "سوپ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "8",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم بادمجون.webp",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج استامبلی.jpg",
    subLabel: "در کل قاطی پلوها",
    id: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    label: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابیجات و … استفاده می شود. ",
    id: "پلو سفید",
    label: "پلو سفید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "8",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی",
    label: "خورشت قورمه سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "",
    id: "خورشت قیمه بادمجان",
    label: "خورشت قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قیمه.jpg",
    subLabel: " (خورشت قیمه همراه با بادمجان را در نظر نگیرید)",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت لوبیا سبز.jpg",
    subLabel: "",
    id: "خورشت لوبیا سبز",
    label: "خورشت لوبیا سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت گوشت چرخ کرده.jpg",
    subLabel: "",
    id: "خورشت گوشت چرخ کرده",
    label: "خورشت گوشت چرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "کباب کوبیده را درنظر نگیرید",
    id: "کباب تابه ای",
    label: "کباب تابه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب کوبیده.jpg",
    subLabel: "",
    id: "کباب کوبیده",
    label: "کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب برگ.jpg",
    subLabel: "",
    id: "کباب برگ",
    label: "کباب برگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب",
    label: "جوجه کباب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "یک واحد=یک ران یا نصف سینه مرغ",
    id: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    label: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک واحد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 واحد در ماه",
      },
      {
        id: "3",
        label: "یک واحد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 واحد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 واحد در هفته",
      },
      {
        id: "6",
        label: "یک واحد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 واحد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "3",
        label: "یک قوطی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را شامل نمی شود",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "یک کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "6",
        label: "یک کف دست در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیتزا.jpg",
    subLabel: "یک عدد=یک مینی پیتزا کامل",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماکارونی.jpg",
    subLabel: "شامل ماکارونی ساده و شکل دار",
    id: "ماکارونی",
    label: "ماکارونی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "یک کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "6",
        label: "یک کف دست در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کف دست در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع کنسور.jpg",
    subLabel: "به غیر از تن ماهی و کنسرو لوبیا",
    id: "انواع کنسرو",
    label: "انواع کنسرو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "3",
        label: "یک قوطی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "6",
        label: "یک قوطی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قوطی در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته تبریزی.jpg",
    subLabel: "",
    id: "کوفته برنجی/تبریزی",
    label: "کوفته برنجی/تبریزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته قلقلی..jpg",
    subLabel: "",
    id: "کوفته قلقلی (سرگنجشکی)",
    label: "کوفته قلقلی (سرگنجشکی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3  بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مربا.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای، قهوه یا شربت)",
    label: "شکر (در چای، قهوه یا شربت)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قند یا پولکی.jpg",
    subLabel: "",
    id: "قند یا پولکی",
    label: "قند یا پولکی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "16 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا شکری.jpg",
    subLabel: "یک قوطی کبریت=یک قاشق غذاخوری",
    id: "حلوا شکری",
    label: "حلوا شکری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "3",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "4",
        label: "2 تا 3 قوطی کبریت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی کبریت در هفته",
      },
      {
        id: "6",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قوطی کبریت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قوطی کبریت در روز",
      },
      {
        id: "9",
        label: "6 قوطی کبریت در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا خانگی.jpg",
    subLabel: "",
    id: "حلوای خانگی",
    label: "حلوای خانگی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گز.jpg",
    subLabel: "",
    id: "گز",
    label: "گز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 4 عدد در روز",
      },
      {
        id: "8",
        label: "5 تا 7 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شله زرد.jpg",
    subLabel: "",
    id: "شله زرد",
    label: "شله زرد",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فرنی.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "فرنی",
    label: "فرنی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قطعه مثلثی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قطعه مثلثی در ماه",
      },
      {
        id: "3",
        label: "یک قطعه مثلثی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قطعه مثلثی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قطعه مثلثی در هفته",
      },
      {
        id: "6",
        label: "یک قطعه مثلثی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قطعه مثلثی  در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قطعه مثلثی در روز",
      },
      {
        id: "9",
        label: "6 قطعه مثلثی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "9",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوشفیل.jpg",
    subLabel: "",
    id: "گوشفیل",
    label: "گوشفیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
      {
        id: "10",
        label: "فقط در ماه رمضان (تقریبا هر روز)",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت ماست.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "خورشت ماست",
    label: "خورشت ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بریونی.jpg",
    subLabel: "",
    id: "بریانی",
    label: "بریانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جگر و دل.jpg",
    subLabel: "یک سیخ=4 تکه جگر",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 3 سیخ در روز",
      },
      {
        id: "8",
        label: "4 تا 5 سیخ در روز",
      },
      {
        id: "9",
        label: "6 سیخ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ساندویچ..jpg",
    subLabel: "منظور ساندویچ با نان باگت می باشد",
    id: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوسیس.jpg",
    subLabel: "",
    id: "سوسیس (به غیر از ساندویچ)",
    label: "سوسیس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کالباس.jpg",
    subLabel: "",
    id: "کالباس (به غیر از ساندویچ)",
    label: "کالباس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "3",
        label: "یک برش در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "6",
        label: "یک برش در روز",
      },
      {
        id: "7",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "8",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/همبرگر.jpg",
    subLabel: "",
    id: "همبرگر (به غیر از ساندویچ)",
    label: "همبرگر (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس قرمز",
    label: "سس قرمز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور",
    label: "خیارشور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "9",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "آب لیمو",
    label: "آب لیمو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع ترشی.jpg",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع تخمه.jpg",
    subLabel: "یک مشت=دو قاشق غذاخوری",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "یک مشت=10 عدد بادام، پسته یا فندق",
    id: "بادام، پسته، فندق، بادام زمینی",
    label: "بادام، پسته، فندق، بادام زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قطعه متوسط در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قطعه متوسط در ماه",
      },
      {
        id: "3",
        label: "یک قطعه متوسط در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قطعه متوسط در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قطعه متوسط در هفته",
      },
      {
        id: "6",
        label: "یک قطعه متوسط در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قطعه متوسط در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قطعه متوسط در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "قهوه و نسکافه",
    label: "قهوه و نسکافه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "9",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "9",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک استکان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 استکان در ماه",
      },
      {
        id: "3",
        label: "یک استکان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 استکان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 استکان در هفته",
      },
      {
        id: "6",
        label: "یک استکان در روز",
      },
      {
        id: "7",
        label: "2 تا 4 استکان در روز",
      },
      {
        id: "8",
        label: "5 تا 6 استکان در روز",
      },
      {
        id: "9",
        label: "8 تا 11 استکان در روز",
      },
      {
        id: "10",
        label: "12 استکان در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "طبیعی و صنعتی",
    id: "انواع آبمیوه",
    label: "انواع آبمیوه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نوشابه.jpg",
    subLabel: "",
    id: "نوشابه یا دلستر",
    label: "نوشابه یا دلستر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "یک عدد معادل یک بیسکوییت ساقه طلایی می باشد",
    id: "بیسکوییت",
    label: "بیسکوییت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 6 عدد در هفته",
      },
      {
        id: "4",
        label: "1 تا 5 عدد در روز",
      },
      {
        id: "5",
        label: "6 تا 10 عدد در روز",
      },
      {
        id: "6",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "7",
        label: "بیشتر از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون",
    label: "نان تافتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، نان جو و ..)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک خانگی.jpg",
    subLabel: "یک برش=یک بسته کیک",
    id: "کیک (خانگی یا بسته بندی)",
    label: "کیک (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "3",
        label: "یک برش در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "6",
        label: "یک برش در روز",
      },
      {
        id: "7",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "8",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی (خشک یا تر)",
    label: "شیرینی (خشک یا تر)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چیپس یا پفک.jpg",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بسته در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بسته در ماه",
      },
      {
        id: "3",
        label: "یک بسته در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بسته در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بسته در هفته",
      },
      {
        id: "6",
        label: "یک بسته در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بسته در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
      {
        id: "8",
        label: "4 پیش دستی در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید",
    id: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    label: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره",
    label: "کره",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک  قالب سی گرمی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3  قالب سی گرمی در ماه",
      },
      {
        id: "3",
        label: "یک  قالب سی گرمی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4  قالب سی گرمی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6  قالب سی گرمی در هفته",
      },
      {
        id: "6",
        label: "یک  قالب سی گرمی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قالب سی گرمی  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه",
    label: "خامه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذا خوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پنیر.webp",
    subLabel: "معمولی یا خامه ای",
    id: "پنیر",
    label: "پنیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "3",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی کبریت در هفته",
      },
      {
        id: "5",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "6",
        label: "2 تا 3 قوطی کبریت در روز",
      },
      {
        id: "7",
        label: "4 تا 5 قوطی کبریت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیرکاکائو.jpg",
    subLabel: "",
    id: "شیر کاکائو",
    label: "شیر کاکائو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر",
    label: "شیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آجیل سویا و یا شیر سویا.jpg",
    subLabel: "",
    id: "آجیل سویا و یا شیر سویا",
    label: "آجیل سویا و یا شیر سویا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید",
    id: "کشک",
    label: "کشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماست.webp",
    subLabel: "",
    id: "ماست",
    label: "ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه ماست خوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه ماست خوری در ماه",
      },
      {
        id: "3",
        label: "یک کاسه ماست خوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه ماست خوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه ماست خوری در هفته",
      },
      {
        id: "6",
        label: "یک کاسه ماست خوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه ماست خوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کاسه ماست خوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی",
    label: "بستنی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد را درنظر نگیرید",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما",
    label: "خرما",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش",
    label: "کشمش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد (حاوی کاهو، کلم و …)",
    label: "سالاد (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 پیش دستی در روز",
      },
      {
        id: "9",
        label: "6 پیش دستی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت خشک.jpg",
    subLabel: "",
    id: "توت خشک",
    label: "توت خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "طالبی، خربزه، هندوانه و گرمک",
    label: "طالبی، خربزه، هندوانه و گرمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاچ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاچ در ماه",
      },
      {
        id: "3",
        label: "یک قاچ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاچ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاچ در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاچ در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاچ در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاچ در روز",
      },
      {
        id: "9",
        label: "10 قاچ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    label: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیوی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "کیوی",
    label: "کیوی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (1 مشت = 10 عدد)",
    id: "گیلاس یا آلبالو",
    label: "گیلاس یا آلبالو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "زردآلو",
    label: "زردآلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "7",
        label: "4 تا 7 عدد در روز",
      },
      {
        id: "8",
        label: "8 تا 10 عدد در روز",
      },
      {
        id: "9",
        label: "11 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلو (زرد و قرمز).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "آلو (زرد و قرمز)",
    label: "آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلوچه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت = 5 عدد)",
    id: "آلوچه (گوجه سبز)",
    label: "آلوچه (گوجه سبز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3 مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انجیر تازه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انجیر تازه",
    label: "انجیر تازه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت فرنگی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=5 عدد)",
    id: "توت فرنگی ",
    label: "توت فرنگی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "یک عدد در روز",
      },
      {
        id: "6",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک خوشه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 خوشه در ماه",
      },
      {
        id: "3",
        label: "یک خوشه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 خوشه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 خوشه در هفته",
      },
      {
        id: "6",
        label: "یک خوشه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 خوشه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 خوشه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت تازه.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=10 عدد توت)",
    id: "توت تازه",
    label: "توت تازه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نمک.jpg",
    subLabel: "نمک اضافه شده در زمان صرف غذا را در نظر بگیرید",
    id: "نمک",
    label: "نمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق چای خوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق چای خوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق چای خوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق چای خوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق چای خوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق چای خوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق چای خوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق چای خوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق چای خوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
];

export const Habit = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن تلفن همراه جایگزین الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: " (میان وعده ها را درنظر نگیرید)",
    id: "روزانه چند وعده غذایی اصلی می خورید؟",
    label: "روزانه چند وعده غذایی اصلی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "1 وعده" },
      {
        id: "2",
        label: "2 وعده",
      },
      {
        id: "3",
        label: "3 وعده",
      },
      {
        id: "4",
        label: "4 وعده",
      },
      {
        id: "5",
        label: "5 وعده یا بیشتر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف وعده غذایی را مشخص نمایید"
    ),
  },
  {
    subLabel:
      " (منظور خوردن هر چیزی خارج از وعده های غذایی است، مثلا خوردن یک سیب یا یک تکه کیک، یا یک لیوان شیر یا یک شکلات یا …)",
    id: "روزانه چند میان وعده دارید؟ ",
    label: "روزانه چند میان وعده دارید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "1 تا 2 میان وعده",
      },
      {
        id: "3",
        label: "3 تا 5 میان وعده",
      },
      {
        id: "4",
        label: "بیشتر از 5 میان وعده",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف میان وعده را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    label: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    type: "radio",
    options: [
      { id: "1", label: "صبحانه" },
      {
        id: "2",
        label: "ناهار",
      },
      {
        id: "3",
        label: "عصرانه",
      },
      {
        id: "4",
        label: "شام",
      },
    ],
    validation: Yup.string().required("لطفا حجیم ترین وعده را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    label: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "کم (کمتر از 20 ثانیه)" },
      {
        id: "2",
        label: "متوسط (بین 20 تا 40 ثانیه)",
      },
      {
        id: "3",
        label: "زیاد (بیش از 40 ثانیه)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    label: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "ناهار نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شام خوردن شما چقدر طول می کشد؟",
    label: "معمولا شام خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "ناهار نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    label: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "دراز نمی کشم",
      },
      { id: "2", label: "کمتر از نیم ساعت" },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "4-2 ساعت",
      },
      {
        id: "5",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    label: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از نیم ساعت" },
      {
        id: "2",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "3",
        label: "4-2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثلا خوردن یک میوه یا یک لیوان چای) ",
    id: "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    label:
      "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "کمتر از نیم ساعت",
      },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 2 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چند روز در هفته صبحانه می خورید؟",
    label: "چند روز در هفته صبحانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    label:
      "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته ناهار می خورید؟",
    label: "معمولا چند روز در هفته ناهار می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (شام های سبک را نیز درنظر بگیرید)",
    id: "معمولا چند روز در هفته شام می خورید؟",
    label: "معمولا چند روز در هفته شام می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته عصرانه می خورید؟",
    label: "معمولا چند روز در هفته عصرانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    label:
      "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    label:
      "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "1 لیوان یا کمتر",
      },
      {
        id: "3",
        label: "3-2 لیوان",
      },
      {
        id: "4",
        label: "بیش از 3 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    label:
      "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    type: "radio",
    options: [
      { id: "1", label: "معمولی" },
      {
        id: "2",
        label: "سرد",
      },
      {
        id: "3",
        label: "خیلی سرد",
      },
      {
        id: "4",
        label: "در این زمان ها مایعات مصرف نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    label: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    label: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تقریبا هرگز" },
      {
        id: "2",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "3",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    label: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "روغن مخصوص سرخ کردن" },
      {
        id: "2",
        label: "روغن مایع معمولی",
      },
      {
        id: "3",
        label: "روغن نباتی جامد",
      },
      {
        id: "4",
        label: "کره یا مارگارین",
      },
      {
        id: "5",
        label: "روغن زیتون",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    label: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    label:
      "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "همه را دور می ریزم",
      },
      {
        id: "3",
        label: "تاکنون با چنین موردی مواجه نشدم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    label: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "کمتر از یک بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "4",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "5",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثل برنج دودی، ماهی دودی، بادمجان دودی و …)",
    id: "آیا شما از غذای دودی استفاده می کنید؟",
    label: "آیا شما از غذای دودی استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "4",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "روزانه چند لیوان آب می نوشید؟",
    label: "روزانه چند لیوان آب می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "صفر" },
      {
        id: "2",
        label: "1 تا 2 لیوان",
      },
      {
        id: "3",
        label: "2 تا 5 لیوان",
      },
      {
        id: "4",
        label: "5 تا 8 لیوان",
      },
      {
        id: "5",
        label: "بیشتر از 8 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    label: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "آب معدنی",
      },
      {
        id: "3",
        label: "اب لوله کشی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    label: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "آبمیوه صنعتی",
      },
      {
        id: "3",
        label: "آبمیوه طبیعی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    label: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "چای مصرف نمی کنم" },
      {
        id: "2",
        label: "1 تا 2 عدد",
      },
      {
        id: "3",
        label: "3 تا 4 عدد",
      },
      {
        id: "4",
        label: "5 عدد یا بیشتر",
      },
      {
        id: "5",
        label: "از قند یا پولکی برای صرف چای استفاده نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    label: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم چرب ( کمتر از 2 درصد چربی)",
      },
      {
        id: "2",
        label: "بین 2 تا 2.5 درصد چربی",
      },
      {
        id: "3",
        label: "محلی یا پرچرب (بیشتر از 2.5 درصد چربی)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (منظور سویا اضافه شده به غذا، آجیل سویا و شیرسویا می باشد)",
    id: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    label: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    label: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم نمک",
      },
      {
        id: "2",
        label: "با نمک متوسط",
      },
      {
        id: "3",
        label: "پرنمک",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    label: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "نمک ید دار",
      },
      {
        id: "2",
        label: "نمک دریا",
      },
      {
        id: "3",
        label: "نمک سنتی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    label: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هیچ یک",
      },
      {
        id: "2",
        label: "شام",
      },
      {
        id: "3",
        label: "ناهار",
      },
      {
        id: "4",
        label: "صبحانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا می توانید هر غذایی را بجوید؟",
    label: "آیا می توانید هر غذایی را بجوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بله مشکلی ندارم",
      },
      {
        id: "2",
        label: "فقط می توانم غذاهای خیلی نرم یا خمیری را بجوم",
      },
      {
        id: "3",
        label: "میتوانم غذاهای نسبتا سفت را نیز بجوم",
      },
      {
        id: "4",
        label: "هیچ غذایی را نمی توانم به خوبی بجوم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    label: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    label: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (حداکثر ۳ گزینه را می‌توانید انتخاب کنید)",
    id: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    label: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "تفلون" },
      { id: "2", label: "استیل" },
      { id: "3", label: "روی" },
      { id: "4", label: "چدنی" },
      { id: "5", label: "مسی" },
      { id: "6", label: "سرامیکی یا گرانیتی" },
      { id: "7", label: "سنگی" },
      { id: "8", label: "آلومینیومی" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    label: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بلی",
      },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    label: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    type: "checkbox",
    options: [
      { id: "1", label: "ملامینی" },
      { id: "2", label: "فلزی" },
      { id: "3", label: "چینی" },
      { id: "4", label: "گلی یا سفالی" },
      { id: "5", label: "پلاستیکی" },
      { id: "6", label: "شیشه ای" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
];
