import * as Yup from "yup";

export const ISFAHANFFQ = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در یک ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی درهفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی درهفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "آب گوشت و گوشت کوبیده آن را درنظر بگیرید",
    id: "ابگوشت",
    label: "ابگوشت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوپ.jpg",
    subLabel: "انواع سوپ ها را درنظر بگیرید",
    id: "سوپ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "8",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلیم بادمجون.webp",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج استامبلی.jpg",
    subLabel: "در کل قاطی پلوها",
    id: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    label: "استامبولی، عدس پلو، لوبیا پلو، ماش پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابیجات و … استفاده می شود. ",
    id: "پلو سفید",
    label: "پلو سفید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
      {
        id: "8",
        label: "4 تا 5 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی",
    label: "خورشت قورمه سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "",
    id: "خورشت قیمه بادمجان",
    label: "خورشت قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قیمه.jpg",
    subLabel: " (خورشت قیمه همراه با بادمجان را در نظر نگیرید)",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت لوبیا سبز.jpg",
    subLabel: "",
    id: "خورشت لوبیا سبز",
    label: "خورشت لوبیا سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت گوشت چرخ کرده.jpg",
    subLabel: "",
    id: "خورشت گوشت چرخ کرده",
    label: "خورشت گوشت چرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه خورشتی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه خورشتی در ماه",
      },
      {
        id: "3",
        label: "یک کاسه خورشتی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه خورشتی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه خورشتی در هفته",
      },
      {
        id: "6",
        label: "یک کاسه خورشتی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه خورشتی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "کباب کوبیده را درنظر نگیرید",
    id: "کباب تابه ای",
    label: "کباب تابه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب کوبیده.jpg",
    subLabel: "",
    id: "کباب کوبیده",
    label: "کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کباب برگ.jpg",
    subLabel: "",
    id: "کباب برگ",
    label: "کباب برگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب",
    label: "جوجه کباب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 4 سیخ در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "یک واحد=یک ران یا نصف سینه مرغ",
    id: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    label: "مرغ (زرشک پلو با مرغ و خوراک مرغ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک واحد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 واحد در ماه",
      },
      {
        id: "3",
        label: "یک واحد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 واحد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 واحد در هفته",
      },
      {
        id: "6",
        label: "یک واحد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 واحد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "3",
        label: "یک قوطی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را شامل نمی شود",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "یک کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "6",
        label: "یک کف دست در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیتزا.jpg",
    subLabel: "یک عدد=یک مینی پیتزا کامل",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماکارونی.jpg",
    subLabel: "شامل ماکارونی ساده و شکل دار",
    id: "ماکارونی",
    label: "ماکارونی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بشقاب در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بشقاب در ماه",
      },
      {
        id: "3",
        label: "یک بشقاب در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بشقاب در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بشقاب در هفته",
      },
      {
        id: "6",
        label: "یک بشقاب در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بشقاب در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "یک کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کف دست در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کف دست در هفته",
      },
      {
        id: "6",
        label: "یک کف دست در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کف دست در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کف دست در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع کنسور.jpg",
    subLabel: "به غیر از تن ماهی و کنسرو لوبیا",
    id: "انواع کنسرو",
    label: "انواع کنسرو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی در ماه",
      },
      {
        id: "3",
        label: "یک قوطی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی در هفته",
      },
      {
        id: "6",
        label: "یک قوطی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قوطی در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قوطی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته تبریزی.jpg",
    subLabel: "",
    id: "کوفته برنجی/تبریزی",
    label: "کوفته برنجی/تبریزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کوفته قلقلی..jpg",
    subLabel: "",
    id: "کوفته قلقلی (سرگنجشکی)",
    label: "کوفته قلقلی (سرگنجشکی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3  بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مربا.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای، قهوه یا شربت)",
    label: "شکر (در چای، قهوه یا شربت)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قند یا پولکی.jpg",
    subLabel: "",
    id: "قند یا پولکی",
    label: "قند یا پولکی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "16 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا شکری.jpg",
    subLabel: "یک قوطی کبریت=یک قاشق غذاخوری",
    id: "حلوا شکری",
    label: "حلوا شکری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "3",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "4",
        label: "2 تا 3 قوطی کبریت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قوطی کبریت در هفته",
      },
      {
        id: "6",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قوطی کبریت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قوطی کبریت در روز",
      },
      {
        id: "9",
        label: "6 قوطی کبریت در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/حلوا خانگی.jpg",
    subLabel: "",
    id: "حلوای خانگی",
    label: "حلوای خانگی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گز.jpg",
    subLabel: "",
    id: "گز",
    label: "گز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 4 عدد در روز",
      },
      {
        id: "8",
        label: "5 تا 7 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شله زرد.jpg",
    subLabel: "",
    id: "شله زرد",
    label: "شله زرد",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فرنی.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "فرنی",
    label: "فرنی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قطعه مثلثی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قطعه مثلثی در ماه",
      },
      {
        id: "3",
        label: "یک قطعه مثلثی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قطعه مثلثی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قطعه مثلثی در هفته",
      },
      {
        id: "6",
        label: "یک قطعه مثلثی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قطعه مثلثی  در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قطعه مثلثی در روز",
      },
      {
        id: "9",
        label: "6 قطعه مثلثی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "9",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوشفیل.jpg",
    subLabel: "",
    id: "گوشفیل",
    label: "گوشفیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
      {
        id: "10",
        label: "فقط در ماه رمضان (تقریبا هر روز)",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خورشت ماست.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد.",
    id: "خورشت ماست",
    label: "خورشت ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بریونی.jpg",
    subLabel: "",
    id: "بریانی",
    label: "بریانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/جگر و دل.jpg",
    subLabel: "یک سیخ=4 تکه جگر",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک سیخ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 سیخ در ماه",
      },
      {
        id: "3",
        label: "یک سیخ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 سیخ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 سیخ در هفته",
      },
      {
        id: "6",
        label: "یک سیخ در روز",
      },
      {
        id: "7",
        label: "2 تا 3 سیخ در روز",
      },
      {
        id: "8",
        label: "4 تا 5 سیخ در روز",
      },
      {
        id: "9",
        label: "6 سیخ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ساندویچ..jpg",
    subLabel: "منظور ساندویچ با نان باگت می باشد",
    id: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سوسیس.jpg",
    subLabel: "",
    id: "سوسیس (به غیر از ساندویچ)",
    label: "سوسیس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کالباس.jpg",
    subLabel: "",
    id: "کالباس (به غیر از ساندویچ)",
    label: "کالباس (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "3",
        label: "یک برش در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "6",
        label: "یک برش در روز",
      },
      {
        id: "7",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "8",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/همبرگر.jpg",
    subLabel: "",
    id: "همبرگر (به غیر از ساندویچ)",
    label: "همبرگر (به غیر از ساندویچ)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس قرمز",
    label: "سس قرمز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور",
    label: "خیارشور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 تا 9 عدد در روز",
      },
      {
        id: "9",
        label: "10 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "آب لیمو",
    label: "آب لیمو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع ترشی.jpg",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاشق غذاخوری در روز",
      },
      {
        id: "9",
        label: "10 قاشق غذاخوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع تخمه.jpg",
    subLabel: "یک مشت=دو قاشق غذاخوری",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "یک مشت=10 عدد بادام، پسته یا فندق",
    id: "بادام، پسته، فندق، بادام زمینی",
    label: "بادام، پسته، فندق، بادام زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قطعه متوسط در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قطعه متوسط در ماه",
      },
      {
        id: "3",
        label: "یک قطعه متوسط در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قطعه متوسط در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قطعه متوسط در هفته",
      },
      {
        id: "6",
        label: "یک قطعه متوسط در روز",
      },
      {
        id: "7",
        label: "2 تا 3  قطعه متوسط در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قطعه متوسط در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "قهوه و نسکافه",
    label: "قهوه و نسکافه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "9",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3  لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
      {
        id: "9",
        label: "6 لیوان یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک استکان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 استکان در ماه",
      },
      {
        id: "3",
        label: "یک استکان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 استکان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 استکان در هفته",
      },
      {
        id: "6",
        label: "یک استکان در روز",
      },
      {
        id: "7",
        label: "2 تا 4 استکان در روز",
      },
      {
        id: "8",
        label: "5 تا 6 استکان در روز",
      },
      {
        id: "9",
        label: "8 تا 11 استکان در روز",
      },
      {
        id: "10",
        label: "12 استکان در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "طبیعی و صنعتی",
    id: "انواع آبمیوه",
    label: "انواع آبمیوه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نوشابه.jpg",
    subLabel: "",
    id: "نوشابه یا دلستر",
    label: "نوشابه یا دلستر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "یک عدد معادل یک بیسکوییت ساقه طلایی می باشد",
    id: "انواع بیسکوئیت",
    label:
      "انواع بیسکوئیت (ساده، سبوسدار، ویفر، کراکر، کرامدار و ساق طلایی و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 6 عدد در هفته",
      },
      {
        id: "4",
        label: "1 تا 5 عدد در روز",
      },
      {
        id: "5",
        label: "6 تا 10 عدد در روز",
      },
      {
        id: "6",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "7",
        label: "بیشتر از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون",
    label: "نان تافتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "2 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، نان جو و ..)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کف دست در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کف دست در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 کف دست در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 کف دست در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 کف دست در روز",
      },
      {
        id: "6",
        label: "4 تا 6 کف دست در روز",
      },
      {
        id: "7",
        label: "7 تا 10 کف دست در روز",
      },
      {
        id: "8",
        label: "11 تا 15 کف دست در روز",
      },
      {
        id: "9",
        label: "16 کف دست یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک خانگی.jpg",
    subLabel: "یک برش=یک بسته کیک",
    id: "کیک (خانگی یا بسته بندی)",
    label: "کیک (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک برش در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 برش در ماه",
      },
      {
        id: "3",
        label: "یک برش در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 برش در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 برش در هفته",
      },
      {
        id: "6",
        label: "یک برش در روز",
      },
      {
        id: "7",
        label: "2 تا 3  برش در روز",
      },
      {
        id: "8",
        label: "4 تا 5 برش در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی (خشک یا تر)",
    label: "شیرینی (خشک یا تر)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/چیپس یا پفک.jpg",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بسته در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بسته در ماه",
      },
      {
        id: "3",
        label: "یک بسته در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بسته در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بسته در هفته",
      },
      {
        id: "6",
        label: "یک بسته در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بسته در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
      {
        id: "8",
        label: "4 پیش دستی در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید",
    id: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    label: "سیب زمینی تنوری یا آب پز (پوره یا خوراک سیب زمینی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره",
    label: "کره",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک  قالب سی گرمی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3  قالب سی گرمی در ماه",
      },
      {
        id: "3",
        label: "یک  قالب سی گرمی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4  قالب سی گرمی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6  قالب سی گرمی در هفته",
      },
      {
        id: "6",
        label: "یک  قالب سی گرمی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قالب سی گرمی  در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه",
    label: "خامه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق غذا خوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق غذاخوری در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پنیر.webp",
    subLabel: "معمولی یا خامه ای",
    id: "پنیر",
    label: "پنیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قوطی کبریت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قوطی کبریت در ماه",
      },
      {
        id: "3",
        label: "یک قوطی کبریت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قوطی کبریت در هفته",
      },
      {
        id: "5",
        label: "یک قوطی کبریت در روز",
      },
      {
        id: "6",
        label: "2 تا 3 قوطی کبریت در روز",
      },
      {
        id: "7",
        label: "4 تا 5 قوطی کبریت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیرکاکائو.jpg",
    subLabel: "",
    id: "شیر کاکائو",
    label: "شیر کاکائو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر",
    label: "شیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آجیل سویا و یا شیر سویا.jpg",
    subLabel: "",
    id: "آجیل سویا و یا شیر سویا",
    label: "آجیل سویا و یا شیر سویا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید",
    id: "کشک",
    label: "کشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/ماست.webp",
    subLabel: "",
    id: "ماست",
    label: "ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه ماست خوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه ماست خوری در ماه",
      },
      {
        id: "3",
        label: "یک کاسه ماست خوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه ماست خوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه ماست خوری در هفته",
      },
      {
        id: "6",
        label: "یک کاسه ماست خوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه ماست خوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 کاسه ماست خوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی",
    label: "بستنی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 بار در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "یک بار در روز",
      },
      {
        id: "7",
        label: "2 تا 3 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک لیوان در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 لیوان در ماه",
      },
      {
        id: "3",
        label: "یک لیوان در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 لیوان در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 لیوان در هفته",
      },
      {
        id: "6",
        label: "یک لیوان در روز",
      },
      {
        id: "7",
        label: "2 تا 3 لیوان در روز",
      },
      {
        id: "8",
        label: "4 تا 5 لیوان در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد را درنظر نگیرید",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 4 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما",
    label: "خرما",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 عدد در هفته",
      },
      {
        id: "4",
        label: "4 تا 6 عدد در هفته",
      },
      {
        id: "5",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "6",
        label: "4 تا 6 عدد در روز",
      },
      {
        id: "7",
        label: "7 تا 10 عدد در روز",
      },
      {
        id: "8",
        label: "11 تا 15 عدد در روز",
      },
      {
        id: "9",
        label: "بیش از 15 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش",
    label: "کشمش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 پیش دستی در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "کاسه ماست خوری منظور می باشد",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک کاسه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 کاسه در ماه",
      },
      {
        id: "3",
        label: "یک کاسه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 کاسه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 کاسه در هفته",
      },
      {
        id: "6",
        label: "یک کاسه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 کاسه یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد (حاوی کاهو، کلم و …)",
    label: "سالاد (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک پیش دستی در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 پیش دستی در ماه",
      },
      {
        id: "3",
        label: "یک پیش دستی در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 پیش دستی در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 پیش دستی در هفته",
      },
      {
        id: "6",
        label: "یک پیش دستی در روز",
      },
      {
        id: "7",
        label: "2 تا 3 کاسه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 پیش دستی در روز",
      },
      {
        id: "9",
        label: "6 پیش دستی یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت خشک.jpg",
    subLabel: "",
    id: "توت خشک",
    label: "توت خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق غذاخوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق غذاخوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق غذاخوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق غذاخوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق غذاخوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق غذاخوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق غذاخوری در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "طالبی، خربزه، هندوانه و گرمک",
    label: "طالبی، خربزه، هندوانه و گرمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاچ در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاچ در ماه",
      },
      {
        id: "3",
        label: "یک قاچ در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاچ در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاچ در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 قاچ در روز",
      },
      {
        id: "7",
        label: "3 تا 5 قاچ در روز",
      },
      {
        id: "8",
        label: "6 تا 9 قاچ در روز",
      },
      {
        id: "9",
        label: "10 قاچ یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    label: "مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/کیوی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "کیوی",
    label: "کیوی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3  عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (1 مشت = 10 عدد)",
    id: "گیلاس یا آلبالو",
    label: "گیلاس یا آلبالو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3  مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "زردآلو",
    label: "زردآلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 3 عدد در روز",
      },
      {
        id: "7",
        label: "4 تا 7 عدد در روز",
      },
      {
        id: "8",
        label: "8 تا 10 عدد در روز",
      },
      {
        id: "9",
        label: "11 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلو (زرد و قرمز).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "آلو (زرد و قرمز)",
    label: "آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "1 تا 2 عدد در روز",
      },
      {
        id: "7",
        label: "3 تا 5 عدد در روز",
      },
      {
        id: "8",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آلوچه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت = 5 عدد)",
    id: "آلوچه (گوجه سبز)",
    label: "آلوچه (گوجه سبز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3 مشت در روز",
      },
      {
        id: "8",
        label: "4 تا 5 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انجیر تازه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انجیر تازه",
    label: "انجیر تازه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
      {
        id: "8",
        label: "4 تا 5 عدد در روز",
      },
      {
        id: "9",
        label: "6 عدد در روز یا بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت فرنگی.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=5 عدد)",
    id: "توت فرنگی ",
    label: "توت فرنگی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "یک عدد در روز",
      },
      {
        id: "6",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک خوشه در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 خوشه در ماه",
      },
      {
        id: "3",
        label: "یک خوشه در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 خوشه در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 خوشه در هفته",
      },
      {
        id: "6",
        label: "یک خوشه در روز",
      },
      {
        id: "7",
        label: "2 تا 3 خوشه در روز",
      },
      {
        id: "8",
        label: "4 تا 5 خوشه در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/توت تازه.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک مشت=10 عدد توت)",
    id: "توت تازه",
    label: "توت تازه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک مشت در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 مشت در ماه",
      },
      {
        id: "3",
        label: "یک مشت در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 مشت در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 مشت در هفته",
      },
      {
        id: "6",
        label: "یک مشت در روز",
      },
      {
        id: "7",
        label: "2 تا 3 مشت در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک عدد در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 عدد در ماه",
      },
      {
        id: "3",
        label: "یک عدد در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 عدد در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 عدد در هفته",
      },
      {
        id: "6",
        label: "یک عدد در روز",
      },
      {
        id: "7",
        label: "2 تا 3 عدد در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "یک بار در روز",
      },
      {
        id: "6",
        label: "2 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/نمک.jpg",
    subLabel: "نمک اضافه شده در زمان صرف غذا را در نظر بگیرید",
    id: "نمک",
    label: "نمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک قاشق چای خوری در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 قاشق چای خوری در ماه",
      },
      {
        id: "3",
        label: "یک قاشق چای خوری در هفته",
      },
      {
        id: "4",
        label: "2 تا 4 قاشق چای خوری در هفته",
      },
      {
        id: "5",
        label: "5 تا 6 قاشق چای خوری در هفته",
      },
      {
        id: "6",
        label: "یک قاشق چای خوری در روز",
      },
      {
        id: "7",
        label: "2 تا 3 قاشق چای خوری در روز",
      },
      {
        id: "8",
        label: "4 تا 5 قاشق چای خوری در روز",
      },
      {
        id: "9",
        label: "6 قاشق چای خوری یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
];

export const ISFAHANNEWFFQ = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    serving: "",
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    serving: "",
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    serving: "یک بشقاب غذاخوری",
    img: "./Image/برنج استامبلی.jpg",
    subLabel:
      "(شوید پلو، عدس پلو، لوبیا پلو، دمپختک، باقالی پلو، استانبولی و...)",
    id: "قاطی پلو",
    label: "قاطی پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب غذا خوری",
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابی جات و … استفاده می شود. ",
    id: "برنج یا زرشک پلو",
    label: "برنج یا زرشک پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب غذاخوری",
    img: "./Image/ماکارونی.jpg",
    subLabel: "",
    id: "ماکارونی، لازانیا، نودل و پاستا",
    label: "ماکارونی، لازانیا، نودل و پاستا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی یا خورشت کرفس",
    label: "خورشت قورمه سبزی یا خورشت کرفس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "",
    id: "خورشت بادمجان یا قیمه بادمجان",
    label: "خورشت بادمجان یا قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قیمه.jpg",
    subLabel: "",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت لوبیا سبز.jpg",
    subLabel: "",
    id: "خورشت لوبیا سبز",
    label: "خورشت لوبیا سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/حلیم بادمجون.webp",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه همراه با گوشت کوبیده",
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "",
    id: "آبگوشت و تاس کباب",
    label: "آبگوشت و تاس کباب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود .",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ کباب کوبیده یا دو تکه کباب تابه ای",
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "",
    id: "کباب تابه ای یا کباب کوبیده",
    label: "کباب تابه ای یا کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ",
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب و کتف و بال مرغ",
    label: "جوجه کباب و کتف و بال مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد ران مرغ یا نصف سینه مرغ",
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "",
    id: "خورشت مرغ، خوراک مرغ و تاس کباب مرغ",
    label: "خورشت مرغ، خوراک مرغ و تاس کباب مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "2 عدد ناگت یا 1 عدد فیله یا 1 تکه مرغ سوخاری",
    img: "./Image/فیله مرغ سوخاری (ناگت، مرغ سوخاری و فیله مرغ و...).jpg",
    subLabel: "",
    id: "ناگت، مرغ سوخاری و فیله مرغ",
    label: "ناگت، مرغ سوخاری و فیله مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت گوشت چرخ کرده.jpg",
    subLabel: "",
    id: "خوارک یا خورشت گوشت چرخ کرده",
    label: "خوراک یا خورشت گوشت چرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی معادل 5 عدد",
    img: "./Image/کوفته قلقلی..jpg",
    subLabel: "",
    id: "کوفته قلقلی (سرگنجشکی) یا قیمه ریزه",
    label: "کوفته قلقلی (سرگنجشکی) یا قیمه ریزه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/بریونی.jpg",
    subLabel: "",
    id: "بریانی",
    label: "بریانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه (زبان، کله، پاچه و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ معادل 4 تکه جگر",
    img: "./Image/جگر و دل.jpg",
    subLabel: "",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی ",
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه یا بشقاب",
    img: "./Image/سوپ.jpg",
    subLabel: "سوپ مرغ، جو، سبزیجات و ... را درنظر بگیرید .",
    id: "سوپ ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/خورشت ماست.jpg",
    subLabel: "",
    id: "خورشت ماست",
    label: "خورشت ماست",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "دو تکه مثلثی",
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/ساندویچ فلافل.jpg",
    subLabel: "",
    id: "ساندویچ فلافل",
    label: "ساندویچ فلافل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/ساندویچ..jpg",
    subLabel: "",
    id: "انواع ساندویچ (سوسیس، کالباس، همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (سوسیس، کالباس، همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیتزای کوچک معادل 6 اسلایس",
    img: "./Image/پیتزا.jpg",
    subLabel: "",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد کوچک یا 2 برش",
    img: "./Image/سوسیس.jpg",
    subLabel: "غیر از موارد استفاده شده در ساندویج و فست فود",
    id: "انواع سوسیس و کالباس",
    label: "انواع سوسیس و کالباس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی",
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را در نظر نگیرید .",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد فصل (حاوی کاهو، کلم و …)",
    label: "سالاد فصل (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه یا یک کف دست",
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، هفت غله، تست سبوس دار و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه",
    img: "./Image/نان تست.jpg",
    subLabel: "",
    id: "نان تست سفید",
    label: "نان تست سفید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان خشک.jpg",
    subLabel: "",
    id: "نان خشک",
    label: "نان خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون و خانگی",
    label: "نان تافتون و خانگی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 10 عدد",
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید .",
    id: "سیب زمینی",
    label: "سیب زمینی (تنوری، آبپز، پوره یا خوراک سیب زمینی و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان ذرت یا یک عدد بلال",
    img: "./Image/بلال یا ذرت.jpg",
    subLabel: "",
    id: "ذرت، پفیلا یا بلال ",
    label: "ذرت، پفیلا یا بلال ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر پرچرب.jpg",
    subLabel: "",
    id: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    label: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر کم چرب.jpg",
    subLabel: "",
    id: "پنیر کم چرب",
    label: "پنیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر شکلاتی، شیر کاکائو  و شیر قهوه.jpg",
    subLabel: "",
    id: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    label: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرموز.jpg",
    subLabel: "",
    id: "شیرموز",
    label: "شیرموز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرپرچرب.jpg",
    subLabel: "",
    id: "شیر پرچرب",
    label: "شیر پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر کم چرب",
    label: "شیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست.jpg",
    subLabel: " (سنتی، چکیده و خامه ای)",
    id: "ماست پرچرب",
    label: "ماست پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست کم چرب.jpg",
    subLabel: "",
    id: "ماست کم چرب",
    label: "ماست کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک  عدد",
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید.",
    id: "کشک (مایع و خشک)",
    label: "کشک (مایع و خشک)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه / سرشیر",
    label: "خامه / سرشیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد یا نصف لیوان",
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی (سنتی و غیر سنتی)",
    label: "بستنی (سنتی و غیر سنتی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید.",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/هلو یا شلیل.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هلو یا شلیل",
    label: "هلو یا شلیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "زردآلو یا آلو (زرد و قرمز)",
    label: "زردآلو یا آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 10 عدد",
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "گیلاس یا آلبالو",
    label: "گیلاس یا آلبالو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل 1 لیوان",
    img: "./Image/هندوانه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هندوانه",
    label: "هندوانه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل یک لیوان",
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "خربزه، طالبی، ملون وگرمک",
    label: "خربزه، طالبی، ملون وگرمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری آبلیمو معادل نصف لیمو ترش",
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "لیموترش یا آبلیمو",
    label: "لیموترش یا آبلیمو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11بار و بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "",
    id: "آبمیوه طبیعی",
    label: "آبمیوه طبیعی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/آبمیوه صنعتی.jpg",
    subLabel: "",
    id: "آبمیوه صنعتی",
    label: "آبمیوه صنعتی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/انواع شربت.jpg",
    subLabel: "",
    id: "انواع شربت",
    label: "انواع شربت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات",
    label: "مرکبات (پرتقال، نارنگی، کیوی، لیموشیرین و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل5 عدد یا یک قاشق غذاخوری",
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش و مویز",
    label: "کشمش و مویز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک خوشه متوسط",
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل  3عدد",
    img: "./Image/انجیر تازه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انجیر خشک",
    label: "انجیر خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 5عدد",
    img: "./Image/توت خشک.jpg",
    subLabel: "(توت خشک، برگ هلو، برگ زردآلو وآلبالو خشک)",
    id: "میوه های خشک",
    label: "میوه های خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما و رطب",
    label: "خرما و رطب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک مشت معادل 5 عدد",
    img: "./Image/زیتون.jpg",
    subLabel: "",
    id: "زیتون",
    label: "زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید .",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد را درنظر نگیرید .",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/فلفل دلمه ای.jpg",
    subLabel: "",
    id: "فلفل دلمه ای",
    label: "فلفل دلمه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  // {
  //   serving: "یک پیش دستی معادل 5 عدد",
  //   img: "./Image/قارچ.jpg",
  //   subLabel: "",
  //   id: "قارچ",
  //   label: "قارچ",
  //   type: "radio",
  //   options: [
  //     {
  //       id: "1",
  //       label: "تقریبا هرگز یا کمتر از یک بار در ماه",
  //     },
  //     {
  //       id: "2",
  //       label: "1-3 بار در ماه",
  //     },
  //     {
  //       id: "3",
  //       label: "1 بار در هفته",
  //     },
  //     {
  //       id: "4",
  //       label: "2-4 بار  در هفته",
  //     },
  //     {
  //       id: "5",
  //       label: "5-6 بار در هفته",
  //     },
  //     {
  //       id: "6",
  //       label: "1 بار در روز",
  //     },
  //     {
  //       id: "7",
  //       label: "2-3 بار در روز",
  //     },
  //     {
  //       id: "8",
  //       label: "4-5 بار در روز",
  //     },
  //     {
  //       id: "9",
  //       label: "6 بار یا بیشتر در روز",
  //     },
  //   ],
  //   validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  // },
  {
    serving: "یک عدد متوسط یا نصف فنجان",
    img: "./Image/هویج خام.jpg",
    subLabel: "",
    id: "هویج و آب هویج",
    label: "هویج و آب هویج",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل 5 حبه سیر",
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/کدو (خورشت کدو، پخارپز و...).jpg",
    subLabel: "",
    id: "کدو",
    label: "کدو (خورشت کدو، پخارپز و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 10 عدد بادام، پسته یا فندق",
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "",
    id: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    label: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل دو قاشق غذاخوری",
    img: "./Image/انواع تخمه.jpg",
    subLabel: "",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 2 قاشق غذاخوری",
    img: "./Image/آجیل سویا و یا شیر سویا.jpg",
    subLabel: "",
    id: "آجیل سویا",
    label: "آجیل سویا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد پولکی معادل یک حبه قند",
    img: "./Image/قند یا پولکی.jpg",
    subLabel: "",
    id: "قند یا پولکی",
    label: "قند یا پولکی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قطعه متوسط",
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گز.jpg",
    subLabel: "",
    id: "گز",
    label: "گز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گوشفیل.jpg",
    subLabel: "",
    id: "گوشفیل",
    label: "گوشفیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک عدد",
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی تر",
    label: "شیرینی تر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شیرینی خشک.jpg",
    subLabel: "",
    id: "شیرینی خشک",
    label: "شیرینی خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد معادل یک بیسکوییت ساقه طلایی",
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "",
    id: "انواع بیسکوئیت",
    label:
      "انواع بیسکوئیت (ساده، سبوسدار، ویفر، کراکر، کرامدار و ساق طلایی و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک بسته",
    img: "./Image/کیک خانگی.jpg",
    subLabel: "",
    id: " کیک و کلوچه (خانگی یا بسته بندی)",
    label: " کیک و کلوچه (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "نسکافه",
    label: "کافی میکس، نسکافه، کاپوچینو و ...",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/قهوه اسپرسو.jpg",
    subLabel: "",
    id: "قهوه دمی یا اسپرسو",
    label: "قهوه دمی یا اسپرسو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای یا قهوه)",
    label: "شکر (در چای یا قهوه)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک قوطی کبریت",
    img: "./Image/حلوا شکری.jpg",
    subLabel: "",
    id: "حلوا ارده یا حلوا شکری",
    label: "حلوا ارده یا حلوا شکری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/ارده شیره.jpg",
    subLabel: "",
    id: "ارده شیره",
    label: "ارده شیره",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  // {
  //   serving: "یک قاشق غذاخوری",
  //   img: "./Image/کره بادام زمینی.jpg",
  //   subLabel: "",
  //   id: "کره بادام زمینی",
  //   label: "کره بادام زمینی",
  //   type: "radio",
  //   options: [
  //     {
  //       id: "1",
  //       label: "تقریبا هرگز یا کمتر از یک بار در ماه",
  //     },
  //     {
  //       id: "2",
  //       label: "1-3 بار در ماه",
  //     },
  //     {
  //       id: "3",
  //       label: "1 بار در هفته",
  //     },
  //     {
  //       id: "4",
  //       label: "2-4 بار  در هفته",
  //     },
  //     {
  //       id: "5",
  //       label: "5-6 بار در هفته",
  //     },
  //     {
  //       id: "6",
  //       label: "1 بار در روز",
  //     },
  //     {
  //       id: "7",
  //       label: "2-3 بار در روز",
  //     },
  //     {
  //       id: "8",
  //       label: "4-5 بار در روز",
  //     },
  //     {
  //       id: "9",
  //       label: "6 بار یا بیشتر در روز",
  //     },
  //   ],
  //   validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  // },
  {
    serving: "قالب 10 گرمی",
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره یا مارگارین",
    label: "کره یا مارگارین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/مربا.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/روغن زیتون.jpg",
    subLabel: "",
    id: "روغن زیتون",
    label: "روغن زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/نوشابه.jpg",
    subLabel: "",
    id: "نوشابه، دلستر یا لیموناد",
    label: "نوشابه، دلستر یا لیموناد",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس کچاپ (قرمز)",
    label: "سس کچاپ (قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل دو قاشق غذاخوری",
    img: "./Image/انواع ترشی.jpg",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد خیارشور یا 1 قاشق غذاخوری شور",
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور و شور",
    label: "خیارشور و شور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بسته",
    img: "./Image/چیپس یا پفک.jpg",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق چای خوری",
    img: "./Image/نمک.jpg",
    subLabel: "نمک اضافه شده در زمان صرف غذا را در نظر بگیرید",
    id: "نمک",
    label: "نمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دمنوش.jpg",

    serving: "",
    subLabel: "",
    id: "آیا از دمنوش های گیاهی استفاده میکنید؟",
    label: "آیا از دمنوش های گیاهی استفاده میکنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بله",
      },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    subLabel: "(بیش از یک گزینه میتوانید انتخاب کنید)",
    img: "",
    id: "در صورت استفاده از دمنوش های گیاهی کدامیک به صورت معمول استفاده میشود؟ ",
    label:
      "در صورت استفاده از دمنوش های گیاهی کدامیک به صورت معمول استفاده میشود؟ ",
    type: "checkbox",
    options: [
      { id: "1", label: "گل گاو زبان" },
      { id: "2", label: "چای سبز" },
      { id: "3", label: "چای ترش" },
      { id: "4", label: "چای ماسالا" },
      { id: "5", label: "چای زعفران" },
      { id: "6", label: "چای و دارچین" },
      { id: "7", label: "دمنوش آویشن" },
      { id: "8", label: "دمنوش بابونه" },
      { id: "9", label: "دمنوش نعناع" },
      { id: "10", label: "بهارنارنج" },
      { id: "11", label: "دمنوش به لیمو" },
      { id: "12", label: "سایر" },
    ],
    validation: Yup.array(),
  },
  {
    subLabel: "",
    id: "سایر دمنوش ها:",
    label: "سایر دمنوش ها:",
    type: "text",
    validation: Yup.string("لطفا نام دمنوش را به درستی وارد کنید"),
    placeholder: "لطفا نام سایر دمنوش  ها اینجا وارد شود",
  },
];

export const HABIT = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: " (میان وعده ها را درنظر نگیرید)",
    id: "روزانه چند وعده غذایی اصلی می خورید؟",
    label: "روزانه چند وعده غذایی اصلی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "1 وعده" },
      {
        id: "2",
        label: "2 وعده",
      },
      {
        id: "3",
        label: "3 وعده",
      },
      {
        id: "4",
        label: "4 وعده",
      },
      {
        id: "5",
        label: "5 وعده یا بیشتر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف وعده غذایی را مشخص نمایید"
    ),
  },
  {
    subLabel:
      " (منظور خوردن هر چیزی خارج از وعده های غذایی است، مثلا خوردن یک سیب یا یک تکه کیک، یا یک لیوان شیر یا یک شکلات یا …)",
    id: "روزانه چند میان وعده دارید؟ ",
    label: "روزانه چند میان وعده دارید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "1 تا 2 میان وعده",
      },
      {
        id: "3",
        label: "3 تا 5 میان وعده",
      },
      {
        id: "4",
        label: "بیشتر از 5 میان وعده",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف میان وعده را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    label: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    type: "radio",
    options: [
      { id: "1", label: "صبحانه" },
      {
        id: "2",
        label: "ناهار",
      },
      {
        id: "3",
        label: "عصرانه",
      },
      {
        id: "4",
        label: "شام",
      },
    ],
    validation: Yup.string().required("لطفا حجیم ترین وعده را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    label: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "کم (کمتر از 20 ثانیه)" },
      {
        id: "2",
        label: "متوسط (بین 20 تا 40 ثانیه)",
      },
      {
        id: "3",
        label: "زیاد (بیش از 40 ثانیه)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    label: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "ناهار نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شام خوردن شما چقدر طول می کشد؟",
    label: "معمولا شام خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "شام نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    label: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "دراز نمی کشم",
      },
      { id: "2", label: "کمتر از نیم ساعت" },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "4-2 ساعت",
      },
      {
        id: "5",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    label: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از نیم ساعت" },
      {
        id: "2",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "3",
        label: "4-2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثلا خوردن یک میوه یا یک لیوان چای) ",
    id: "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    label:
      "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "کمتر از نیم ساعت",
      },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 2 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چند روز در هفته صبحانه می خورید؟",
    label: "چند روز در هفته صبحانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    label:
      "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته ناهار می خورید؟",
    label: "معمولا چند روز در هفته ناهار می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (شام های سبک را نیز درنظر بگیرید)",
    id: "معمولا چند روز در هفته شام می خورید؟",
    label: "معمولا چند روز در هفته شام می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته عصرانه می خورید؟",
    label: "معمولا چند روز در هفته عصرانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    label:
      "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    label:
      "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "1 لیوان یا کمتر",
      },
      {
        id: "3",
        label: "3-2 لیوان",
      },
      {
        id: "4",
        label: "بیش از 3 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    label:
      "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    type: "radio",
    options: [
      { id: "1", label: "معمولی" },
      {
        id: "2",
        label: "سرد",
      },
      {
        id: "3",
        label: "خیلی سرد",
      },
      {
        id: "4",
        label: "در این زمان ها مایعات مصرف نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    label: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    label: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تقریبا هرگز" },
      {
        id: "2",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "3",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    label: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "روغن مخصوص سرخ کردن" },
      {
        id: "2",
        label: "روغن مایع معمولی",
      },
      {
        id: "3",
        label: "روغن نباتی جامد",
      },
      {
        id: "4",
        label: "کره یا مارگارین",
      },
      {
        id: "5",
        label: "روغن زیتون",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    label: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    label:
      "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "همه را دور می ریزم",
      },
      {
        id: "3",
        label: "تاکنون با چنین موردی مواجه نشدم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    label: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "کمتر از یک بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "4",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "5",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثل برنج دودی، ماهی دودی، بادمجان دودی و …)",
    id: "آیا شما از غذای دودی استفاده می کنید؟",
    label: "آیا شما از غذای دودی استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "4",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "روزانه چند لیوان آب می نوشید؟",
    label: "روزانه چند لیوان آب می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "صفر" },
      {
        id: "2",
        label: "1 تا 2 لیوان",
      },
      {
        id: "3",
        label: "2 تا 5 لیوان",
      },
      {
        id: "4",
        label: "5 تا 8 لیوان",
      },
      {
        id: "5",
        label: "بیشتر از 8 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    label: "معمولا از چه نوع آبی برای نوشیدن استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "آب معدنی",
      },
      {
        id: "3",
        label: "اب لوله کشی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    label: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "آبمیوه صنعتی",
      },
      {
        id: "3",
        label: "آبمیوه طبیعی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    label: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "چای مصرف نمی کنم" },
      {
        id: "2",
        label: "1 تا 2 عدد",
      },
      {
        id: "3",
        label: "3 تا 4 عدد",
      },
      {
        id: "4",
        label: "5 عدد یا بیشتر",
      },
      {
        id: "5",
        label: "از قند یا پولکی برای صرف چای استفاده نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    label: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم چرب ( کمتر از 2 درصد چربی)",
      },
      {
        id: "2",
        label: "بین 2 تا 2.5 درصد چربی",
      },
      {
        id: "3",
        label: "محلی یا پرچرب (بیشتر از 2.5 درصد چربی)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (منظور سویا اضافه شده به غذا، آجیل سویا و شیرسویا می باشد)",
    id: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    label: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    label: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم نمک",
      },
      {
        id: "2",
        label: "با نمک متوسط",
      },
      {
        id: "3",
        label: "پرنمک",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    label: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "نمک ید دار",
      },
      {
        id: "2",
        label: "نمک دریا",
      },
      {
        id: "3",
        label: "نمک سنتی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    label: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هیچ یک",
      },
      {
        id: "2",
        label: "شام",
      },
      {
        id: "3",
        label: "ناهار",
      },
      {
        id: "4",
        label: "صبحانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا می توانید هر غذایی را بجوید؟",
    label: "آیا می توانید هر غذایی را بجوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بله مشکلی ندارم",
      },
      {
        id: "2",
        label: "فقط می توانم غذاهای خیلی نرم یا خمیری را بجوم",
      },
      {
        id: "3",
        label: "میتوانم غذاهای نسبتا سفت را نیز بجوم",
      },
      {
        id: "4",
        label: "هیچ غذایی را نمی توانم به خوبی بجوم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    label: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    label: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (حداکثر ۳ گزینه را می‌توانید انتخاب کنید)",
    id: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    label: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "تفلون" },
      { id: "2", label: "استیل" },
      { id: "3", label: "روی" },
      { id: "4", label: "چدنی" },
      { id: "5", label: "مسی" },
      { id: "6", label: "سرامیکی یا گرانیتی" },
      { id: "7", label: "سنگی" },
      { id: "8", label: "آلومینیومی" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    label: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بلی",
      },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    label: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    type: "checkbox",
    options: [
      { id: "1", label: "ملامینی" },
      { id: "2", label: "فلزی" },
      { id: "3", label: "چینی" },
      { id: "4", label: "گلی یا سفالی" },
      { id: "5", label: "پلاستیکی" },
      { id: "6", label: "شیشه ای" },
    ],
    validation: Yup.array().required("لطفا به سوال جواب دهید"),
  },
];

export const FFQVALIDATIONDEMOGRAPHICQUESTION = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: "",
    id: "سن",
    label: "سن",
    type: "number",
    validation: Yup.number(
      "لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(150, "لطفا سن خود را به درستی وارد نمایید")
      .min(20, "لطفا سن خود را به درستی وارد نمایید")
      .positive("لطفا سن خود را به درستی وارد نمایید")
      .integer(
        "لطفا زمان وارد شده را بدون اعشار و به صورت عدد صحیح وارد نمایید"
      ),
    placeholder: "مثلا : 32",
  },
  {
    subLabel: "",
    id: "وزن (کیلوگرم)",
    label: "وزن (کیلوگرم)",
    type: "number",
    validation: Yup.number(
      "لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(200, "لطفا وزن خود را به درستی وارد نمایید")
      .positive("لطفا وزن خود را به درستی وارد نمایید")
      .min(30, "لطفا وزن خود را به درستی وارد نمایید"),
    placeholder: "منظور وزن با حداقل لباس و بدون کفش می باشد",
  },
  {
    subLabel: "",
    id: "قد (برحسب سانتی متر) :",
    label: "قد (برحسب سانتی متر) :",
    type: "number",
    validation: Yup.number(
      "لطفا قد خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا قد خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .min(100, "لطفا قد خود را به درستی وارد نمایید")
      .max(250, "لطفا قد خود را به درستی وارد نمایید")
      .positive("لطفا قد خود را به درستی وارد نمایید")
      .integer(
        "لطفا زمان وارد شده را بدون اعشار و به صورت عدد صحیح وارد نمایید"
      ),
    placeholder: "قد بدون کفش وارد شود",
  },
  {
    subLabel: "",
    id: "جنسیت خود را مشخص نمایید",
    label: "جنسیت خود را مشخص نمایید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "زن",
      },
      {
        id: "2",
        label: "مرد",
      },
    ],
    validation: Yup.string().required("لطفا جنسیت را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت پدری خود را مشخص نمایید :",
    label: "قومیت پدری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت پدری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت مادری خود را مشخص نمایید :",
    label: "قومیت مادری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت مادری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "شغل خود را مشخص نمایید :",
    label: "شغل خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "کارمند" },
      { id: "2", label: "شغل آزاد" },
      { id: "3", label: "کارگر" },
      { id: "4", label: "بازنشسته" },
      { id: "5", label: "بازنشسته شاغل" },
      { id: "6", label: "خانه دار" },
      { id: "7", label: "بیکار" },
      { id: "8", label: "کشاورز" },
      { id: "9", label: "سایر شغل ها" },
    ],
    validation: Yup.string().required("لطفا شغل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت تاهل را مشخص نمایید :",
    label: "وضعیت تاهل را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "متاهل" },
      { id: "2", label: "مجرد" },
      { id: "3", label: "همسر فوت شده(بیوه)" },
      { id: "4", label: "همسر جداشده(مطلقه)" },
    ],
    validation: Yup.string().required("لطفا وضعیت تاهل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت خود را در خانواده مشخص نمایید :",
    label: "وضعیت خود را در خانواده مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "سرپرست خانواده" },
      { id: "2", label: "همسر سرپرست خانواده" },
      { id: "3", label: "فرزند" },
      { id: "4", label: "پدر و مادر سرپرست خانواده" },
      {
        id: "5",
        label: "پدر و مادر همسر سرپرست خانواده",
      },
      { id: "6", label: "سایر" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خود را در خانواده مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تعداد افراد خانواده شما (مثلا 4):",
    label: "تعداد افراد خانواده شما (مثلا 4):",
    type: "text",
    validation: Yup.string("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .required("وارد کردن تعداد افراد خانواده الزامی است")
      .max(2, "لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .matches(
        /^([0-9۰-۹]{1,2})$/g,
        "لطفا تعداد افراد خانواده خود را به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 4",
  },
  {
    subLabel: "",
    id: "تحصیلات خود را مشخص نمایید :",
    label: "تحصیلات خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "بی سواد" },
      { id: "2", label: "ابتدایی" },
      { id: "3", label: "راهنمایی" },
      { id: "4", label: "دبیرستان" },
      { id: "5", label: "دیپلم" },
      { id: "6", label: "فوق دیپلم" },
      { id: "7", label: "لیسانس" },
      { id: "8", label: "فوق لیسانس" },
      { id: "9", label: "دکتری" },
    ],
    validation: Yup.string().required("لطفا تحصیلات خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت محل سکونت خود را مشخص نمایید :",
    label: "وضعیت محل سکونت خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "مسکن شخصی" },
      { id: "2", label: "مسکن اجاره ای یا رهنی" },
      { id: "3", label: "مسکن سازمانی" },
      {
        id: "4",
        label: "در منزل خویشاوندان سکونت دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت محل سکونت خود را مشخص نمایید"
    ),
  },
  {
    subLabel: " (حداقل 1 و حداکثر 3 گزینه میتوانید انتخاب کنید)",
    id: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    label: "طی ده سال گذشته در کدام یک از شهر های استان اصفهان زندگی کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "اصفهان" },
      { id: "2", label: "کاشان" },
      { id: "3", label: "خمینی شهر" },
      { id: "4", label: "نجف آباد" },
      { id: "5", label: "لنجان" },
      { id: "6", label: "فلاورجان" },
      { id: "7", label: "شاهین شهر و میمه" },
      { id: "8", label: "شهرضا" },
      { id: "9", label: "مبارکه" },
      { id: "10", label: "برخوار" },
      { id: "11", label: "آران و بیدگل" },
      { id: "12", label: "گلپایگان" },
      { id: "13", label: "سمیرم" },
      { id: "14", label: "تیران" },
      { id: "15", label: "فریدن" },
      { id: "16", label: "نطنز" },
      { id: "17", label: "اردستان" },
      { id: "18", label: "نائین" },
      { id: "19", label: "جرقویه" },
      { id: "20", label: "فریدون شهر" },
      { id: "21", label: "دهاقان" },
      { id: "22", label: "خوانسار" },
      { id: "23", label: "چادگان" },
      { id: "24", label: "ورزنه" },
      { id: "25", label: "بوئین و میان دشت" },
      { id: "26", label: "کوهپایه" },
      { id: "27", label: "هرند" },
      { id: "28", label: "خور و بیابانک" },
      { id: "29", label: "سایر" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("لطفا سابقه سکونت خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "در صورتی که در شهر اصفهان زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    label:
      "در صورتی که در شهر اصفهان زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    type: "text",
    validation: Yup.string("محل سکونت خود را به درستی وارد نمایید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا منطقه زندگی خود را به درستی وارد نمایید"
      )
      .min(3, "لطفا منطقه زندگی خود را به درستی وارد نمایید"),
    placeholder:
      "می توانید یک یا بیش از یک منطقه را بنویسید مثلا سپاهان شهر، لاهور، بهارستان و ...",
  },
  {
    subLabel: "",
    id: "آیا خودرو شخصی دارید؟",
    label: "آیا خودرو شخصی دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله خودرو خارجی دارم" },
      { id: "3", label: "بله خودرو داخلی دارم" },
      {
        id: "4",
        label: "هر دو نوع خودرو داخلی و خارجی را دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خودرو شخصی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    label: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله (مسافرت زیارتی)" },
      { id: "3", label: "بله (مسافرت غیر زیارتی)" },
      {
        id: "4",
        label: "بله (مسافرت زیارتی و غیر زیارتی)",
      },
    ],
    validation: Yup.string().required("لطفا سابقه مسافرت را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "چند سال از تلفن همراه استفاده می کنید؟",
    label: "چند سال از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تلفن همراه ندارم" },
      { id: "2", label: "کمتر از 5 سال" },
      { id: "3", label: "بین 5 تا 10 سال" },
      { id: "4", label: "بین 10 تا 20 سال" },
      { id: "5", label: "بیشتر از 20 سال" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن را مشخص نمایید"
    ),
  },
  {
    subLabel: "(صحبت کردن، بازی کردن، چت کردن، استفاده از اینترنت و ...)",
    id: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    label: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تلفن همراه ندارم" },
      { id: "2", label: "کمتر از 1 ساعت" },
      { id: "3", label: "1 تا 2 ساعت" },
      { id: "4", label: "2 تا 3 ساعت" },
      { id: "5", label: "3 تا 4 ساعت" },
      { id: "6", label: "بیش از 4 ساعت" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن همراه را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    label: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و کودهای شیمیایی بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    label:
      "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کشت و کار در منطقه مسکونی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    label: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله، به صورت هفتگی" },
      { id: "3", label: "بله، به صورت ماهانه" },
      { id: "4", label: "بله، به صورت سالانه" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از  حشره کش ها و آفت کش ها را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    label: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و مواد شیمیایی قرار گرفتن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    label:
      "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    type: "text",
    validation: Yup.string(
      "لطفا فاصله منزلتان تا کارخانه صنعتی خود را به درستی وارد کنید"
    ).matches(/^([0-9۰-۹]{1,4})$/g, "لطفا فاصله را به درستی وارد نمایید"),
    placeholder: "مثلا: 20",
  },
  {
    subLabel: "",
    id: "آیا شما به هنگام آلودگی هوا از ماسک استفاده میکنید؟",
    label: "آیا شما به هنگام آلودگی هوا از ماسک استفاده میکنید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از ماسک به هنگام آلودگی را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "منبع گرمایشی شما در منزل چیست؟",
    label: "منبع گرمایشی شما در منزل چیست؟",
    type: "radio",
    options: [
      { id: "1", label: "بخاری گازی" },
      { id: "2", label: "پکیج یا شوفاژ" },
      { id: "3", label: "شومینه" },
    ],
    validation: Yup.string().required(
      "لطفا منبع گرمایشی منزلتان را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در آشپزخانه از هود یا دستگاه تهویه هوا استفاده می کنید؟",
    label: "آیا در آشپزخانه از هود یا دستگاه تهویه هوا استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از هود یا دستگاه تهویه هوا را مشخص نمایید"
    ),
  },
  {
    subLabel: "(حداقل یک گزینه باید انتخاب شود)",
    id: "در طول زندگی خود به کدامیک از بیماری های زیر مبتلا شده اید؟",
    label: "در طول زندگی خود به کدامیک از بیماری های زیر مبتلا شده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "دیابت" },
      { id: "2", label: "فشار خون بالا" },
      { id: "3", label: "سکته قلبی یا مغزی" },
      { id: "4", label: "سرطان" },
      { id: "5", label: "بیماری قلبی" },
      { id: "6", label: "مشکلات تیروئیدی" },
      { id: "7", label: "بیماری کلیوی" },
      { id: "8", label: "هپاتیت" },
      { id: "9", label: "سرطان کولون(روده)" },
      { id: "10", label: "سایر سرطان های گوارشی" },
      { id: "11", label: "سندروم روده تحریک پذیر(IBS)" },
      { id: "12", label: "ورم معده" },
      { id: "13", label: "پولیپ روده" },
      { id: "14", label: "بیماری التهابی روده (IBD)" },
      { id: "15", label: "سوزش سر دل یا رفلاکس" },
      { id: "16", label: "کبدچرب" },
      { id: "17", label: "میگرن" },
      { id: "18", label: "سنگ صفرا" },
      { id: "19", label: "سنگ کلیه" },
      { id: "20", label: "بیماری های روماتیسمی" },
      { id: "21", label: "زخم معده" },
      { id: "22", label: "کم خونی" },
      { id: "23", label: "چربی خون بالا" },
      { id: "هیچکدام", label: "هیچکدام" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "بیماری های دیگر:",
    label: "بیماری های دیگر:",
    type: "text",
    validation: Yup.string("لطفا نام بیماری را به درستی وارد کنید").matches(
      /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
      "لطفا نام بیماری خود را به درستی وارد نمایید"
    ),
    placeholder: "نام بیماری خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "در صورت ابتلا به سرطان، نوع آن را مشخص کنید:",
    label: "در صورت ابتلا به سرطان، نوع آن را مشخص کنید:",
    type: "text",
    validation: Yup.string("لطفا نوع سرطان را به درستی وارد کنید").matches(
      /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
      "لطفا نوع سرطان خود را به درستی وارد نمایید"
    ),
    placeholder: "نوع سرطان خود را وارد نمایید",
  },
  {
    subLabel: " (حداقل 1 و حداکثر 3 گزینه میتوانید انتخاب کنید)",
    id: "در اقوام درجه یک خود (پدر،مادر،فرزندان،خواهر، برادر)، سابقه ابتلا به کدامیک از بیماری های زیر وجود دارد؟",
    label:
      "در اقوام درجه یک خود (پدر،مادر،فرزندان،خواهر، برادر)، سابقه ابتلا به کدامیک از بیماری های زیر وجود دارد؟",
    type: "checkbox",
    options: [
      { id: "1", label: "دیابت" },
      { id: "2", label: "فشار خون بالا" },
      { id: "3", label: "سکته قلبی یا مغزی" },
      { id: "4", label: "سرطان" },
      { id: "5", label: "بیماری قلبی" },
      { id: "6", label: "مشکلات تیروئیدی" },
      { id: "7", label: "بیماری کلیوی" },
      { id: "8", label: "هپاتیت" },
      { id: "9", label: "سرطان کولون(روده)" },
      { id: "10", label: "سایر سرطان های گوارشی" },
      { id: "11", label: "سندروم روده تحریک پذیر(IBS)" },
      { id: "12", label: "ورم معده" },
      { id: "13", label: "پولیپ روده" },
      { id: "14", label: "بیماری التهابی روده (IBD)" },
      { id: "15", label: "سوزش سر دل یا رفلاکس" },
      { id: "16", label: "کبدچرب" },
      { id: "17", label: "میگرن" },
      { id: "18", label: "سنگ صفرا" },
      { id: "19", label: "سنگ کلیه" },
      { id: "20", label: "بیماری های روماتیسمی" },
      { id: "21", label: "زخم معده" },
      { id: "22", label: "کم خونی" },
      { id: "23", label: "چربی خون بالا" },
      { id: "هیچکدام", label: "هیچکدام" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: " (حداقل 1 و حداکثر 3 گزینه میتوانید انتخاب کنید)",
    id: "در اقوام درجه 2 خود (عمه، خاله،عمو، دایی ،پدر بزرگ،مادر بزرگ)، سابقه ابتلا به کدامیک از بیماری های زیر وجود دارد؟",
    label:
      "در اقوام درجه 2 خود (عمه، خاله،عمو، دایی ،پدر بزرگ،مادر بزرگ)، سابقه ابتلا به کدامیک از بیماری های زیر وجود دارد؟",
    type: "checkbox",
    options: [
      { id: "1", label: "دیابت" },
      { id: "2", label: "فشار خون بالا" },
      { id: "3", label: "سکته قلبی یا مغزی" },
      { id: "4", label: "سرطان" },
      { id: "5", label: "بیماری قلبی" },
      { id: "6", label: "مشکلات تیروئیدی" },
      { id: "7", label: "بیماری کلیوی" },
      { id: "8", label: "هپاتیت" },
      { id: "9", label: "سرطان کولون(روده)" },
      { id: "10", label: "سایر سرطان های گوارشی" },
      { id: "11", label: "سندروم روده تحریک پذیر(IBS)" },
      { id: "12", label: "ورم معده" },
      { id: "13", label: "پولیپ روده" },
      { id: "14", label: "بیماری التهابی روده (IBD)" },
      { id: "15", label: "سوزش سر دل یا رفلاکس" },
      { id: "16", label: "کبدچرب" },
      { id: "17", label: "میگرن" },
      { id: "18", label: "سنگ صفرا" },
      { id: "19", label: "سنگ کلیه" },
      { id: "20", label: "بیماری های روماتیسمی" },
      { id: "21", label: "زخم معده" },
      { id: "22", label: "کم خونی" },
      { id: "23", label: "چربی خون بالا" },
      { id: "هیچکدام", label: "هیچکدام" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    label:
      "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به صورت مرتب ",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات ",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف قرص ویتامین دی را مشخص نمایید"
    ),
  },
  {
    subLabel: "حداقل 1 گزینه و حداکثر 6 گزینه را میتوانید انتخاب کنید",
    id: "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    label:
      "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "مولتی ویتامین" },
      { id: "2", label: "مولتی ویتامین مینرال" },
      { id: "3", label: "کلسیم ویتامین دی" },
      { id: "4", label: "کلسیم" },
      {
        id: "5",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "6", label: "فولیک اسید" },
      { id: "7", label: "امگا 3" },
      { id: "8", label: "روی یا زینک" },
      { id: "9", label: "ویتامین ای (E)" },
      {
        id: "10",
        label: "سایر ویتامین ها",
      },
      {
        id: "11",
        label: "پروبیوتیک",
      },
      {
        id: "12",
        label: "نفروویت",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
      {
        id: "13",
        label: "سایر",
      },
    ],
    validation: Yup.array()
      .required(
        "لطفا سابقه مصرف مکمل ویتامین و یا مواد معدنی خود را مشخص نمایید "
      )
      .max(6, "حداکثر مجاز به انتخاب 6 گزینه می باشید"),
  },
  {
    subLabel: "",
    id: "سایر مکمل ها، ویتامین یا مواد معدنی",
    label: "سایر مکمل ها، ویتامین یا مواد معدنی",
    type: "text",
    validation: Yup.string("لطفا نام مکمل را به درستی وارد کنید"),
    placeholder: "نام سایر مکمل را اینجا وارد نمایید ",
  },
  {
    subLabel: "",
    id: "در طول سال گذشته کدامیک از دارو های زیر را به طور معمول مصرف کرده اید؟ ",
    label:
      "در طول سال گذشته کدامیک از دارو های زیر را به طور معمول مصرف کرده اید؟ ",
    type: "checkbox",
    options: [
      { id: "1", label: "داروهای کاهنده قند خون (متفورمین و ...)" },
      { id: "2", label: "انسولین" },
      { id: "3", label: "داروی کاهنده چربی خون" },
      { id: "4", label: "داروی کاهنده فشارخون (کاپتوپریل و ...)" },
      {
        id: "5",
        label: "آنتی اسید ها (شربت معده، قرص معده، امپرازول وپنتوپرازول و...)",
      },
      { id: "6", label: "پروپرانول (ایندرال)" },
      { id: "7", label: "آسپیرین (ASA)" },
      { id: "8", label: "داروهای مسکن و ضد درد" },
      { id: "9", label: "داروهای آرامبخش یا خواب آور (دیازپام و ...)" },
      {
        id: "10",
        label: "داورهای ضدصرع یا ضد تشنج",
      },
      {
        id: "11",
        label: "سایر",
      },
      {
        id: "هیچکدام",
        label: "هیچ دارویی در یک سال پیش مصرف نکردم.",
      },
    ],
    validation: Yup.array()
      .required("لطفا سابقه مصرف دارویی خود را مشخص نمایید ")
      .max(6, "حداکثر مجاز به انتخاب 6 گزینه می باشید"),
  },
  {
    subLabel: "",
    id: "سایر داروها:",
    label: "سایر داروها:",
    type: "text",
    validation: Yup.string("لطفا نام دارو را به درستی وارد کنید"),
    placeholder: "نام سایر داروها را اینجا وارد نمایید ",
  },
  {
    subLabel: "",
    id: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    label: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    type: "checkbox",
    options: [
      {
        id: "1",
        label: "از دست دادن پدر، مادر یا فرزندان",
      },
      {
        id: "2",
        label: "ابتلا نزدیکان به بیماری های لاعلاج",
      },
      {
        id: "3",
        label: "طلاق",
      },
      {
        id: "4",
        label: "ترس یا غم های بزرگ دیگری داشتم",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
    ],
    validation: Yup.array().required("لطفا به سوال پاسخ دهید"),
  },
  {
    subLabel: "",
    id: "وضعیت سیگار کشیدن",
    label: "وضعیت سیگار کشیدن",
    type: "radio",
    options: [
      { id: "1", label: "در حال حاضر سیگاری هستم" },
      {
        id: "2",
        label: "قبلا سیگاری بودم و ترک کردم",
      },
      {
        id: "3",
        label: "تاکنون سیگار نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت سیگار کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا از قلیان استفاده می کنید؟",
    label: "آیا از قلیان استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "در حال حاضر استفاده می کنم" },
      {
        id: "2",
        label: "قبلا استفاده می کردم و ترک کردم",
      },
      {
        id: "3",
        label: "تاکنون قلیان نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت قلیان کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در صورتی که سیگاری یا قلیانی نیستید، ایا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    label:
      "در صورتی که سیگاری یا قلیانی نیستید، ایا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، خیلی کم",
      },
      {
        id: "3",
        label: "بله، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله، خیلی زیاد",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض دود سیگار یا قلیان بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    label: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "3",
        label: "بله ، به صورت هفتگی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    label: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به صورت تزریقی",
      },
      {
        id: "3",
        label: "بله، به صورت خوراکی",
      },
      {
        id: "4",
        label: "بله، به صورت استنشاقی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "روزانه چند ساعت می خوابید؟",
    label: "روزانه چند ساعت می خوابید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از 6 ساعت" },
      {
        id: "2",
        label: "6 تا 8 ساعت",
      },
      {
        id: "3",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت خواب خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 10" },
      {
        id: "2",
        label: "بین 10 تا 12",
      },
      {
        id: "3",
        label: "بعد از ساعت 12",
      },
      {
        id: "4",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "بعد از رفتن به رختخواب، چقدر طول می کشد تا خوابتان ببرد؟",
    label: "بعد از رفتن به رختخواب، چقدر طول می کشد تا خوابتان ببرد؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از 10 دقیقه" },
      {
        id: "2",
        label: "10 تا 20 دقیقه",
      },
      {
        id: "3",
        label: "20 تا 30 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 30 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به این سوال پایخ دهید"),
  },
  {
    subLabel: "",
    id: "در طی ماه گذشته ، چندبار برای بخواب رفتن مجبور به استفاده از دارو شده اید؟ ",
    label:
      "در طی ماه گذشته ، چندبار برای بخواب رفتن مجبور به استفاده از دارو شده اید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "هیچ" },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "یکبار در هفته",
      },
      {
        id: "4",
        label: "2 تا 3 بار در هفته",
      },
      {
        id: "5",
        label: "بیش از 3 بار در هفته یا روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به این سوال پایخ دهید"),
  },
  {
    subLabel: "",
    id: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    label: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 6" },
      {
        id: "2",
        label: "بین 6 تا 8",
      },
      {
        id: "3",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور فاصله بین ناهار تا شام است)",
    id: "آیا در طول روز نیز می خوابید؟",
    label: "آیا در طول روز نیز می خوابید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، کمتر از یک ساعت",
      },
      {
        id: "3",
        label: "بلی، بیشتر از یک ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب در طول روز را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در طول یک سال گذشته، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده اید؟",
    label:
      "در طول یک سال گذشته، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، خیلی کم",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت یبوست طولانی مدت را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در طول یک سال گذشته، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده اید؟",
    label:
      "در طول یک سال گذشته، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به ندرت",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت اسهال طولانی مدت را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در 3 ماه اخیر، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن مشاهده کرده اید؟",
    label:
      "در 3 ماه اخیر، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن مشاهده کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به ندرت",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مشاهده خون در مدفوع را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در طول یک سال گذشته، آیا در مدفوع خود خون مشاهده کرده اید؟",
    label: "در طول یک سال گذشته، آیا در مدفوع خود خون مشاهده کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، به ندرت",
      },
      {
        id: "3",
        label: "بله ، کاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کم خونی را قبل از ابتلا مشخص نمایید"
    ),
  },

  {
    subLabel: "  (او پی جی و ...)",
    id: "تاکنون چند مرتبه از دندان های شما عکس برداری شده است؟",
    label: "تاکنون چند مرتبه از دندان های شما عکس برداری شده است؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا انجام نداده بودم" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت عکس برداری از دندان هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تاکنون چند بار ام آر آی یا سی تی اسکن داده اید؟",
    label: "تاکنون چند بار ام آر آی یا سی تی اسکن داده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا انجام نداده بودم" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  ام آر آی یا سی تی اسکن  را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    label: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا انجام نداده بودم" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت سونوگرافی از اندام هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel:
      " (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    id: "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    label:
      "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "بیش از 4 بار در هفته",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت انجام ورزش شدید را مشخص نمایید"
    ),
  },
  {
    subLabel: "(درصورتی که ورزش شدید انجام نمی دهید عددی وارد نکنید)",
    id: "56",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    label:
      "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "4-6 بار در هفته",
      },
      {
        id: "6",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ورزش با شدت متوسط را مشخص نمایید"
    ),
  },
  {
    subLabel: "(درصورتی که ورزش متوسط انجام نمی دهید عددی وارد نکنید)",
    id: "57",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "58",
    label: "به طور روزانه، چند ساعت از زمان شما صرف نشستن می شود؟",
    type: "time",
    validation: Yup.string(
      "لطفا زمان نشستن با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 2",
  },
  {
    subLabel:
      " (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی کم افزایش دهد یا افزایش ندهد)",
    id: "59",
    label:
      "به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شود؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت فعالیت بدنی خفیف با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 1",
  },
  {
    type: "description",
    description:
      "در زیر، تعداد 8 سوال برای ارزیابی کیفیت زندگی شما وجود دارد. با توجه به هر سوال، بهترین گزینه ای که نشان دهنده وضعیت شما باشد را انتخاب کنید.",
  },
  {
    subLabel: "",
    id: "QOL1",
    label: "کیفیت زندگی خود ر ا چگونه ارزیابی میکنید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL2",
    label: "چقدر از سلامتی خود راضی هستید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL3",
    label: "آیا شما انرژی کافی برای زندگی روزمره دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL4",
    label: "چقدر از توانایی انجام کارهای روزمره خود راضی هستید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL5",
    label: "چقدر از خودتان راضی هستید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL6",
    label: "چقدر از ارتباطات خودتان راضی هستید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL7",
    label: "آیا پول کافی برای رفع نیاز های خودتان دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "QOL8",
    label: "چقدر از شرایط محل زندگی خودتان رضایت دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیلی ناراضی" },
      {
        id: "2",
        label: "ناراضی",
      },
      {
        id: "3",
        label: "نظری ندارم",
      },
      {
        id: "4",
        label: "راضی",
      },
      {
        id: "5",
        label: "خیلی راضی",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    description:
      "در زیر، جملاتی برای ارزیابی وضعیت استرس شما طراحی شده است. لطفا هر یک از جملات را با دقت بخوانید و سپس بهترین گزینه ای که نشان دهنده وضعیت شما باشد را انتخاب کنید.",
    type: "description",
  },
  {
    subLabel: "",
    id: "DASS21-1",
    label: "برای من مشکل است که آرام بگیرم (آرام و قرار ندارم).",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-2",
    label: "گاهی اوقات متوجه می شوم که دهانم بیش از حد خشک می شود.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-3",
    label: "فکر می کنم نتوانم هیچ نوع احساس خوبی را تجربه کنم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-4",
    label: "گاهی اوقات تنفس کردن برای من مشکل می شود.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-5",
    label: "برای من سخت است که در انجام کارها پیشقدم شوم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-6",
    label: "به موقعیت های پراسترس یا شاد بیش از حد واکنش نشان میدهم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-7",
    label: "گاهی اوقات در بدنم احساس لرزش می کنم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-8",
    label: "احساس میکنم انرژی روانی زیادی مصرف می کنم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-9",
    label:
      "نگرانم مبادا در بعضی موقعیت ها دچار ترس شوم یا به کار احمقانه ای دست بزنم. ",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-10",
    label: "احساس میکنم چیزی ندارم که منتظر آن باشم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-11",
    label: "خودم را پریشان و سردرگم احساس میکنم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-12",
    label: "آرام بودن و در آرامش به سربردن برای من مشکل است.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-13",
    label: "احساس دل مردگی و دل شکستگی دارم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-14",
    label: "نسبت به هرچیزی که مرا از کار باز دارد بی تحمل هستم و صبرندارم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-15",
    label: "احساس میکنم هر لحظه ممکن است دچار ترس و وحشت شوم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-16",
    label: "قادر نیستم درباره خیلی چیزها شور و شوق از خود نشان دهم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-17",
    label: "احساس میکنم به عنوان یک فرد ارزش زیادی ندارم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-18",
    label: "فکرمیکنم بسیار حساس و زودرنج هستم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-19",
    label:
      "گاهی اوقات بدون آنکه هیچگونه فعالیت بدنی انجام بدهم متوجه شده ام که قلبم غیرعادی کار میکند",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-20",
    label: "بدون دلیل موجهی، احساس ترس میکنم.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "DASS21-21",
    label: "احساس میکنم زندگی ام بی معناست.",
    type: "radio",
    options: [
      { id: "1", label: "اصلا" },
      {
        id: "2",
        label: "کم",
      },
      {
        id: "3",
        label: "زیاد",
      },
      {
        id: "4",
        label: "خیلی زیاد",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
];

export const FFQVALIDATIONHABIT = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل)",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: " (میان وعده ها را درنظر نگیرید)",
    id: "روزانه چند وعده غذایی اصلی می خورید؟",
    label: "روزانه چند وعده غذایی اصلی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "1 وعده" },
      {
        id: "2",
        label: "2 وعده",
      },
      {
        id: "3",
        label: "3 وعده",
      },
      {
        id: "4",
        label: "4 وعده",
      },
      {
        id: "5",
        label: "5 وعده یا بیشتر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف وعده غذایی را مشخص نمایید"
    ),
  },
  {
    subLabel:
      " (منظور خوردن هر چیزی خارج از وعده های غذایی است، مثلا خوردن یک سیب یا یک تکه کیک، یا یک لیوان شیر یا یک شکلات یا …)",
    id: "روزانه چند میان وعده دارید؟ ",
    label: "روزانه چند میان وعده دارید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "1 تا 2 میان وعده",
      },
      {
        id: "3",
        label: "3 تا 5 میان وعده",
      },
      {
        id: "4",
        label: "بیشتر از 5 میان وعده",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف میان وعده را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    label: "حجیم ترین وعده غذایی شما در طی روز کدام وعده است؟",
    type: "radio",
    options: [
      { id: "1", label: "صبحانه" },
      {
        id: "2",
        label: "ناهار",
      },
      {
        id: "3",
        label: "عصرانه",
      },
      {
        id: "4",
        label: "شام",
      },
    ],
    validation: Yup.string().required("لطفا حجیم ترین وعده را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    label: "در هنگام غذا خوردن، جویدن هر لقمه چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "کم (کمتر از 20 ثانیه)" },
      {
        id: "2",
        label: "متوسط (بین 20 تا 40 ثانیه)",
      },
      {
        id: "3",
        label: "زیاد (بیش از 40 ثانیه)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    label: "معمولا ناهار خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "ناهار نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شام خوردن شما چقدر طول می کشد؟",
    label: "معمولا شام خوردن شما چقدر طول می کشد؟",
    type: "radio",
    options: [
      { id: "1", label: "شام نمی خورم" },
      {
        id: "2",
        label: "کمتر از 10 دقیقه",
      },
      {
        id: "3",
        label: "20-10 دقیقه",
      },
      {
        id: "4",
        label: "بیشتر از 20 دقیقه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    label: "معمولا فاصله زمانی بعد از ناهار خوردن تا دراز کشیدنتان چقدر است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "دراز نمی کشم",
      },
      { id: "2", label: "کمتر از نیم ساعت" },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "4-2 ساعت",
      },
      {
        id: "5",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    label: "معمولا چه مدت بعد از خوردن شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از نیم ساعت" },
      {
        id: "2",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "3",
        label: "4-2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 4 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثلا خوردن یک میوه یا یک لیوان چای) ",
    id: "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    label:
      "معمولا چه مدت بعد از خوردن آخرین میان وعده بعد از شام به رختخواب می روید؟",
    type: "radio",
    options: [
      { id: "1", label: "میان وعده نمی خورم" },
      {
        id: "2",
        label: "کمتر از نیم ساعت",
      },
      {
        id: "3",
        label: "نیم تا 2 ساعت",
      },
      {
        id: "4",
        label: "بیشتر از 2 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چند روز در هفته صبحانه می خورید؟",
    label: "چند روز در هفته صبحانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    label:
      "معمولا چند روز در هفته، صبحانه شما را فقط مایعات (چای یا شیر) تشکیل می دهد؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته ناهار می خورید؟",
    label: "معمولا چند روز در هفته ناهار می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (شام های سبک را نیز درنظر بگیرید)",
    id: "معمولا چند روز در هفته شام می خورید؟",
    label: "معمولا چند روز در هفته شام می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چند روز در هفته عصرانه می خورید؟",
    label: "معمولا چند روز در هفته عصرانه می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز یا 1 روز در هفته" },
      {
        id: "2",
        label: "2 تا 4 روز در هفته",
      },
      {
        id: "3",
        label: "5 تا 6 روز در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    label:
      "آیا همراه غذای خود یا بلافاصله قبل و بعد از آن، مایعات (آب، نوشابه، دوغ، دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    label:
      "معمولا همراه غذای خود، چه میزان مایعات (آب، نوشابه، دوغ یا دلستر) می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "1 لیوان یا کمتر",
      },
      {
        id: "3",
        label: "3-2 لیوان",
      },
      {
        id: "4",
        label: "بیش از 3 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    label:
      "معمولا دمای مایعاتی که هنگام ناهار یا شام یا بعد از آن می نوشید چگونه است؟",
    type: "radio",
    options: [
      { id: "1", label: "معمولی" },
      {
        id: "2",
        label: "سرد",
      },
      {
        id: "3",
        label: "خیلی سرد",
      },
      {
        id: "4",
        label: "در این زمان ها مایعات مصرف نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    label: "آیا قبل از پختن گوشت مرغ، پوست آن را جدا می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ وقت" },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    label: "معمولا هفته ای چندبار از غذاهای سرخ کردنی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تقریبا هرگز" },
      {
        id: "2",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "3",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "4",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    label: "معمولا از چه روغنی برای سرخ کردن مواد غذایی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "روغن مخصوص سرخ کردن" },
      {
        id: "2",
        label: "روغن مایع معمولی",
      },
      {
        id: "3",
        label: "روغن نباتی جامد",
      },
      {
        id: "4",
        label: "کره یا مارگارین",
      },
      {
        id: "5",
        label: "روغن زیتون",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    label: "آیا از روغن مانده پس از سرخ کردن مجدد استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    label:
      "اگر غذایی مانند رب، ترشی، آبغوره و سرکه کپک زده باشد، قسمت کپک زده را برداشته و بقیه را مصرف می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "بلی" },
      {
        id: "2",
        label: "همه را دور می ریزم",
      },
      {
        id: "3",
        label: "تاکنون با چنین موردی مواجه نشدم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    label: "هرچند وقت یکبار از غذای کبابی استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "کمتر از یک بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "4",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "5",
        label: "4 تا 6 بار در هفته",
      },
      {
        id: "6",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (مثل برنج دودی، ماهی دودی، بادمجان دودی و …)",
    id: "آیا شما از غذای دودی استفاده می کنید؟",
    label: "آیا شما از غذای دودی استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 3 بار در هفته",
      },
      {
        id: "4",
        label: "5 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "روزانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "روزانه چند لیوان آب می نوشید؟",
    label: "روزانه چند لیوان آب می نوشید؟",
    type: "radio",
    options: [
      { id: "1", label: "صفر" },
      {
        id: "2",
        label: "1 تا 2 لیوان",
      },
      {
        id: "3",
        label: "2 تا 5 لیوان",
      },
      {
        id: "4",
        label: "5 تا 8 لیوان",
      },
      {
        id: "5",
        label: "بیشتر از 8 لیوان",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    label: "معمولا از چه نوع آبمیوه ای استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "مصرف نمی کنم" },
      {
        id: "2",
        label: "آبمیوه صنعتی",
      },
      {
        id: "3",
        label: "آبمیوه طبیعی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    label: "معمولا با هر استکان چای چند حبه قند یا پولکی می خورید؟",
    type: "radio",
    options: [
      { id: "1", label: "چای مصرف نمی کنم" },
      {
        id: "2",
        label: "1 تا 2 عدد",
      },
      {
        id: "3",
        label: "3 تا 4 عدد",
      },
      {
        id: "4",
        label: "5 عدد یا بیشتر",
      },
      {
        id: "5",
        label: "از قند یا پولکی برای صرف چای استفاده نمی کنم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    label: "معمولا شیر یا ماست مصرفی شما از کدام نوع است؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم چرب ( کمتر از 2 درصد چربی)",
      },
      {
        id: "2",
        label: "بین 2 تا 2.5 درصد چربی",
      },
      {
        id: "3",
        label: "محلی یا پرچرب (بیشتر از 2.5 درصد چربی)",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (منظور سویا اضافه شده به غذا، آجیل سویا و شیرسویا می باشد)",
    id: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از سویا در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    label: "معمولا چقدر از پیه یا دنبه در برنامه غذایی خود استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "1 تا 3 بار در ماه",
      },
      {
        id: "3",
        label: "1 تا 2 بار در هفته",
      },
      {
        id: "4",
        label: "3 تا 6 بار در هفته",
      },
      {
        id: "5",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    label: "آیا سر سفره، به غذای خود نمک اضافه می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هرگز",
      },
      {
        id: "2",
        label: "گاهی",
      },
      {
        id: "3",
        label: "اغلب",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    label: "به طور کلی، غذای خود را چگونه مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "کم نمک",
      },
      {
        id: "2",
        label: "با نمک متوسط",
      },
      {
        id: "3",
        label: "پرنمک",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    label: "از کدام نوع نمک برای پخت غذا یا سر سفره استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "نمک ید دار",
      },
      {
        id: "2",
        label: "نمک دریا",
      },
      {
        id: "3",
        label: "نمک سنتی",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    label: "بیشتر بعد از خوردن کدام وعده غذایی دچار مشکلات گوارشی می شوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "هیچ یک",
      },
      {
        id: "2",
        label: "شام",
      },
      {
        id: "3",
        label: "ناهار",
      },
      {
        id: "4",
        label: "صبحانه",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا می توانید هر غذایی را بجوید؟",
    label: "آیا می توانید هر غذایی را بجوید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بله مشکلی ندارم",
      },
      {
        id: "2",
        label: "فقط می توانم غذاهای خیلی نرم یا خمیری را بجوم",
      },
      {
        id: "3",
        label: "میتوانم غذاهای نسبتا سفت را نیز بجوم",
      },
      {
        id: "4",
        label: "هیچ غذایی را نمی توانم به خوبی بجوم",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    label: "چای یا قهوه را معمولا با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    label: "سوپ، آش، خورشت ها و سایر غذاهای ابکی را با چه دمایی مصرف می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "مصرف نمی کنم",
      },
      {
        id: "2",
        label: "داغ",
      },
      {
        id: "3",
        label: "ولرم",
      },
      {
        id: "4",
        label: "سرد",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: " (حداکثر ۳ گزینه را می‌توانید انتخاب کنید)",
    id: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    label: "از چه ظروفی برای پخت و پز معمولا استفاده می کنید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "تفلون" },
      { id: "2", label: "استیل" },
      { id: "3", label: "روی" },
      { id: "4", label: "چدنی" },
      { id: "5", label: "مسی" },
      { id: "6", label: "سرامیکی یا گرانیتی" },
      { id: "7", label: "سنگی" },
      { id: "8", label: "آلومینیومی" },
    ],
    validation: Yup.array()
      .max(3, "حداکثر مجاز به انتخاب 3 ظرف هستید")
      .required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    label: "آیا از ظروف تفلون که سطح آنها خراش دار است استفاده می کنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بلی",
      },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا به سوال جواب دهید"),
  },
  {
    subLabel: "",
    id: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    label: "غذا معمولا در چه نوع ظروفی مصرف می شود؟",
    type: "checkbox",
    options: [
      { id: "1", label: "ملامینی" },
      { id: "2", label: "فلزی" },
      { id: "3", label: "چینی" },
      { id: "4", label: "گلی یا سفالی" },
      { id: "5", label: "پلاستیکی" },
      { id: "6", label: "شیشه ای" },
    ],
    validation: Yup.array().required("لطفا به سوال جواب دهید"),
  },
  {
    type: "description",
    description:
      "در زیر، جملاتی برای ارزیابی وضعیت اشتها و رفتارهای غذایی شما طراحی شده است. لطفا هر یک از جملات را با دقت بخوانید و سپس بهترین گزینه ای که نشان دهنده وضعیت شما باشد را انتخاب کنید.",
  },
  {
    subLabel: "",
    id: "TFEQ-1",
    label:
      "وقتی بوی غذای لذیذی  را حس میکنم ، حتی اگر گرسنه نباشم اجتناب از خوردن غذا برایم دشوار است.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-2",
    label: "من عمدا از مصرف وعده های غذایی کوچک برای کنترل وزن استفاده میکنم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-3",
    label: " وقتی مضطرب و نگران هستم، میخواهم غذا بخورم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-4",
    label:
      "وقتی شروع به غذاخوردن میکنم، نمی توانم به راحتی از غذا خوردن دست بکشم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-5",
    label:
      "دیدن فردی که در حال غذا خوردن است باعث میشود، من هم احساس گرسنگی کنم. ",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-6",
    label: "وقتی احساس ناراحتی می کنم، اغلب پرخوری می کنم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-7",
    label:
      "وقتی یک غذای لذیذ می بینم، آنقدر احساس گرسنگی میکنم که باید فورا غذا بخورم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-8",
    label:
      "آنقدر گرسنه می شوم که فکر می کنم معده من گودالی است که اصلا پر نمی شود",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-9",
    label:
      "من همیشه احساس گرسنگی میکنم و تا تمام شدن کامل غذای بشقابم به غذاخوردن ادامه می دهم (حتی اگر سیر شده باشم)",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-10",
    label: "وقتی احساس تنهایی می کنم با خوردن غذا به خودم آرامش می دهم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-11",
    label:
      "من آگاهانه از غذا خوردن  بیش از حد در وعده های غذایی پرهیز میکنم تا اضافه وزن پیدا نکنم. ",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-12",
    label:
      "من از خوردن بعضی غذا ها اجتناب میکنم، چون باعث اضافه وزن من میشوند.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-13",
    label: "من همیشه به قدری گرسنه هستم که میتوانم در هر زمانی غذا بخورم.",
    type: "radio",
    options: [
      { id: "1", label: "کاملا غلط" },
      {
        id: "2",
        label: "تقریبا غلط",
      },
      {
        id: "3",
        label: "تقریبا درست",
      },
      {
        id: "4",
        label: "کاملا درست",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-14",
    label: "هر چند وقت یکبار با وجود احساس سیری شروع به غذاخوردن می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "گاهی اوقات",
      },
      {
        id: "3",
        label: "اغلب اوقات",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-15",
    label: "هر چند وقت یکبار از تهیه غذاهای وسوسه انگیز اجتناب می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "گاهی اوقات",
      },
      {
        id: "3",
        label: "اغلب اوقات",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-16",
    label: "آیا ممکن است آگاهانه کمتر از مقداری که میخواهید غذا  بخورید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "گاهی اوقات",
      },
      {
        id: "3",
        label: "اغلب اوقات",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-17",
    label: "آیا با وجود اینکه گرسنه نیستید به پرخوری ادامه می دهید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "گاهی اوقات",
      },
      {
        id: "3",
        label: "اغلب اوقات",
      },
      {
        id: "4",
        label: "همیشه",
      },
    ],
    validation: Yup.string().required("پاسخ به این سوال اجباری می باشد"),
  },
  {
    subLabel: "",
    id: "TFEQ-18",
    label:
      "در مقیاس 1 تا 8، که در آن 1 به معنای عدم محدودیت در غذا خوردن و 8 به معنای محدودیت کامل است، چه عددی را به خود می دهید؟",
    type: "number",
    validation: Yup.number("لطفا با کیبورد انگلیسی و به درستی وارد کنید")
      .integer("لطفا بدون اعشار و به صورت عدد صحیح وارد نمایید")
      .min(1, "عدد وارد شده باید بین 1 تا 8 باشد")
      .max(8, "عدد وارد شده باید بین 1 تا 8 باشد"),
    placeholder: "عدد مورد نظر را اینجا وارد نمایید",
  },
];

export const LORESTANFFQ = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل)",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    type: "description",
    description:
      "هر یک از غذاهای زیر را در طول یک سال گذشته به چه میزانی مصرف کردید؟",
  },
  {
    serving: "یک بشقاب غذاخوری",
    img: "./Image/برنج استامبلی.jpg",
    subLabel:
      "(شوید پلو، عدس پلو، لوبیا پلو، دمپختک، باقالی پلو، استانبولی و...)",
    id: "قاطی پلو",
    label: "قاطی پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب غذا خوری",
    img: "./Image/برنج سفید.jpg",
    subLabel:
      "برنجی که همراه با خورشت ها، مرغ، ماهی، کبابی جات و … استفاده می شود. ",
    id: "برنج یا زرشک پلو",
    label: "برنج یا زرشک پلو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بشقاب غذاخوری",
    img: "./Image/ماکارونی.jpg",
    subLabel: "",
    id: "ماکارونی، لازانیا، نودل و پاستا",
    label: "ماکارونی، لازانیا، نودل و پاستا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قرمه سبزی.jpg",
    subLabel: "",
    id: "خورشت قورمه سبزی یا خورشت کرفس",
    label: "خورشت قورمه سبزی یا خورشت کرفس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت قیمه بادمجون.jpg",
    subLabel: "",
    id: "خورشت بادمجان یا قیمه بادمجان",
    label: "خورشت بادمجان یا قیمه بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/قیمه.jpg",
    subLabel: "",
    id: "خورشت قیمه (بدون بادمجان)",
    label: "خورشت قیمه (بدون بادمجان)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت فسنجون.jpg",
    subLabel: "",
    id: "خورشت فسنجان",
    label: "خورشت فسنجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خورشت قلیه ترش.jpg",
    subLabel: "",
    id: "خورشت قلیه ترش",
    label: "خورشت قلیه ترش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/کشک بادمجون.jpg",
    subLabel: "",
    id: "کشک بادمجان",
    label: "کشک بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک (پیاله)",
    img: "./Image/حلیم بادمجون.webp",
    subLabel: "",
    id: "حلیم بادمجان",
    label: "حلیم بادمجان",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه همراه با گوشت کوبیده",
    img: "./Image/آبگوشت و کوبیده.jpg",
    subLabel: "",
    id: "آبگوشت و تاس کباب",
    label: "آبگوشت و تاس کباب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کتلت یا شامی.jpg",
    subLabel: "یا هر نوع کوکویی که در آن از گوشت چرخ کرده استفاده شود .",
    id: "کتلت یا شامی",
    label: "کتلت یا شامی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ کباب کوبیده یا دو تکه کباب تابه ای",
    img: "./Image/کباب تابه ای.jpg",
    subLabel: "",
    id: "کباب تابه ای یا کباب کوبیده",
    label: "کباب تابه ای یا کباب کوبیده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ کبابی",
    img: "./Image/گله بریژ یا چنجه لری.jpg",
    subLabel: "",
    id: "گله بریژ یا چنجه لری",
    label: "گله بریژ یا چنجه لری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "قطعه 250 گرمی",
    img: "./Image/زیر برنجی لری.jpg",
    subLabel: "",
    id: "زیر برنجی لری",
    label: "زیر برنجی لری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ",
    img: "./Image/جوجه کباب.jpg",
    subLabel: "",
    id: "جوجه کباب و کتف و بال مرغ",
    label: "جوجه کباب و کتف و بال مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد ران مرغ یا نصف سینه مرغ",
    img: "./Image/زرشک پلو مرغ.jpg",
    subLabel: "",
    id: "خورشت مرغ، خوراک مرغ و تاس کباب مرغ",
    label: "خورشت مرغ، خوراک مرغ و تاس کباب مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "2 عدد ناگت یا 1 عدد فیله یا 1 تکه مرغ سوخاری",
    img: "./Image/فیله مرغ سوخاری (ناگت، مرغ سوخاری و فیله مرغ و...).jpg",
    subLabel: "",
    id: "ناگت، مرغ سوخاری و فیله مرغ",
    label: "ناگت، مرغ سوخاری و فیله مرغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه",
    img: "./Image/کله.jpg",
    subLabel: "",
    id: "کله پاچه",
    label: "کله پاچه (زبان، کله، پاچه و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ معادل 4 تکه جگر",
    img: "./Image/جگر و دل.jpg",
    subLabel: "",
    id: "جگر و دل و قلوه ",
    label: "جگر و دل و قلوه ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک سیخ کبابی",
    img: "./Image/جگروز.jpg",
    subLabel: "",
    id: "جگروز",
    label: "جگروز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی ",
    img: "./Image/خوراک لوبیا.jpg",
    subLabel: "",
    id: "خوراک لوبیا یا کنسرو لوبیا",
    label: "خوراک لوبیا یا کنسرو لوبیا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش شله قلمکار.jpg",
    subLabel: "",
    id: "آش شله قلمکار/آش آبادانی",
    label: "آش شله قلمکار/آش آبادانی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش رشته.jpg",
    subLabel: "",
    id: "آش رشته",
    label: "آش رشته",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش ترخینه.jpg",
    subLabel: "",
    id: "آش ترخینه",
    label: "آش ترخینه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش شله ماش.jpg",
    subLabel: "",
    id: "آش شله ماش",
    label: "آش شله ماش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش ماسوا.jpg",
    subLabel: "",
    id: "آش ماسوا",
    label: "آش ماسوا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش ورکواز.jpg",
    subLabel: "",
    id: "آش ورکواز",
    label: "آش ورکواز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش کنگر.jpg",
    subLabel: "",
    id: "آش کنگر",
    label: "آش کنگر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/آش دندونی.jpg",
    subLabel: "",
    id: "آش دندونی",
    label: "آش دندونی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/حلیم.jpg",
    subLabel: "",
    id: "حلیم",
    label: "حلیم",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/خوراک عدسی.jpg",
    subLabel: "",
    id: "عدسی",
    label: "عدسی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه یا بشقاب",
    img: "./Image/سوپ.jpg",
    subLabel: "سوپ مرغ، جو، سبزیجات و ... را درنظر بگیرید .",
    id: "سوپ ",
    label: "سوپ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه خورشتی",
    img: "./Image/سوپ پاغازه.jpg",
    subLabel: "",
    id: "سوپ پاغازه",
    label: "سوپ پاغازه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/الویه.jpg",
    subLabel: "",
    id: "الویه",
    label: "الویه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سبزی.jpg",
    subLabel: "",
    id: "کوکو سبزی",
    label: "کوکو سبزی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل سه عدد",
    img: "./Image/کوکو سیب زمینی.jpg",
    subLabel: "",
    id: "کوکو سیب زمینی",
    label: "کوکو سیب زمینی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "دو تکه مثلثی",
    img: "./Image/اسنک.jpg",
    subLabel: "",
    id: "اسنک",
    label: "اسنک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/ساندویچ فلافل.jpg",
    subLabel: "",
    id: "ساندویچ فلافل",
    label: "ساندویچ فلافل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/ساندویچ..jpg",
    subLabel: "",
    id: "انواع ساندویچ (سوسیس، کالباس، همبرگر، بندری، هات داگ، ژامبون و …)",
    label: "انواع ساندویچ (سوسیس، کالباس، همبرگر، بندری، هات داگ، ژامبون و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیتزای کوچک معادل 6 اسلایس",
    img: "./Image/پیتزا.jpg",
    subLabel: "",
    id: "انواع پیتزا",
    label: "انواع پیتزا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد کوچک یا 2 برش",
    img: "./Image/سوسیس.jpg",
    subLabel: "غیر از موارد استفاده شده در ساندویج و فست فود",
    id: "انواع سوسیس و کالباس",
    label: "انواع سوسیس و کالباس",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی",
    img: "./Image/تن ماهی.jpg",
    subLabel: "",
    id: "تن ماهی",
    label: "تن ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/ماهی.jpg",
    subLabel: "تن ماهی را در نظر نگیرید .",
    id: "ماهی",
    label: "ماهی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/املت.jpg",
    subLabel: "ترکیب تخم مرغ و گوجه فرنگی",
    id: "املت",
    label: "املت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/تخم مرغ آبپز.jpg",
    subLabel: "",
    id: "تخم مرغ (آب پز یا نیمرو)",
    label: "تخم مرغ (آب پز یا نیمرو)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سالاد کلم و کاهو.jpg",
    subLabel: "",
    id: "سالاد فصل (حاوی کاهو، کلم و …)",
    label: "سالاد فصل (حاوی کاهو، کلم و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/سالاد شیرازی.jpg",
    subLabel: "",
    id: "سالاد شیرازی",
    label: "سالاد شیرازی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه یا یک کف دست",
    img: "./Image/نان جو رژیمی .jpg",
    subLabel: "",
    id: "78",
    label: "نان رژیمی (نان سبوس دار، هفت غله، تست سبوس دار و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک تکه",
    img: "./Image/نان تست.jpg",
    subLabel: "",
    id: "نان تست سفید",
    label: "نان تست سفید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان سنگک.jpg",
    subLabel: "",
    id: "نان سنگگ",
    label: "نان سنگگ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک چهارم عدد یا چهار کف دست",
    img: "./Image/نان لواش.jpg",
    subLabel: "نان های مستطیلی یا گرد که بسیار نازک هستند",
    id: "نان لواش",
    label: "نان لواش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان بربری.jpg",
    subLabel: "",
    id: "نان بربری",
    label: "نان بربری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان خشک.jpg",
    subLabel: "",
    id: "نان خشک",
    label: "نان خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کف دست",
    img: "./Image/نان تافتون.jpg",
    subLabel: "نان های گردی که ضخامت بیشتری نسبت به لواش دارند",
    id: "نان تافتون و خانگی",
    label: "نان تافتون و خانگی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد یا 30 گرم",
    img: "./Image/برساق.jpg",
    subLabel: "",
    id: "برساق",
    label: "برساق",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 کف دست معادل برش 10×10",
    img: "./Image/نان گرده.jpg",
    subLabel: "",
    id: "نان گرده",
    label: "نان گرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 کف دست معادل برش 10×10",
    img: "./Image/شلینکه یا چزنک روغن.jpg",
    subLabel: "",
    id: "شلینکه یا چزنک روغن",
    label: "شلینکه یا چزنک روغن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 کف دست معادل برش 10×10",
    img: "./Image/نان ساجی.jpg",
    subLabel: "",
    id: "نان ساجی",
    label: "نان ساجی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 کف دست معادل برش 10×10",
    img: "./Image/کلوا.jpg",
    subLabel: "",
    id: "کلوا",
    label: "کلوا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 10 عدد",
    img: "./Image/سیب زمینی سرخ کرده.webp",
    subLabel: "سیب زمینی داخل خورشت ها و غذاها را درنظر نگیرید",
    id: "سیب زمینی سرخ کرده",
    label: "سیب زمینی سرخ کرده",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/سیب زمینی آبپز.jpg",
    subLabel: "سیب زمینی داخل غذاها را درنظر نگیرید .",
    id: "سیب زمینی",
    label: "سیب زمینی (تنوری، آبپز، پوره یا خوراک سیب زمینی و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان ذرت یا یک عدد بلال",
    img: "./Image/بلال یا ذرت.jpg",
    subLabel: "",
    id: "ذرت، پفیلا یا بلال ",
    label: "ذرت، پفیلا یا بلال ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر پرچرب.jpg",
    subLabel: "",
    id: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    label: "پنیر لیقوان، سنتی ، پرچرب و خامه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی کبریت",
    img: "./Image/پنیر کم چرب.jpg",
    subLabel: "",
    id: "پنیر کم چرب",
    label: "پنیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قوطی کبریت",
    img: "./Image/توف.jpg",
    subLabel: "",
    id: "توف",
    label: "توف یا شیراز محلی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر شکلاتی، شیر کاکائو  و شیر قهوه.jpg",
    subLabel: "",
    id: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    label: "شیر شکلاتی، شیر کاکائو  و شیر قهوه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرموز.jpg",
    subLabel: "",
    id: "شیرموز",
    label: "شیرموز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیرپرچرب.jpg",
    subLabel: "",
    id: "شیر پرچرب",
    label: "شیر پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان یا قوطی تک نفره",
    img: "./Image/شیر پاستوریزه.jpg",
    subLabel: "",
    id: "شیر کم چرب",
    label: "شیر کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست.jpg",
    subLabel: " (سنتی، چکیده و خامه ای)",
    id: "ماست پرچرب",
    label: "ماست پرچرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه ماست خوری",
    img: "./Image/ماست کم چرب.jpg",
    subLabel: "",
    id: "ماست کم چرب",
    label: "ماست کم چرب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/دوغ.jpg",
    subLabel: "",
    id: "دوغ",
    label: "دوغ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک  عدد",
    img: "./Image/کشک.jpg",
    subLabel: "کشک موجود در غذاها را درنظر نگیرید.",
    id: "کشک (مایع و خشک)",
    label: "کشک (مایع و خشک)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/خامه.jpg",
    subLabel: "",
    id: "خامه / سرشیر",
    label: "خامه / سرشیر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد یا نصف لیوان",
    img: "./Image/بستنی.jpg",
    subLabel: "",
    id: "بستنی (سنتی و غیر سنتی)",
    label: "بستنی (سنتی و غیر سنتی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/سیب یا گلابی.png",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید.",
    id: "سیب یا گلابی ",
    label: "سیب یا گلابی ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/موز.jpg",
    subLabel: "",
    id: "موز",
    label: "موز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/هلو یا شلیل.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هلو یا شلیل",
    label: "هلو یا شلیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/زردآلو.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "زردآلو یا آلو (زرد و قرمز)",
    label: "زردآلو یا آلو (زرد و قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی معادل 10 عدد",
    img: "./Image/گیلاس.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "گیلاس یا آلبالو",
    label: "گیلاس یا آلبالو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل 1 لیوان",
    img: "./Image/هندوانه.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید .",
    id: "هندوانه",
    label: "هندوانه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاچ معادل یک لیوان",
    img: "./Image/طالبی، خربزه، هندوانه و گرمک.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "خربزه، طالبی، ملون وگرمک",
    label: "خربزه، طالبی، ملون وگرمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری آبلیمو معادل نصف لیمو ترش",
    img: "./Image/آبلیمو.jpg",
    subLabel: "آبلیمو اضافه شده به شربت ها، سالاد و … را درنظر بگیرید",
    id: "لیموترش یا آبلیمو",
    label: "لیموترش یا آبلیمو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11بار و بیشتر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/انواع آبمیوه.jpg",
    subLabel: "",
    id: "آبمیوه طبیعی",
    label: "آبمیوه طبیعی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/آبمیوه صنعتی.jpg",
    subLabel: "",
    id: "آبمیوه صنعتی",
    label: "آبمیوه صنعتی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/انواع شربت.jpg",
    subLabel: "",
    id: "انواع شربت",
    label: "انواع شربت",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/مرکبات (پرتقال، نارنگی، لیموشیرین، نارنج).jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "مرکبات",
    label: "مرکبات (پرتقال، نارنگی، کیوی، لیموشیرین و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل5 عدد یا یک قاشق غذاخوری",
    img: "./Image/کشمش.jpg",
    subLabel: "",
    id: "کشمش و مویز",
    label: "کشمش و مویز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک خوشه متوسط",
    img: "./Image/انگور.jpg",
    subLabel:
      "میزان مصرف خود را در فصل عرضه میوه گزارش کنید (یک خوشه=20 عدد انگور)",
    id: "انگور",
    label: "انگور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/انار.jpg",
    subLabel: "میزان مصرف خود را در فصل عرضه میوه گزارش کنید",
    id: "انار",
    label: "انار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل  3عدد",
    img: "./Image/انجیر تازه.jpg",
    subLabel: "",
    id: "انجیر خشک",
    label: "انجیر خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 5عدد",
    img: "./Image/توت خشک.jpg",
    subLabel: "(توت خشک، برگ هلو، برگ زردآلو وآلبالو خشک)",
    id: "میوه های خشک",
    label: "میوه های خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/خرما.png",
    subLabel: "",
    id: "خرما و رطب",
    label: "خرما و رطب",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },

  {
    serving: "یک مشت معادل 5 عدد",
    img: "./Image/زیتون.jpg",
    subLabel: "",
    id: "زیتون",
    label: "زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/خیار.jpg",
    subLabel: "خیار سالاد را درنظر نگیرید .",
    id: "خیار",
    label: "خیار",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/گوجه.jpg",
    subLabel: "گوجه سالاد و املت را درنظر نگیرید .",
    id: "گوجه",
    label: "گوجه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک پیش دستی",
    img: "./Image/سبزی خوردن.jpg",
    subLabel: "",
    id: "سبزی خوردن",
    label: "سبزی خوردن",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/فلفل دلمه ای.jpg",
    subLabel: "",
    id: "فلفل دلمه ای",
    label: "فلفل دلمه ای",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  // {
  //   serving: "یک پیش دستی معادل 5 عدد",
  //   img: "./Image/قارچ.jpg",
  //   subLabel: "",
  //   id: "قارچ",
  //   label: "قارچ",
  //   type: "radio",
  //   options: [
  //     {
  //       id: "1",
  //       label: "تقریبا هرگز یا کمتر از یک بار در ماه",
  //     },
  //     {
  //       id: "2",
  //       label: "1-3 بار در ماه",
  //     },
  //     {
  //       id: "3",
  //       label: "1 بار در هفته",
  //     },
  //     {
  //       id: "4",
  //       label: "2-4 بار  در هفته",
  //     },
  //     {
  //       id: "5",
  //       label: "5-6 بار در هفته",
  //     },
  //     {
  //       id: "6",
  //       label: "1 بار در روز",
  //     },
  //     {
  //       id: "7",
  //       label: "2-3 بار در روز",
  //     },
  //     {
  //       id: "8",
  //       label: "4-5 بار در روز",
  //     },
  //     {
  //       id: "9",
  //       label: "6 بار یا بیشتر در روز",
  //     },
  //   ],
  //   validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  // },
  {
    serving: "یک عدد متوسط یا نصف فنجان",
    img: "./Image/هویج خام.jpg",
    subLabel: "",
    id: "هویج و آب هویج",
    label: "هویج و آب هویج",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/پیاز.jpg",
    subLabel: "پیاز داخل غذا را درنظر نگیرید",
    id: "پیاز (به صورت خام)",
    label: "پیاز (به صورت خام)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل 5 حبه سیر",
    img: "./Image/سیر.jpg",
    subLabel: "سیر داخل غذاها را درنظر نگیرید",
    id: "سیر (خام یا سیرترشی)",
    label: "سیر (خام یا سیرترشی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد متوسط",
    img: "./Image/کدو (خورشت کدو، پخارپز و...).jpg",
    subLabel: "",
    id: "کدو",
    label: "کدو (خورشت کدو، پخارپز و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/گردو.jpg",
    subLabel: "",
    id: "گردو (به غیر از خورشت فسنجان) ",
    label: "گردو (به غیر از خورشت فسنجان) ",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 10 عدد بادام، پسته یا فندق",
    img: "./Image/یک مشت  فندق پسته بادام …..jpg",
    subLabel: "",
    id: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    label: "پسته، بادام درختی، بادام هندی، بادام زمینی و فندق",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل دو قاشق غذاخوری",
    img: "./Image/انواع تخمه.jpg",
    subLabel: "",
    id: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    label: "انواع تخمه (آفتابگردان، هندوانه، کدو و …)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک مشت معادل 2 قاشق غذاخوری",
    img: "./Image/آجیل سویا و یا شیر سویا.jpg",
    subLabel: "",
    id: "آجیل سویا",
    label: "آجیل سویا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد پولکی معادل یک حبه قند",
    img: "./Image/قند یا پولکی.jpg",
    subLabel: "",
    id: "قند یا پولکی",
    label: "قند یا پولکی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قطعه متوسط",
    img: "./Image/نبات.jpg",
    subLabel: "",
    id: "نبات",
    label: "نبات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک عدد",
    img: "./Image/کیک تر یا خشک.jpg",
    subLabel: "",
    id: "شیرینی تر",
    label: "شیرینی تر",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شیرینی خشک.jpg",
    subLabel: "",
    id: "شیرینی خشک",
    label: "شیرینی خشک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد معادل یک بیسکوییت ساقه طلایی",
    img: "./Image/بیسکوئیت.jpg",
    subLabel: "",
    id: "انواع بیسکوئیت",
    label:
      "انواع بیسکوئیت (ساده، سبوسدار، ویفر، کراکر، کرامدار و ساق طلایی و...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک برش یا یک بسته",
    img: "./Image/کیک خانگی.jpg",
    subLabel: "",
    id: " کیک و کلوچه (خانگی یا بسته بندی)",
    label: " کیک و کلوچه (خانگی یا بسته بندی)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک عدد",
    img: "./Image/شکلات.jpg",
    subLabel: "",
    id: "انواع شکلات",
    label: "انواع شکلات",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان",
    img: "./Image/قهوه.jpg",
    subLabel: "",
    id: "نسکافه",
    label: "کافی میکس، نسکافه، کاپوچینو و ...",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/قهوه اسپرسو.jpg",
    subLabel: "",
    id: "قهوه دمی یا اسپرسو",
    label: "قهوه دمی یا اسپرسو",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چایی.jpg",
    subLabel: "",
    id: "چای سیاه",
    label: "چای سیاه",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6-10 بار در روز",
      },
      {
        id: "10",
        label: "11-15 بار در روز",
      },
      {
        id: "11",
        label: "16 بار و بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/شکر.jpg",
    subLabel: "شکر استفاده شده برای آماده کردن غذاها را درنظر نگیرید",
    id: "شکر (در چای یا قهوه)",
    label: "شکر (در چای یا قهوه)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/عسل.jpg",
    subLabel: "",
    id: "عسل",
    label: "عسل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری یا یک قوطی کبریت",
    img: "./Image/حلوا شکری.jpg",
    subLabel: "",
    id: "حلوا ارده یا حلوا شکری",
    label: "حلوا ارده یا حلوا شکری",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "3 قاشق غذاخوری",
    img: "./Image/حلوای جوجوش.jpg",
    subLabel: "",
    id: "حلوای جوجوش",
    label: "حلوای جوجوش",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/ارده شیره.jpg",
    subLabel: "",
    id: "ارده شیره",
    label: "ارده شیره",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "قالب 10 گرمی",
    img: "./Image/کره چربی.jpg",
    subLabel: "",
    id: "کره یا مارگارین",
    label: "کره یا مارگارین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق مرباخوری",
    img: "./Image/مربا.jpg",
    subLabel: "",
    id: "انواع مربا",
    label: "انواع مربا",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/روغن زیتون.jpg",
    subLabel: "",
    id: "روغن زیتون",
    label: "روغن زیتون",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک لیوان معادل یک قوطی",
    img: "./Image/نوشابه.jpg",
    subLabel: "",
    id: "نوشابه، دلستر یا لیموناد",
    label: "نوشابه، دلستر یا لیموناد",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/انواع سس سالاد.jpg",
    subLabel: "",
    id: "انواع سس سالاد",
    label: "انواع سس سالاد (مایونز، فرانسوی، هزارجزیره و ...)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق غذاخوری",
    img: "./Image/سس گوجه.jpg",
    subLabel: "رب گوجه را درنظر نگیرید",
    id: "سس کچاپ (قرمز)",
    label: "سس کچاپ (قرمز)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک کاسه کوچک معادل دو قاشق غذاخوری",
    img: "./Image/انواع ترشی.jpg",
    subLabel: "به جز سیرترشی",
    id: "انواع ترشی",
    label: "انواع ترشی",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "1 عدد خیارشور یا 1 قاشق غذاخوری شور",
    img: "./Image/خیار شور.jpg",
    subLabel: "در ساندویچ و مصرفی در کنار غذاهای دیگر",
    id: "خیارشور و شور",
    label: "خیارشور و شور",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک بسته",
    img: "./Image/چیپس یا پفک.jpg",
    subLabel: "",
    id: "چیپس یا پفک",
    label: "چیپس یا پفک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زردچوبه.jpg",
    subLabel: "",
    id: "زردچوبه (استفاده در غذاها)",
    label: "زردچوبه (استفاده در غذاها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/فلفل سیاه.jpg",
    subLabel: "",
    id: "فلفل سیاه (در پخت و پز یا سر سفره)",
    label: "فلفل سیاه (در پخت و پز یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/آویشن.jpg",
    subLabel: "",
    id: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    label: "آویشن یا پونه کوهی (در غذاها یا سر سفره)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زنجبیل.jpg",
    subLabel: "استفاده در نوشیدنی ها (چای) یا غذاها",
    id: "زنجبیل",
    label: "زنجبیل",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/دارچین.jpg",
    subLabel: "در غذاها و نوشیدنی ها",
    id: "دارچین",
    label: "دارچین",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "",
    img: "./Image/زعفران.jpg",
    subLabel: "",
    id: "زعفران (در غذاها یا نوشیدنی ها)",
    label: "زعفران (در غذاها یا نوشیدنی ها)",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک فنجان معادل نصف لیوان",
    img: "./Image/چای سبز.jpg",
    subLabel: "",
    id: "چای سبز",
    label: "چای سبز",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    serving: "یک قاشق چای خوری",
    img: "./Image/نمک.jpg",
    subLabel: "نمک اضافه شده در زمان صرف غذا را در نظر بگیرید",
    id: "نمک",
    label: "نمک",
    type: "radio",
    options: [
      {
        id: "1",
        label: "تقریبا هرگز یا کمتر از یک بار در ماه",
      },
      {
        id: "2",
        label: "1-3 بار در ماه",
      },
      {
        id: "3",
        label: "1 بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار  در هفته",
      },
      {
        id: "5",
        label: "5-6 بار در هفته",
      },
      {
        id: "6",
        label: "1 بار در روز",
      },
      {
        id: "7",
        label: "2-3 بار در روز",
      },
      {
        id: "8",
        label: "4-5 بار در روز",
      },
      {
        id: "9",
        label: "6 بار یا بیشتر در روز",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    img: "./Image/دمنوش.jpg",

    serving: "",
    subLabel: "",
    id: "آیا از دمنوش های گیاهی استفاده میکنید؟",
    label: "آیا از دمنوش های گیاهی استفاده میکنید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "بله",
      },
      {
        id: "2",
        label: "خیر",
      },
    ],
    validation: Yup.string().required("لطفا میزان مصرف خود را مشخص نمایید"),
  },
  {
    subLabel: "(بیش از یک گزینه میتوانید انتخاب کنید)",
    img: "",
    id: "در صورت استفاده از دمنوش های گیاهی کدامیک به صورت معمول استفاده میشود؟ ",
    label:
      "در صورت استفاده از دمنوش های گیاهی کدامیک به صورت معمول استفاده میشود؟ ",
    type: "checkbox",
    options: [
      { id: "1", label: "گل گاو زبان" },
      { id: "2", label: "چای سبز" },
      { id: "3", label: "چای ترش" },
      { id: "4", label: "چای ماسالا" },
      { id: "5", label: "چای زعفران" },
      { id: "6", label: "چای و دارچین" },
      { id: "7", label: "دمنوش آویشن" },
      { id: "8", label: "دمنوش بابونه" },
      { id: "9", label: "دمنوش نعناع" },
      { id: "10", label: "بهارنارنج" },
      { id: "11", label: "دمنوش به لیمو" },
      { id: "12", label: "سایر" },
    ],
    validation: Yup.array(),
  },
  {
    subLabel: "",
    id: "سایر دمنوش ها:",
    label: "سایر دمنوش ها:",
    type: "text",
    validation: Yup.string("لطفا نام دمنوش را به درستی وارد کنید"),
    placeholder: "لطفا نام سایر دمنوش  ها اینجا وارد شود",
  },
];
