import React from "react";
import DynamicForm from "../../DynamicForm/DynamicForm";
import * as Yup from "yup";
import swal from "sweetalert";
const questions = [
  {
    subLabel: "",
    id: "نام",
    label: "نام",
    type: "text",
    validation: Yup.string("لطفا نام خود را به درستی وارد کنید")
      .required("وارد کردن نام الزامی است")
      .min(3, "لطفا نام خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "نام خانوادگی",
    label: "نام خانوادگی",
    type: "text",
    validation: Yup.string("لطفا نام خانوادگی خود را به درستی وارد کنید")
      .required("وارد کردن نام خانوادگی الزامی است")
      .min(3, "لطفا نام خانوادگی خود را به درستی وارد کنید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا نام خانوادگی خود را به درستی وارد نمایید"
      ),
    placeholder: "نام خانوادگی خود را وارد نمایید",
  },
  {
    img: "",
    subLabel: "",
    id: "کد ملی :",
    label: "کد ملی :",
    type: "text",
    validation: Yup.string("لطفا کد ملی خود را به درستی وارد کنید")
      .required("وارد کردن کد ملی الزامی است")
      .min(10, "تعداد ارقام کد ملی باید 10 عدد باشد")
      .matches(/^([0-9۰-۹]{10})$/g, "نکته: کد ملی خود را به درستی وارد نمایید"),
    placeholder: "کد ملی خود را وارد نمایید",
  },
  {
    subLabel: "",
    id: "تلفن همراه (موبایل) :",
    label: "تلفن همراه (موبایل) :",
    type: "text",
    validation: Yup.string(
      " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
    )
      .required("وارد کردن شماره تلفن همراه (موبایل) الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        " شماره 11 رقمی موبایل خود را همراه با صفر ابتدایی وارد نمایید"
      ),
    placeholder: "تلفن همراه خود را با صفر ابتدایی وارد نمایید",
  },
  {
    img: "",
    subLabel: " (همراه با کد استان)",
    id: "شماره تماس (منزل) :",
    label: "شماره تماس (منزل) :",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن شماره تماس (منزل) الزامی است")
      .min(11, "تعداد ارقام تلفن تماس حداقل باید 11 عدد باشد")
      .max(15, "تعداد ارقام تلفن تماس حداکثر باید 15 عدد باشد")
      .matches(
        /^[0۰][0-9۰-۹]{10,14}/g,
        "نکته: شماره تماس (منزل) خود را به همراه کد استان به درستی وارد نمایید"
      ),
    placeholder: "مثلا: 02112345678",
  },
  {
    subLabel: "",
    id: "تلفن همراه جایگزین",
    label: "تلفن همراه جایگزین",
    type: "text",
    validation: Yup.string()
      .required("وارد کردن تلفن همراه جایگزین الزامی است")
      .min(11, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .max(12, "تعداد ارقام تلفن همراه باید 11 عدد باشد")
      .matches(
        /^([0۰][9۹][0-9۰-۹]{9})$/g,
        "شماره 11 رقمی موبایل خود را همراه همراه صفر ابتدایی آن وارد نمایید"
      ),
    placeholder: "تلفن همراه 11 رقمی خود را با صفر ابتدایی وارد نمایید",
  },
  {
    subLabel: "",
    id: "سن",
    label: "سن",
    type: "number",
    validation: Yup.number(
      "لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا سن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(150, "لطفا سن خود را به درستی وارد نمایید")
      .min(20, "لطفا سن خود را به درستی وارد نمایید")
      .positive("لطفا سن خود را به درستی وارد نمایید")
      .integer(
        "لطفا زمان وارد شده را بدون اعشار و به صورت عدد صحیح وارد نمایید"
      ),
    placeholder: "مثلا : 32",
  },
  {
    subLabel: "",
    id: "وزن (کیلوگرم)",
    label: "وزن (کیلوگرم)",
    type: "number",
    validation: Yup.number(
      "لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(200, "لطفا وزن خود را به درستی وارد نمایید")
      .positive("لطفا وزن خود را به درستی وارد نمایید")
      .min(30, "لطفا وزن خود را به درستی وارد نمایید"),
    placeholder: "منظور وزن با حداقل لباس و بدون کفش می باشد",
  },
  {
    subLabel: "",
    id: "قد (برحسب سانتی متر) :",
    label: "قد (برحسب سانتی متر) :",
    type: "number",
    validation: Yup.number(
      "لطفا قد خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا قد خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .min(100, "لطفا قد خود را به درستی وارد نمایید")
      .max(250, "لطفا قد خود را به درستی وارد نمایید")
      .positive("لطفا قد خود را به درستی وارد نمایید")
      .integer(
        "لطفا زمان وارد شده را بدون اعشار و به صورت عدد صحیح وارد نمایید"
      ),
    placeholder: "قد بدون کفش وارد شود",
  },
  {
    subLabel: "",
    id: "جنسیت خود را مشخص نمایید",
    label: "جنسیت خود را مشخص نمایید",
    type: "radio",
    options: [
      {
        id: "1",
        label: "زن",
      },
      {
        id: "2",
        label: "مرد",
      },
    ],
    validation: Yup.string().required("لطفا جنسیت را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت پدری خود را مشخص نمایید :",
    label: "قومیت پدری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت پدری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "قومیت مادری خود را مشخص نمایید :",
    label: "قومیت مادری خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "فارس" },
      { id: "2", label: "ترک" },
      { id: "3", label: "عرب" },
      { id: "4", label: "لر" },
      { id: "5", label: "کرد" },
      { id: "6", label: "بلوچ" },
      { id: "7", label: "سایر قومیت ها" },
    ],
    validation: Yup.string().required("لطفا قومیت مادری خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "شغل خود را مشخص نمایید :",
    label: "شغل خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "کارمند" },
      { id: "2", label: "شغل آزاد" },
      { id: "3", label: "کارگر" },
      { id: "4", label: "بازنشسته" },
      { id: "5", label: "بازنشسته شاغل" },
      { id: "6", label: "خانه دار" },
      { id: "7", label: "بیکار" },
      { id: "8", label: "کشاورز" },
      { id: "9", label: "سایر شغل ها" },
    ],
    validation: Yup.string().required("لطفا شغل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت تاهل را مشخص نمایید :",
    label: "وضعیت تاهل را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "متاهل" },
      { id: "2", label: "مجرد" },
      { id: "3", label: "همسر فوت شده/ بیوه" },
      { id: "4", label: "همسر جدا شده/مطلقه" },
    ],
    validation: Yup.string().required("لطفا وضعیت تاهل خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت خود را در خانواده مشخص نمایید :",
    label: "وضعیت خود را در خانواده مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "سرپرست خانواده" },
      { id: "2", label: "همسر سرپرست خانواده" },
      { id: "3", label: "فرزند" },
      { id: "4", label: "پدر و مادر سرپرست خانواده" },
      {
        id: "5",
        label: "پدر و مادر همسر سرپرست خانواده",
      },
      { id: "6", label: "سایر" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خود را در خانواده مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تعداد افراد خانواده شما (مثلا 4):",
    label: "تعداد افراد خانواده شما (مثلا 4):",
    type: "text",
    validation: Yup.string("لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .required("وارد کردن تعداد افراد خانواده الزامی است")
      .max(2, "لطفا تعداد افراد خانواده خود را به درستی وارد کنید")
      .matches(
        /^([0-9۰-۹]{1,2})$/g,
        "لطفا تعداد افراد خانواده خود را به درستی (مثلا 4) وارد نمایید"
      ),
    placeholder: "مثلا: 4",
  },
  {
    subLabel: "",
    id: "تحصیلات خود را مشخص نمایید :",
    label: "تحصیلات خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "بی سواد" },
      { id: "2", label: "ابتدایی" },
      { id: "3", label: "راهنمایی" },
      { id: "4", label: "دبیرستان" },
      { id: "5", label: "دیپلم" },
      { id: "6", label: "فوق دیپلم" },
      { id: "7", label: "لیسانس" },
      { id: "8", label: "فوق لیسانس" },
      { id: "9", label: "دکتری" },
    ],
    validation: Yup.string().required("لطفا تحصیلات خود را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "وضعیت محل سکونت خود را مشخص نمایید :",
    label: "وضعیت محل سکونت خود را مشخص نمایید :",
    type: "radio",
    options: [
      { id: "1", label: "مسکن شخصی" },
      { id: "2", label: "مسکن اجاره ای یا رهنی" },
      { id: "3", label: "مسکن سازمانی" },
      {
        id: "4",
        label: "در منزل خویشاوندان سکونت دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت محل سکونت خود را مشخص نمایید"
    ),
  },
  {
    subLabel: " (حداقل 1 و حداکثر 3 گزینه میتوانید انتخاب کنید)",
    id: "طی ده سال گذشته در کدام یک از شهر های استان خوزستان زندگی کرده اید؟",
    label:
      "طی ده سال گذشته در کدام یک از شهر های استان خوزستان زندگی کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "اهواز" },
      { id: "2", label: "آبادان" },
      { id: "3", label: "اندیمشک" },
      { id: "4", label: "ایذه" },
      { id: "5", label: "باغ‌ملک" },
      { id: "6", label: "بندرماهشهر" },
      { id: "7", label: "بهبهان" },
      { id: "8", label: "خرمشهر" },
      { id: "9", label: "دزفول" },
      { id: "10", label: "دشت‌آزادگان" },
      { id: "11", label: "رامهرمز" },
      { id: "12", label: "شادگان" },
      { id: "13", label: "شوش" },
      { id: "14", label: "شوشتر " },
      { id: "15", label: "مسجد سلیمان" },
      { id: "16", label: "سایر" },
    ],
    validation: Yup.array()
      .min(1, "حداقل باید 1 شهر انتخاب شود")
      .max(3, "حداکثر مجاز به انتخاب 3 شهر هستید")
      .required("لطفا سابقه سکونت خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "در صورتی که در شهر اهواز زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    label:
      "در صورتی که در شهر اهواز زندگی می کنید، طی 10 سال گذشته در کدام مناطق این شهر ساکن بوده اید؟",
    type: "text",
    validation: Yup.string("محل سکونت خود را به درستی وارد نمایید")
      .matches(
        /^[پچجحخهعغآ؟.،آفقثصضشسیبلاتنمکگوئدذرزطظژ!!ؤإأءًٌٍَُِّ\s]+$/u,
        "لطفا منطقه زندگی خود را به درستی وارد نمایید"
      )
      .min(3, "لطفا منطقه زندگی خود را به درستی وارد نمایید"),
    placeholder:
      "می توانید یک یا بیش از یک منطقه را بنویسید مثلا شهرک دانشگاه، گلستان و ...",
  },
  {
    subLabel: "",
    id: "آیا خودرو شخصی دارید؟",
    label: "آیا خودرو شخصی دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله خودرو خارجی دارم" },
      { id: "3", label: "بله خودرو داخلی دارم" },
      {
        id: "4",
        label: "هر دو نوع خودرو داخلی و خارجی را دارم",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خودرو شخصی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    label: "آیا تا به حال مسافرتی به خارج از کشور داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله (مسافرت زیارتی)" },
      { id: "3", label: "بله (مسافرت غیر زیارتی)" },
      {
        id: "4",
        label: "بله (مسافرت زیارتی و غیر زیارتی)",
      },
    ],
    validation: Yup.string().required("لطفا سابقه مسافرت را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "چند سال از تلفن همراه استفاده می کنید؟",
    label: "چند سال از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تلفن همراه ندارم" },
      { id: "2", label: "کمتر از 5 سال" },
      { id: "3", label: "بین 5 تا 10 سال" },
      { id: "4", label: "بین 10 تا 20 سال" },
      { id: "5", label: "بیشتر از 20 سال" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن را مشخص نمایید"
    ),
  },
  {
    subLabel: "(صحبت کردن، بازی کردن، چت کردن، استفاده از اینترنت و ...)",
    id: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    label: "در طول روز، چه مدت از تلفن همراه استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "تلفن همراه ندارم" },
      { id: "2", label: "کمتر از 1 ساعت" },
      { id: "3", label: "1 تا 2 ساعت" },
      { id: "4", label: "2 تا 3 ساعت" },
      { id: "5", label: "3 تا 4 ساعت" },
      { id: "6", label: "بیش از 4 ساعت" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از تلفن همراه را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    label: "آیا در محل کار خود، در معرض سموم یا کودهای شیمیایی قرار دارید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و کودهای شیمیایی بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    label:
      "آیا منزل شما نزدیک مناطقی است که در آن کشت و کار انجام می شود (انواع مزارع و باغات)؟ ",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کشت و کار در منطقه مسکونی خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    label: "آیا در منزل از حشره کش ها و آفت کش ها استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله، به صورت هفتگی" },
      { id: "3", label: "بله، به صورت ماهانه" },
      { id: "4", label: "بله، به صورت سالانه" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت استفاده از  حشره کش ها و آفت کش ها را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    label: "آیا منزل شما نزدیک کارخانه های صنعتی می باشد؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض سموم و مواد شیمیایی قرار گرفتن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    label:
      "در صورت پاسخ بلی به سوال قبل، منزل شما حدود چند کیلومتر با کارخانه های صنعتی فاصله دارد؟ (بر حسب کیلومتر)",
    type: "text",
    validation: Yup.string(
      "لطفا فاصله منزلتان تا کارخانه صنعتی خود را به درستی وارد کنید"
    ).matches(/^([0-9۰-۹]{1,4})$/g, "لطفا فاصله را به درستی وارد نمایید"),
    placeholder: "مثلا: 20",
  },
  {
    subLabel: "حداقل 1 و حداکثر ۸ گزینه را می‌توانید انتخاب کنید.",
    id: "در طول زندگی خود، به کدامیک از بیماری های زیر مبتلا شده اید؟",
    label: "در طول زندگی خود، به کدامیک از بیماری های زیر مبتلا شده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "دیابت" },
      { id: "2", label: "فشار خون بالا" },
      { id: "3", label: "سکته قلبی یا مغزی" },
      { id: "4", label: "سرطان" },
      { id: "5", label: "بیماری قلبی" },
      { id: "6", label: "مشکلات تیروئیدی" },
      { id: "7", label: "بیماری کلیوی" },
      { id: "8", label: "هپاتیت" },
      { id: "9", label: "سرطان کولون (روده)" },
      { id: "10", label: "سایر سرطان های گوارشی" },
      {
        id: "11",
        label: "سندورم روده تحریک پذیر(IBS)",
      },
      { id: "12", label: "ورم معده" },
      { id: "13", label: "پولیپ روده" },
      { id: "14", label: "بیماری التهابی روده(IBD)" },
      { id: "15", label: "سوزش سر دل یا رفلاکس" },
      { id: "16", label: "کبد چرب" },
      { id: "هیچکدام", label: "هیچکدام" },
    ],
    validation: Yup.array()
      .max(8, "حداکثر مجاز به انتخاب 8 بیماری هستید")
      .required("لطفا سابقه بیماری خود را مشخص نمایید "),
  },
  {
    subLabel: "",
    id: "آیا تاکنون مبتلا به سرطان روده یا کولون شده اید؟",
    label: "آیا تاکنون مبتلا به سرطان روده یا کولون شده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      { id: "2", label: "بله" },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ابتلا به بیماری کولون را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا در اقوام خود، سابقه ابتلا به سرطان داشته اید؟",
    label: "آیا در اقوام خود، سابقه ابتلا به سرطان داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
      },
      {
        id: "3",
        label: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
      },
      {
        id: "4",
        label: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  سابقه ابتلا به سرطان را مشخص نمایید"
    ),
  },

  {
    subLabel: "",
    id: "آیا در اقوام خود سابقه ابتلا به سرطان روده یا کولون داشته اید؟",
    label: "آیا در اقوام خود سابقه ابتلا به سرطان روده یا کولون داشته اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، اقوام درجه یک (پدر، مادر، فرزندان، خواهر، برادر)",
      },
      {
        id: "3",
        label: "بلی، اقوام درجه 2 (عمه، خاله، عمو، دایی، پدربزرگ، مادربزرگ)",
      },
      {
        id: "4",
        label: "بلی، اقوام درجه 3 (اقوامی غیر از گزینه های قبلی)",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  سابقه ابتلا به سرطان را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    label:
      "در طول سال گذشته، به طور معمول یا روتین قرص ویتامین دی مصرف کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به صورت مرتب ",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات ",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف قرص ویتامین دی را مشخص نمایید"
    ),
  },
  {
    subLabel: "حداقل 1 گزینه و حداکثر 6 گزینه را میتوانید انتخاب کنید",
    id: "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    label:
      "در طول سال گذشته و حداقل به مدت یک ماه، کدام یک از ویتامین ها و مواد معدنی زیر را استفاده کرده اید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "مولتی ویتامین" },
      { id: "2", label: "مولتی ویتامین مینرال" },
      { id: "3", label: "کلسیم ویتامین دی" },
      { id: "4", label: "کلسیم" },
      {
        id: "5",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "6", label: "فولیک اسید" },
      { id: "7", label: "امگا 3" },
      { id: "8", label: "روی یا زینک" },
      { id: "9", label: "سایر ویتامین ها" },
      {
        id: "10",
        label: "پروبیوتیک",
      },
      {
        id: "هیچکدام",
        label: "هیچکدام",
      },
    ],
    validation: Yup.array()
      .required(
        "لطفا سابقه مصرف مکمل ویتامین و یا مواد معدنی خود را مشخص نمایید "
      )
      .max(6, "حداکثر مجاز به انتخاب 6 گزینه می باشید"),
  },
  {
    subLabel: "",
    id: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    label: "در طول 10 سال گذشته، کدامیک از اتفاقات تلخ زیر را تجربه کرده اید؟",
    type: "radio",
    options: [
      {
        id: "1",
        label: "از دست دادن پدر، مادر یا فرزندان",
      },
      {
        id: "2",
        label: "ابتلا نزدیکان به بیماری های لاعلاج",
      },
      {
        id: "3",
        label: "طلاق",
      },
      {
        id: "4",
        label: "ترس یا غم های بزرگ دیگری داشتم",
      },
      {
        id: "5",
        label: "هیچکدام",
      },
    ],
    validation: Yup.string().required("لطفا به سوال پاسخ دهید"),
  },
  {
    subLabel: "",
    id: "وزن معمول شما قبل از ابتلا به بیماری چقدر بوده است؟ (به کیلوگرم)",
    label: "وزن معمول شما قبل از ابتلا به بیماری چقدر بوده است؟ (به کیلوگرم)",
    type: "number",
    validation: Yup.number(
      "لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید"
    )
      .required("لطفا وزن خود را با کیبورد انگلیسی و به درستی وارد کنید")
      .max(200, "لطفا وزن خود را به درستی وارد نمایید")
      .positive("لطفا وزن خود را به درستی وارد نمایید")
      .min(30, "لطفا وزن خود را به درستی وارد نمایید"),
    placeholder: "منظور وزن با حداقل لباس و بدون کفش می باشد",
  },
  {
    subLabel: "",
    id: "وضعیت سیگار کشیدن",
    label: "وضعیت سیگار کشیدن",
    type: "radio",
    options: [
      { id: "1", label: "در حال حاضر سیگاری هستم" },
      {
        id: "2",
        label: "قبلا سیگاری بودم و ترک کردم",
      },
      {
        id: "3",
        label: "تاکنون سیگار نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت سیگار کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، سیگار کشیدن را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، سیگار کشیدن را ترک کردید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا سیگاری نبودم" },
      {
        id: "2",
        label: "بلی",
      },
      {
        id: "3",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت سیگار کشیدن را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا از قلیان استفاده می کنید؟",
    label: "آیا از قلیان استفاده می کنید؟",
    type: "radio",
    options: [
      { id: "1", label: "در حال حاضر استفاده می کنم" },
      {
        id: "2",
        label: "قبلا استفاده می کردم و ترک کردم",
      },
      {
        id: "3",
        label: "تاکنون قلیان نکشیده ام",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت قلیان کشیدن را مشخص نمایید"),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، قلیان کشیدن را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، قلیان کشیدن را ترک کردید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا قلیان استفاده نمیکردم" },
      {
        id: "2",
        label: "بلی",
      },
      {
        id: "3",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت قلیان کشیدن را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    label:
      "در صورتی که سیگاری یا قلیانی نیستید، آیا در محل سکونت یا کار خود، در معرض دود سیگار یا قلیان قرار می گیرید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، خیلی کم",
      },
      {
        id: "3",
        label: "بله، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله، خیلی زیاد",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت در معرض دود سیگار یا قلیان بودن را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    label: "آیا تاکنون از مشروبات الکلی استفاده کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "3",
        label: "بله ، به صورت هفتگی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، مشروبات الکلی را ترک کردید؟",
    label: "آیا بعد از ابتلا به بیماری، مشروبات الکلی را ترک کردید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا مصرف نمی کردم" },
      {
        id: "2",
        label: "بله",
      },
      {
        id: "3",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مشروبات الکلی را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    label: "آیا تاکنون از مواد مخدر استفاده کرده اید؟ ",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به صورت تزریقی",
      },
      {
        id: "3",
        label: "بله، به صورت خوراکی",
      },
      {
        id: "4",
        label: "بله، به صورت استنشاقی",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "آیا بعد از ابتلا به بیماری، مواد مخدر را ترک کرده اید؟",
    label: "آیا بعد از ابتلا به بیماری، مواد مخدر را ترک کرده اید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا مصرف نمی کردم" },
      {
        id: "2",
        label: "بله",
      },
      {
        id: "3",
        label: "خیر",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مصرف مواد مخدر را پس از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "روزانه چند ساعت می خوابید؟",
    label: "روزانه چند ساعت می خوابید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از 6 ساعت" },
      {
        id: "2",
        label: "6 تا 8 ساعت",
      },
      {
        id: "3",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required("لطفا وضعیت خواب خود را مشخص نمایید"),
  },
  {
    subLabel: " (منظور خواب در شب و در طول روز می باشد)",
    id: "قبل از ابتلا به بیماری، روزانه چند ساعت می خوابیدید؟",
    label: "قبل از ابتلا به بیماری، روزانه چند ساعت می خوابیدید؟",
    type: "radio",
    options: [
      { id: "1", label: "کمتر از 6 ساعت" },
      {
        id: "2",
        label: "6 تا 8 ساعت",
      },
      {
        id: "3",
        label: "بیش از 8 ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب خود را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 10" },
      {
        id: "2",
        label: "بین 10 تا 12",
      },
      {
        id: "3",
        label: "بعد از ساعت 12",
      },
      {
        id: "4",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، معمولا شب ها چه ساعتی خوابتان می برد؟",
    label: "قبل از ابتلا به بیماری، معمولا شب ها چه ساعتی خوابتان می برد؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 10" },
      {
        id: "2",
        label: "بین 10 تا 12",
      },
      {
        id: "3",
        label: "بعد از ساعت 12",
      },
      {
        id: "4",
        label: "به دلیل شیفت شب، نمی خوابم",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت خواب معمول خود را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    label: "معمولا صبح ها چه ساعتی از خواب بیدار می شوید؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 6" },
      {
        id: "2",
        label: "بین 6 تا 8",
      },
      {
        id: "3",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، معمولا صبح ها چه ساعتی از خواب بیدار می شدید؟",
    label:
      "قبل از ابتلا به بیماری، معمولا صبح ها چه ساعتی از خواب بیدار می شدید؟",
    type: "radio",
    options: [
      { id: "1", label: "قبل از ساعت 6" },
      {
        id: "2",
        label: "بین 6 تا 8",
      },
      {
        id: "3",
        label: "بعد از ساعت 8",
      },
    ],
    validation: Yup.string().required(
      "لطفا ساعت معمولی که صبح از خواب بیدار می شوید را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور فاصله بین ناهار تا شام است)",
    id: "آیا در طول روز نیز می خوابید؟",
    label: "آیا در طول روز نیز می خوابید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، کمتر از یک ساعت",
      },
      {
        id: "3",
        label: "بلی، بیشتر از یک ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب در طول روز را مشخص نمایید"
    ),
  },
  {
    subLabel: " (منظور فاصله بین ناهار تا شام است)",
    id: "قبل از ابتلا به بیماری، آیا در طول روز نیز می خوابیدید؟",
    label: "قبل از ابتلا به بیماری، آیا در طول روز نیز می خوابیدید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بلی، کمتر از یک ساعت",
      },
      {
        id: "3",
        label: "بلی، بیشتر از یک ساعت",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت خواب در طول روز را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، کدام یک از مکمل های غذایی زیر را به صورت معمول و منظم (مصرف بیشتر از یک ماه) استفاده می کردید؟",
    label:
      "قبل از ابتلا به بیماری، کدام یک از مکمل های غذایی زیر را به صورت معمول و منظم (مصرف بیشتر از یک ماه) استفاده می کردید؟",
    type: "checkbox",
    options: [
      { id: "1", label: "مولتی ویتامین مینرال" },
      { id: "2", label: "مولتی ویتامین" },
      { id: "3", label: "کلسیم ویتامین دی" },
      { id: "4", label: "کلسیم" },
      { id: "5", label: "ویتامین دی" },
      {
        id: "6",
        label: "آهن(فروسولفات، فیفول و ...)",
      },
      { id: "7", label: "فولیک اسید" },
      { id: "8", label: "امگا 3" },
      { id: "9", label: "روی یا زینک" },
      {
        id: "10",
        label: "پروبیوتیک",
      },
      { id: "11", label: "سایر ویتامین ها" },
    ],
    validation: Yup.array().required(
      "لطفا مکمل های غذایی را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا مبتلا به یبوست طولانی مدت (بیش از 3 روز) شده بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، خیلی کم",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت یبوست طولانی مدت را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا مبتلا به اسهال طولانی مدت (بیش از 7 روز) شده بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله، به ندرت",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت اسهال طولانی مدت را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا در مدفوع خود خون مشاهده کرده بودید؟",
    label: "قبل از ابتلا به بیماری، آیا در مدفوع خود خون مشاهده کرده بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، خیلی کم",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت مشاهده خون در مدفوع را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن را مشاهده کرده بودید؟",
    label:
      "قبل از ابتلا به بیماری، آیا تغییری در قطر مدفوع یا عدم دفع کامل آن را مشاهده کرده بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، خیلی کم",
      },
      {
        id: "3",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "4",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت قطر مدفوع یا عدم دفع کامل را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، آیا مبتلا به کم خونی بودید؟",
    label: "قبل از ابتلا به بیماری، آیا مبتلا به کم خونی بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "خیر" },
      {
        id: "2",
        label: "بله ، گاهی اوقات",
      },
      {
        id: "3",
        label: "بله ، همیشه",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت کم خونی را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، چند بار ام آر آی یا سی تی اسکن داده بودید؟",
    label: "قبل از ابتلا به بیماری، چند بار ام آر آی یا سی تی اسکن داده بودید؟",
    type: "radio",
    options: [
      { id: "1", label: "اصلا انجام نداده بودم" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت  ام آر آی یا سی تی اسکن  را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: "(مثل او پی جی و ...)",
    id: "تاکنون چندین مرتبه از دندان های شما عکس برداری شده است؟ ",
    label: "تاکنون چندین مرتبه از دندان های شما عکس برداری شده است؟ ",
    type: "radio",
    options: [
      { id: "1", label: "اصلا انجام نداده بودم" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت عکس برداری از دندان هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel: "",
    id: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    label: "تاکنون چند مرتبه از اندام های شما سونوگرافی انجام شده است؟",
    type: "radio",
    options: [
      { id: "1", label: "هیچ مرتبه" },
      {
        id: "2",
        label: "1-3 بار",
      },
      {
        id: "3",
        label: "4-6 بار",
      },
      {
        id: "4",
        label: "7-10 بار",
      },
      {
        id: "5",
        label: "بیش از 10 بار",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت سونوگرافی از اندام هایتان را مشخص نمایید"
    ),
  },
  {
    subLabel:
      "(یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    id: "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    label:
      "هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دهید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "بیش از 4 بار در هفته",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت انجام ورزش شدید را مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش شدید انجام نمی دهید عددی وارد نکنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel:
      "(یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    id: "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟",
    label:
      "هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دهید؟",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "4-6 بار در هفته",
      },
      {
        id: "6",
        label: "هر روز",
      },
    ],
    validation: Yup.string()
      .required("لطفا وضعیت ورزش با شدت متوسط را مشخص نمایید")
      .max(24, "لطفا زمان را به درستی وارد نمایید"),
  },
  {
    subLabel: " (در صورتی که ورزش متوسط انجام نمی دهید عددی وارد نکنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد؟",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "به طور روزانه، چند ساعت از زمان شما صرف نشستن می شود؟",
    label: "به طور روزانه، چند ساعت از زمان شما صرف نشستن می شود؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت نشستن با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "69",
    label:
      "به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شود؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت فعالیت با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    label:
      "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های شدیدی مانند دویدن، فوتبال، بسکتبال، شنا کردن و کوهنوردی انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را خیلی زیاد افزایش دهد)",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "بیش از 4 بار در هفته",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت انجام ورزش شدید را قبل از ابتلا مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش شدید انجام نمی دهید عددی وارد نکنید)",
    id: "با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامید؟",
    label:
      "با توجه به سوال قبل، هر بار انجام ورزش شدید چقدر به طول می انجامید؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    label:
      "قبل از ابتلا به بیماری، هرچند وقت یکبار ورزش های با شدت متوسط مانند والیبال، پینگ پونگ، باغبانی و پیاده روی تند انجام می دادید؟ (یا هر نوع ورزش دیگری که ضربان قلب و تنفس را به طور متوسط افزایش دهد)",
    type: "radio",
    options: [
      { id: "1", label: "هرگز" },
      {
        id: "2",
        label: "1-3 بار درماه",
      },
      {
        id: "3",
        label: "یک بار در هفته",
      },
      {
        id: "4",
        label: "2-4 بار در هفته",
      },
      {
        id: "5",
        label: "4-6 بار در هفته",
      },
      {
        id: "6",
        label: "هر روز",
      },
    ],
    validation: Yup.string().required(
      "لطفا وضعیت ورزش با شدت متوسط را مشخص نمایید"
    ),
  },
  {
    subLabel: " (در صورتی که ورزش متوسط انجام نمی دهید عددی وارد نکنید)",
    id: " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد",
    label:
      " با توجه به سوال قبل، هر بار انجام ورزش متوسط چقدر به طول می انجامد",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت ورزش با کیبورد انگلیسی و به درستی وارد کنید"
    ).nullable(),
    placeholder: "مثلا: 1",
  },
  {
    subLabel: "",
    id: "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف نشستن می شد؟",
    label:
      "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف نشستن می شد؟",
    type: "time",
    validation: Yup.string(
      "لطفا زمان نشستن با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 2",
  },
  {
    //قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شد؟
    subLabel: "",
    id: "75",
    label:
      "قبل از ابتلا به بیماری، به طور روزانه، چند ساعت از زمان شما صرف فعالیت های با شدت خفیف مانند پیاده روی معمولی و انجام کارهای منزل مثل خرید، شستن ظرف ها و ... می شد؟",
    type: "time",
    validation: Yup.string(
      "لطفا ساعت فعالیت خفیف با کیبورد انگلیسی و به درستی وارد کنید"
    ).required("لطفا ساعت و دقیقه را وارد نمایید"),
    placeholder: "مثلا: 1",
  },
];
const questionType = "abadancasedemographic";
export default function CaseDemographic() {
  let isCompletedBefore = localStorage.getItem(questionType);
  return (
    <>
      {isCompletedBefore ? (
        swal({
          title: "شما قبلا این پرسشنامه را پر کرده اید",
          icon: "error",
          buttons: "متوجه شدم",
        })
      ) : (
        <div className="border-2 my-1 border-blue-500 rounded-lg w-[95%] m-auto">
          <div className="bg-blue-500 rounded-t-lg p-2 text-white font-bold text-xl">
            پرسشنامه
          </div>
          <DynamicForm questionType={questionType} questions={questions} />
        </div>
      )}
    </>
  );
}
